<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>21. Linux&#35774;&#22791;&#27169;&#22411;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL-NS Stylesheets V1.75.2"><link rel="home" href="index.html" title="Linux&#20869;&#26680;&#23398;&#20064;&#21644;&#30740;&#31350;&#21450;&#23884;&#20837;&#24335;(ARM)&#23398;&#20064;&#21644;&#30740;&#31350;&#30340;&#24320;&#25918;&#25991;&#26723;"><link rel="up" href="index.html" title="Linux&#20869;&#26680;&#23398;&#20064;&#21644;&#30740;&#31350;&#21450;&#23884;&#20837;&#24335;(ARM)&#23398;&#20064;&#21644;&#30740;&#31350;&#30340;&#24320;&#25918;&#25991;&#26723;"><link rel="prev" href="ar01s20.html" title="20. &#20869;&#26680;&#21516;&#27493;"><link rel="next" href="ar01s22.html" title="22. &#32593;&#32476;&#35774;&#22791;&#39537;&#21160;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">21. Linux&#35774;&#22791;&#27169;&#22411;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ar01s20.html">&#19978;&#19968;&#39029;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="ar01s22.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="sect1" title="21. Linux&#35774;&#22791;&#27169;&#22411;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="idp81712956"></a>21. Linux&#35774;&#22791;&#27169;&#22411;</h2></div></div></div>
<div class="sect2" title="21.1. &#35774;&#22791;&#25991;&#20214;"><div class="titlepage"><div><div><h3 class="title"><a name="idp81713300"></a>21.1. &#35774;&#22791;&#25991;&#20214;</h3></div></div></div>
<p>
&#31867;UNIX&#25805;&#20316;&#31995;&#32479;&#26377;&#19968;&#20010;&#28145;&#20026;&#20154;&#30693;&#30340;&#27010;&#24565;&#65306;&#19968;&#20999;&#30342;&#25991;&#20214;(&#23613;&#31649;&#26377;&#20123;&#35774;&#22791;&#24182;&#19981;&#20197;&#25991;&#20214;&#30340;&#24418;&#24335;&#23384;&#22312;&#65292;&#27604;&#22914;&#32593;&#32476;&#35774;&#22791;&#25110;&#32773;&#26434;&#21512;&#35774;&#22791;)&#12290;&#35774;&#22791;&#25991;&#20214;&#26159;&#19968;&#31867;&#29305;&#27530;&#30340;&#25991;&#20214;&#65292;&#25105;&#20204;&#21487;&#20197;&#36890;&#36807;file&#21629;&#20196;&#26469;&#21306;&#20998;&#23427;&#20204;&#65292;&#23613;&#31649;&#23427;&#20204;&#36890;&#24120;&#34987;&#38598;&#20013;&#25918;&#32622;&#22312;/dev&#19979;&#65306;
</p><pre class="programlisting">
# file test.c 
spi.c: ASCII C program text

# file /dev/null 
/dev/null: character special
</pre><p>
&#21487;&#20197;&#30475;&#21040;&#26222;&#36890;&#30340;ASCII&#25991;&#20214;&#21644;&#35774;&#22791;&#25991;&#20214;&#30340;&#21306;&#21035;&#65292;file&#21487;&#20197;&#37492;&#21035;&#20986;&#36890;&#24120;&#30340;&#23383;&#31526;&#35774;&#22791;&#21644;&#22359;&#35774;&#22791;&#65292;&#20063;&#21363;character&#21644;block&#30340;&#25552;&#31034;&#12290;&#21478;&#19968;&#20010;&#37492;&#21035;&#35774;&#22791;&#25991;&#20214;&#30340;&#21629;&#20196;&#26159;ls&#65306;
</p><pre class="programlisting">
# ls -l test.c 
-rw-r--r--    1 root     root             0 Mar  2 11:39 hello.c

]# ls -l /dev/null 
crw-rw-rw-    1 root     root        1,   3 Mar  2  2012 /dev/null
# ls -l /dev/mtdblock0
brw-rw----    1 root     root       31,   0 Mar  2  2012 /dev/mtdblock0
</pre><p>
&#38500;&#20102;&#35775;&#38382;&#26435;&#38480;&#21644;&#25152;&#23646;&#29992;&#25143;&#21450;&#29992;&#25143;&#32452;&#36825;&#20123;&#23646;&#24615;&#30456;&#21516;&#20197;&#22806;&#65292;&#21306;&#21035;&#26159;&#26126;&#26174;&#30340;&#65306;
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">&#35775;&#38382;&#26435;&#38480;&#20043;&#21069;&#30340;&#23383;&#27597;&#26159;c&#25110;b&#65292;&#20998;&#21035;&#34920;&#31034;&#23383;&#31526;&#35774;&#22791;&#21644;&#22359;&#35774;&#22791;&#12290;</li><li class="listitem">&#35774;&#22791;&#25991;&#20214;&#30340;&#38271;&#24230;&#23383;&#27573;&#34987;&#20027;&#35774;&#22791;&#21495;&#21644;&#20174;&#35774;&#22791;&#21495;&#20195;&#26367;&#65292;&#20108;&#32773;&#21487;&#20197;&#21807;&#19968;&#26631;&#35782;&#19968;&#20010;&#35774;&#22791;&#12290;</li></ul></div><p>
</p>
<div class="sect3" title="21.1.1. &#21019;&#24314;&#35774;&#22791;&#25991;&#20214;"><div class="titlepage"><div><div><h4 class="title"><a name="idp81716428"></a>21.1.1. &#21019;&#24314;&#35774;&#22791;&#25991;&#20214;</h4></div></div></div>
<div class="sect4" title="21.1.1.1. &#38745;&#24577;&#21019;&#24314;"><div class="titlepage"><div><div><h5 class="title"><a name="idp81716684"></a>21.1.1.1. &#38745;&#24577;&#21019;&#24314;</h5></div></div></div>
&#35774;&#22791;&#25991;&#20214;&#30340;&#23384;&#22312;&#20174;&#24863;&#23448;&#19978;&#34920;&#26126;&#23427;&#30340;&#23384;&#22312;&#65292;&#24182;&#19988;&#35774;&#22791;&#21517;&#21487;&#20197;&#24456;&#22909;&#30340;&#20196;&#20154;&#35760;&#24518;&#23427;&#65292;&#29978;&#33267;&#26159;&#23427;&#30340;&#20316;&#29992;&#12290;&#21019;&#24314;&#35774;&#22791;&#25991;&#20214;&#30340;&#26041;&#27861;&#24456;&#31616;&#21333;&#65306;
<pre class="programlisting">
Usage: mknod [OPTIONS] NAME TYPE MAJOR MINOR

# mknod hello c 20 1
# ls -l hello
crw-r--r--    1 root     root       20,   1 Mar  2 11:48 hello
</pre>
mknode&#30340;&#35821;&#27861;&#24456;&#31616;&#21333;&#65292;&#35774;&#22791;&#31867;&#22411;&#36890;&#36807;&#19968;&#20010;&#23383;&#31526;&#34920;&#31034;&#65306;c&#34920;&#31034;&#23383;&#31526;&#35774;&#22791;&#65292;b&#34920;&#31034;&#22359;&#35774;&#22791;&#65292;p&#34920;&#31034;&#31649;&#36947;&#25991;&#20214;(&#31649;&#36947;&#25991;&#20214;&#19981;&#26159;&#35774;&#22791;&#25991;&#20214;&#65292;&#26080;&#38656;&#25351;&#23450;&#20027;&#20174;&#35774;&#22791;&#21495;)&#12290;
<pre class="programlisting">
        b:      Make a block device
        c or u: Make a character device
        p:      Make a named pipe (MAJOR and MINOR are ignored)
</pre>
<p>&#36890;&#36807;mknode&#25163;&#21160;&#21019;&#24314;&#35774;&#22791;&#25991;&#20214;&#21487;&#20197;&#29992;&#20110;&#24050;&#30693;&#35774;&#22791;&#21495;&#30340;&#24773;&#20917;&#19979;&#65292;&#21487;&#20197;&#22312;&#21019;&#24314;&#25991;&#20214;&#31995;&#32479;&#26102;&#30452;&#25509;&#21019;&#24314;&#65292;&#24403;&#28982;&#22914;&#26524;&#25991;&#20214;&#31995;&#32479;&#19981;&#26159;&#21487;&#20889;&#30340;&#65292;&#37027;&#20040;&#20063;&#24517;&#39035;&#22312;&#21046;&#20316;&#25991;&#20214;&#31995;&#32479;&#26102;&#25163;&#21160;&#21019;&#24314;(&#36825;&#24847;&#21619;&#30528;&#25152;&#26377;&#20027;&#20174;&#35774;&#22791;&#21495;&#37117;&#38656;&#20107;&#20808;&#30830;&#23450;)&#12290;</p>
</div>
<div class="sect4" title="21.1.1.2. &#21160;&#24577;&#21019;&#24314;"><div class="titlepage"><div><div><h5 class="title"><a name="idp81718420"></a>21.1.1.2. &#21160;&#24577;&#21019;&#24314;</h5></div></div></div>
<p>&#25163;&#21160;&#21019;&#24314;&#20007;&#22833;&#20102;&#21019;&#24314;&#35774;&#22791;&#25991;&#20214;&#30340;&#28789;&#27963;&#24615;&#65306;&#26377;&#20123;&#26102;&#20505;&#25105;&#20204;&#24076;&#26395;&#20869;&#26680;&#33258;&#21160;&#20998;&#37197;&#26410;&#29992;&#30340;&#20027;&#20174;&#35774;&#22791;&#21495;&#65292;&#24182;&#19988;&#22312;&#35774;&#22791;&#39537;&#21160;&#21152;&#36733;&#26102;&#21160;&#24577;&#21019;&#24314;&#35774;&#22791;&#25991;&#20214;&#65306;&#27604;&#22914;USB&#35774;&#22791;&#65292;SD&#21345;&#31561;&#12290;&#21478;&#22806;&#25163;&#21160;&#21019;&#24314;&#20250;&#23548;&#33268;&#23613;&#37327;&#21019;&#24314;&#26356;&#22810;&#30340;&#35774;&#22791;&#25991;&#20214;&#65292;&#23613;&#31649;&#23427;&#20204;&#27809;&#26377;&#29992;&#65292;&#20063;&#35201;&#26377;&#22791;&#26080;&#24739;&#65292;&#36825;&#23548;&#33268;&#25105;&#20204;&#19981;&#30693;&#36947;&#23454;&#38469;&#30340;&#31995;&#32479;&#20013;&#21040;&#24213;&#21738;&#20010;&#35774;&#22791;&#26159;&#27963;&#21160;&#30340;&#12290;</p>
<p>
&#26089;&#26399;&#30340; Linux &#29256;&#26412;&#20013;&#23601;&#26159;&#22914;&#27492;&#65292;/dev&#30446;&#24405;&#21253;&#21547;&#20102;&#25152;&#26377;&#21487;&#33021;&#20986;&#29616;&#30340;&#35774;&#22791;&#30340;&#35774;&#22791;&#25991;&#20214;&#12290;&#24456;&#38590;&#24819;&#35937; Linux &#29992;&#25143;&#22914;&#20309;&#22312;&#36825;&#20123;&#22823;&#37327;&#30340;&#35774;&#22791;&#25991;&#20214;&#20013;&#25214;&#21040;&#21305;&#37197;&#26465;&#20214;&#30340;&#35774;&#22791;&#25991;&#20214;&#12290;udev&#26159;Linux2.6&#20869;&#26680;&#24341;&#20837;&#30340;&#19968;&#20010;&#21151;&#33021;&#65292;&#23427;&#26367;&#20195;&#20102;&#21407;&#26469;&#30340;devfs&#65292;&#25104;&#20026;&#24403;&#21069;Linux &#40664;&#35748;&#30340;&#35774;&#22791;&#31649;&#29702;&#24037;&#20855;&#12290;udevd&#22312;&#29992;&#25143;&#31354;&#38388;&#20197;&#23432;&#25252;&#36827;&#31243;&#30340;&#24418;&#24335;&#36816;&#34892;&#65292;&#36890;&#36807;&#20390;&#21548;&#20869;&#26680;&#21457;&#20986;&#26469;&#30340;uevent&#20107;&#20214;&#26469;&#21160;&#24577;&#21019;&#24314; /dev&#30446;&#24405;&#19979;&#30340;&#35774;&#22791;&#25991;&#20214;&#12290;&#19981;&#20687;&#20043;&#21069;&#30340;&#35774;&#22791;&#31649;&#29702;&#24037;&#20855;&#65292;udevd&#22312;&#29992;&#25143;&#31354;&#38388;&#36816;&#34892;&#65292;&#32780;&#19981;&#22312;&#20869;&#26680;&#31354;&#38388;&#36816;&#34892;&#12290;
</p>
<p>
&#29616;&#22312; udev &#21482;&#20026;&#37027;&#20123;&#36830;&#25509;&#21040; Linux &#25805;&#20316;&#31995;&#32479;&#30340;&#35774;&#22791;&#20135;&#29983;&#35774;&#22791;&#25991;&#20214;&#12290;udevd&#23432;&#25252;&#36827;&#31243;&#36890;&#36807;inotify&#26426;&#21046;&#30417;&#27979;sys/class&#19979;&#30340;&#25991;&#20214;&#21464;&#21160;&#65292;&#19968;&#26086;&#26816;&#27979;&#21040;&#20869;&#26680;&#21019;&#24314;&#20102;dev&#25991;&#20214;&#65292;&#21017;&#20351;&#29992;&#35813;&#25991;&#20214;&#20013;&#25351;&#23450;&#30340;&#35774;&#22791;&#20027;&#20174;&#35774;&#22791;&#21495;&#22312;/dev&#19979;&#21019;&#24314;&#35774;&#22791;&#25991;&#20214;&#65306;
</p><pre class="programlisting">
[root@OK6410 /sys/class/tty]# ls -l ttySAC0
lrwxrwxrwx    1 root     root             0 Mar  2  2012 ttySAC0 -&gt; ../../devices/platform/s3c6400-uart.0/tty/ttySAC0

[root@OK6410 /sys/class/tty]#cd ttySAC0 &amp;&amp; ls -l
total 0
-r--r--r--    1 root     root          4096 Mar  2  2012 dev
lrwxrwxrwx    1 root     root             0 Mar  2  2012 device -&gt; ../../../s3c6400-uart.0
lrwxrwxrwx    1 root     root             0 Mar  2  2012 subsystem -&gt; ../../../../../class/tty
-rw-r--r--    1 root     root          4096 Mar  2  2012 uevent
[/sys/devices/platform/s3c64xx-rtc/rtc/rtc0]# cat dev
204:64
</pre><p>
&#19968;&#26086;&#20018;&#21475;&#39537;&#21160;&#36890;&#36807;&#20869;&#26680;&#25552;&#20379;&#30340;&#39537;&#21160;&#27169;&#22411;&#22312;&#20869;&#26680;&#21152;&#36733;&#65292;&#20869;&#26680;&#23558;&#22312;/sys/class/tty&#19979;&#21019;&#24314;ttySAC0&#65292;&#35813;&#25991;&#20214;&#26159;&#19968;&#20010;&#25351;&#21521;&#35774;&#22791;&#25991;&#20214;&#23646;&#24615;&#25991;&#20214;&#22841;&#30340;&#38142;&#25509;&#65292;&#20854;&#20013;&#30340;dev&#35760;&#24405;&#20102;&#35774;&#22791;&#30340;&#20027;&#20174;&#21495;&#12290;&#29992;&#25143;&#31354;&#38388;&#30340;udevd&#26816;&#27979;&#27979;&#21040;&#36825;&#19968;&#21160;&#20316;&#65292;&#21017;&#22312;/dev&#19979;&#21019;&#24314;&#21517;&#20026;ttySAC0&#30340;&#35774;&#22791;&#25991;&#20214;&#65306;
</p><pre class="programlisting">
# ls -l /dev/ttySA
C0
crw-rw----    1 root     root      204,  64 Mar  2 13:15 /dev/ttySAC0
</pre><p>
&#22312;&#23884;&#20837;&#24335;&#36719;&#20214;&#24179;&#21488;&#20013;&#65292;busybox&#25552;&#20379;&#20102;mdev&#26469;&#27169;&#25311;udevd&#65292;&#23427;&#30340;&#21407;&#29702;&#19982;udevd&#31867;&#20284;&#65292;&#20294;&#26159;&#24182;&#27809;&#26377;&#20351;&#29992;inotify&#26426;&#21046;&#65292;&#32780;&#26159;&#36890;&#36807;&#19981;&#20572;&#30340;&#25195;&#25551;sys/class&#19979;&#30340;&#25991;&#20214;&#22841;&#26469;&#23454;&#29616;&#25991;&#20214;&#30417;&#27979;&#12290;&#19982;&#27492;&#21516;&#26102;/dev&#25991;&#20214;&#22841;&#19981;&#29992;&#22312;&#21019;&#24314;&#21040;&#23454;&#38469;&#30340;&#25991;&#20214;&#31995;&#32479;&#20013;&#65292;&#32780;&#21644;/tmp&#30446;&#24405;&#19968;&#26679;&#65292;&#24314;&#31435;&#22312;&#20869;&#23384;&#20013;&#21363;&#21487;&#65306;
</p><pre class="programlisting">
mount -t ramfs none /dev
</pre><p>
</p>
</div>
</div>
<div class="sect3" title="21.1.2. &#20027;&#20174;&#35774;&#22791;&#21495;"><div class="titlepage"><div><div><h4 class="title"><a name="idp81723788"></a>21.1.2. &#20027;&#20174;&#35774;&#22791;&#21495;</h4></div></div></div>
&#20256;&#32479;&#19978;, &#20027;&#32534;&#21495;&#26631;&#35782;&#35774;&#22791;&#30456;&#36830;&#30340;&#39537;&#21160;&#12290;&#20363;&#22914;/dev/null&#21644;/dev/zero&#37117;&#30001;&#39537;&#21160;1&#26469;&#31649;&#29702;, &#34394;&#25311;&#25511;&#21046;&#21488;
&#21644;&#20018;&#21475;&#32456;&#31471;&#37117;&#30001;&#39537;&#21160;4&#31649;&#29702;;&#29616;&#20195; Linux &#20869;&#26680;&#20801;&#35768;&#22810;&#20010;&#39537;&#21160;&#20849;&#20139;&#20027;&#32534;&#21495;, &#20294;&#26159;&#30475;&#21040;&#30340;&#22823;&#37096;&#20998;&#35774;&#22791;&#20173;&#28982;&#25353;&#29031;&#19968;&#20010;&#20027;&#32534;&#21495;&#19968;&#20010;&#39537;&#21160;&#30340;&#21407;&#21017;&#26469;&#32452;&#32455;&#12290;&#24403;&#21069;&#26032;&#39537;&#21160;&#31243;&#24207;&#20998;&#37197;&#20027;&#20174;&#35774;&#22791;&#21495;&#26102;&#65292;&#20027;&#35201;&#36890;&#36807;&#19968;&#20010;&#21322;&#23448;&#26041;&#32452;&#32455;&#31649;&#29702;&#12290;&#21482;&#26377;&#36981;&#24490;&#35813;&#21015;&#34920;&#30340;&#35774;&#22791;&#39537;&#21160;&#25165;&#21487;&#33021;&#21253;&#21547;&#21040;&#20869;&#26680;&#26631;&#20934;&#21457;&#24067;&#29256;&#20013;&#12290;Linux&#20869;&#26680;&#20013;&#30340;Documentation/devices.txt&#20063;&#32473;&#20986;&#20102;&#35813;&#29256;&#26412;&#21457;&#24067;&#26102;&#25152;&#29992;&#30340;&#35774;&#22791;&#21495;&#25968;&#25454;&#12290;&#35774;&#22791;&#21495;&#29992;dev_t&#31867;&#22411;&#23450;&#20041;&#65306;
<pre class="programlisting">
linux/types.h
typedef __u32 __kernel_dev_t;
typedef __kernel_dev_t dev_t;
</pre>
&#19968;&#20010;&#26080;&#31526;&#21495;32&#20301;&#25972;&#22411;&#25968;&#65292;&#21516;&#26102;&#21253;&#25324;&#20102;&#20027;&#27425;&#35774;&#22791;&#21495;&#12290;&#20854;&#20013;&#27492;&#35774;&#22791;&#21495;&#21344;&#29992;&#20302;20&#20301;&#65292;&#20027;&#35774;&#22791;&#21495;&#20026;12&#20301;&#12290;&#20869;&#26680;&#23450;&#20041;&#20102;&#20004;&#20010;&#23439;&#26469;&#33719;&#21462;&#20027;&#27425;&#35774;&#22791;&#21495;&#65306;
<pre class="programlisting">
linux/kdev_t.h
#define MINORBITS	20
#define MINORMASK	((1U &lt;&lt; MINORBITS) - 1)

#define MAJOR(dev)	((unsigned int) ((dev) &gt;&gt; MINORBITS))
#define MINOR(dev)	((unsigned int) ((dev) &amp; MINORMASK))
</pre>
MKDEV&#23439;&#26681;&#25454;&#20027;&#35774;&#22791;&#21644;&#27425;&#35774;&#22791;&#21495;&#29983;&#25104;dev_t&#12290;&#39537;&#21160;&#29992;&#25143;&#24212;&#35813;&#20351;&#29992;&#36825;&#19977;&#20010;&#23439;&#26469;&#25805;&#20316;&#35774;&#22791;&#21495;&#65292;&#20197;&#20445;&#35777;&#20195;&#30721;&#30340;&#31227;&#26893;&#24615;&#12290;
<pre class="programlisting">
#define MKDEV(ma,mi)	(((ma) &lt;&lt; MINORBITS) | (mi))
</pre>
<div class="sect4" title="21.1.2.1. &#30003;&#35831;&#35774;&#22791;&#21495;"><div class="titlepage"><div><div><h5 class="title"><a name="idp81726324"></a>21.1.2.1. &#30003;&#35831;&#35774;&#22791;&#21495;</h5></div></div></div>
&#22312;&#24314;&#31435;&#19968;&#20010;&#23383;&#31526;&#39537;&#21160;&#26102;&#20320;&#30340;&#39537;&#21160;&#38656;&#35201;&#20570;&#30340;&#31532;&#19968;&#20214;&#20107;&#26159;&#33719;&#21462;&#19968;&#20010;&#25110;&#22810;&#20010;&#35774;&#22791;&#32534;&#21495;&#26469;&#20351;&#29992;&#65292;register_chrdev_region&#20989;&#25968;&#25552;&#20379;&#20102;&#35813;&#21151;&#33021;&#65306;
<pre class="programlisting">
linux/fs.h
int register_chrdev_region(dev_t from, unsigned count, const char *name);
</pre>
from&#35760;&#24405;&#20102;&#24076;&#26395;&#20998;&#37197;&#20102;&#35774;&#22791;&#21495;&#30340;&#24320;&#22987;&#20540;&#65292;&#32780;count&#21017;&#25351;&#26126;&#20998;&#37197;&#20960;&#20010;&#35774;&#22791;&#21495;&#65292;&#25152;&#20197;&#20998;&#37197;&#25104;&#21151;&#30340;&#35774;&#22791;&#21495;&#20301;&#20110;[from, from + count)&#20043;&#38388;&#12290;name &#26159;&#36830;&#25509;&#21040;&#36825;&#20010;&#32534;&#21495;&#33539;&#22260;&#30340;&#35774;&#22791;&#30340;&#21517;&#23376;; &#23427;&#20250;&#20986;&#29616;&#22312;/proc/devices&#20013;&#12290;&#19968;&#20010;&#31034;&#20363;&#31243;&#24207;&#22914;&#19979;&#65306;
<pre class="programlisting">
static int __init dev_number_init(void)
{
	int ret;
	dev_t devno = MKDEV(TEST_MAJOR, 0);

	ret = register_chrdev_region(devno, 2, DEVICE_NAME);	
	if(ret &lt; 0)
	{
		printk(KERN_NOTICE "can not register test for %d\n", ret);
		return ret;
	}
	......

	return 0;
}
</pre>
&#23427;&#23581;&#35797;&#20174;devno&#24320;&#22987;&#20998;&#37197;2&#20010;&#35774;&#22791;&#21495;&#65292;&#22914;&#26524;&#25104;&#21151;&#36820;&#22238;0&#65292;&#21542;&#21017;&#36820;&#22238;&#19968;&#20010;&#36127;&#25968;&#12290;&#25191;&#34892;&#25104;&#21151;&#21518;&#65292;&#21487;&#20197;&#22312;/proc/devices&#20013;&#25214;&#21040;DEVICE_NAME&#65292;&#27880;&#24847;&#21069;&#38754;&#30340;&#32534;&#21495;&#26159;&#20027;&#35774;&#22791;&#21495;&#65306;
<pre class="programlisting">
# cat /proc/devices
Character devices:
......
100 test
......
</pre>
register_chrdev_region&#21487;&#20197;&#30003;&#35831;&#20960;&#20010;&#36830;&#32493;&#30340;&#35774;&#22791;&#21495;&#65292;&#23427;&#26159;&#23545;__register_chrdev_region&#20989;&#25968;&#30340;&#23553;&#35013;&#65292;&#35813;&#20989;&#25968;&#27599;&#27425;&#30003;&#35831;&#19968;&#20010;&#20027;&#35774;&#22791;&#21495;&#65292;&#20197;&#21450;&#21487;&#20197;&#22312;&#36825;&#20010;&#20027;&#35774;&#22791;&#21495;&#33539;&#22260;&#20869;&#30340;&#19968;&#20010;&#27425;&#35774;&#22791;&#21495;&#33539;&#22260;&#65306;
<pre class="programlisting">
fs/char_dev.c
static struct char_device_struct *
__register_chrdev_region(unsigned int major, unsigned int baseminor,
			   int minorct, const char *name);
</pre>
&#21069;&#20004;&#20010;&#21442;&#25968;&#20998;&#21035;&#25351;&#26126;&#30003;&#35831;&#35774;&#22791;&#21495;&#30340;&#20027;&#27425;&#32534;&#21495;&#65292;&#22914;&#26524;major&#20026;0&#65292;&#21017;&#33258;&#21160;&#36873;&#25321;&#19968;&#20010;&#20027;&#35774;&#22791;&#21495;&#65292;minorct(minor counter)&#25351;&#26126;&#20301;&#20110;&#27492;&#35774;&#22791;&#21495;&#20869;&#21487;&#20197;&#34920;&#31034;&#30340;&#19968;&#20010;&#33539;&#22260;&#12290;&#27880;&#24847;&#21040;&#35813;&#20989;&#25968;&#30340;&#36820;&#22238;&#20540;&#20026;struct char_device_struct&#32467;&#26500;&#65292;&#23427;&#20195;&#34920;&#20102;&#19968;&#31867;&#20351;&#29992;&#21516;&#19968;&#35774;&#22791;&#39537;&#21160;&#30340;&#23383;&#31526;&#35774;&#22791;&#30340;&#23384;&#22312;&#65292;&#35813;&#32467;&#26500;&#35760;&#24405;&#20102;&#19968;&#20010;&#20027;&#35774;&#22791;&#21495;&#65292;&#20197;&#21450;&#27425;&#35774;&#22791;&#21495;&#33539;&#22260;&#30340;&#24320;&#22987;&#32534;&#21495;&#65292;&#20197;&#21450;&#36830;&#32493;&#30340;&#32534;&#21495;&#33539;&#22260;&#12290;
<pre class="programlisting">
fs/char_dev.c
static struct char_device_struct {
	struct char_device_struct *next;
	unsigned int major;
	unsigned int baseminor;
	int minorct; /* minor counter */
	char name[64];
	struct cdev *cdev;		/* will die */
} *chrdevs[CHRDEV_MAJOR_HASH_SIZE];
</pre>
&#25152;&#26377;&#30340;&#23383;&#31526;&#35774;&#22791;&#21495;&#30340;&#20998;&#37197;&#24773;&#20917;&#22343;&#35760;&#24405;&#22312;&#19968;&#20010;&#21517;&#20026;chrdevs&#30340;&#21704;&#24076;&#34920;&#20013;&#65292;&#36825;&#20010;&#34920;&#30340;&#22823;&#23567;&#20026;CHRDEV_MAJOR_HASH_SIZE&#12290;&#23427;&#22312;fs.h&#20013;&#34987;&#23450;&#20041;&#20026;255&#12290;&#25955;&#21015;&#31639;&#27861;&#26159;&#25226;&#27599;&#20010;&#32534;&#21495;&#33539;&#22260;&#30340;&#23383;&#31526;&#35774;&#22791;&#30340;&#20027;&#35774;&#22791;&#21495;&#20197; 255 &#21462;&#27169;&#25554;&#20837;&#30456;&#24212;&#30340;&#25955;&#21015;&#34920;&#20013;&#12290;&#21516;&#19968;&#20010;&#25955;&#21015;&#34920;&#20013;&#30340;&#23383;&#31526;&#35774;&#22791;&#32534;&#21495;&#33539;&#22260;&#26159;&#25353;&#36215;&#22987;&#27425;&#35774;&#22791;&#21495;&#36882;&#22686;&#25490;&#24207;&#30340;&#12290;
<div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">next&#26159;&#25351;&#21521;&#25955;&#21015;&#20914;&#31361;&#38142;&#34920;&#20013;&#30340;&#19979;&#19968;&#20010;&#20803;&#32032;&#30340;&#25351;&#38024;&#12290;</li><li class="listitem">major&#21644;baseminor&#35760;&#24405;&#20102;&#20027;&#35774;&#22791;&#21495;&#20197;&#21450;&#27492;&#35774;&#22791;&#21495;&#33539;&#22260;&#30340;&#36215;&#22987;&#32534;&#21495;&#12290;</li><li class="listitem">minorct &#35760;&#24405;&#20102;&#27425;&#35774;&#22791;&#21495;&#30340;&#33539;&#22260;&#65292;&#20063;&#21363;&#20174;baseminor&#24320;&#22987;&#65292;&#21487;&#20197;&#20351;&#29992;&#30340;&#20010;&#25968;&#12290;&#20294;&#26159;&#27880;&#24847;&#20174;&#32534;&#21495;&#30340;&#33539;&#22260;&#26159;[baseminor&#65292;baseminor + minorct)&#12290;</li><li class="listitem">name &#25351;&#26126;&#35813;&#35774;&#22791;&#32534;&#21495;&#33539;&#22260;&#20869;&#30340;&#35774;&#22791;&#39537;&#21160;&#30340;&#21517;&#31216;&#65292;&#23427;&#20195;&#34920;&#20102;&#19968;&#20010;char_device_struct&#32467;&#26500;&#20307;&#12290;
</li><li class="listitem">cdev&#25351;&#21521;&#23383;&#31526;&#35774;&#22791;&#39537;&#21160;&#31243;&#24207;&#25551;&#36848;&#31526;&#30340;&#25351;&#38024;&#12290;&#30001;&#20110;Linux&#35774;&#22791;&#27169;&#22411;&#30340;&#20986;&#29616;&#65292;&#23427;&#24050;&#32463;&#19981;&#20877;&#26377;&#22823;&#30340;&#29992;&#22788;&#65292;&#38500;&#20102;&#29992;&#22312;&#32769;&#24335;&#30340;&#27880;&#20876;&#26041;&#27861;__register_chrdev&#21644;__unregister_chrdev&#20013;&#20197;&#20026;&#20102;&#20445;&#25345;&#21521;&#21518;&#20860;&#23481;&#22806;&#65292;&#23427;&#30340;&#21151;&#33021;&#24050;&#32463;&#34987;kobject&#23545;&#35937;cdev_map&#23436;&#20840;&#21462;&#20195;&#12290;</li></ul></div>
<div class="figure"><a name="idp81733052"></a><p class="title"><b>&#22270; 114. &#30003;&#35831;&#36328;&#20027;&#35774;&#22791;&#21495;&#30340;&#35774;&#22791;&#21495;</b></p><div class="figure-contents"><div><img src="images/device/devnum.gif" alt="&#30003;&#35831;&#36328;&#20027;&#35774;&#22791;&#21495;&#30340;&#35774;&#22791;&#21495;"></div></div></div><br class="figure-break">
&#22914;&#26524;&#30003;&#35831;&#30340;&#20174;&#35774;&#22791;&#21495;&#20301;&#20110;&#20004;&#20010;&#20027;&#35774;&#22791;&#21495;&#20043;&#38388;&#21602;&#65311;&#22914;&#19978;&#22270;&#25152;&#31034;&#65292;&#27492;&#26102;&#23558;&#21019;&#24314;&#20004;&#20010;char_device_struct&#30340;&#23454;&#20363;&#65292;&#25152;&#20197;&#20351;&#29992;&#21516;&#19968;&#31867;&#39537;&#21160;&#30340;&#35774;&#22791;&#20381;&#28982;&#21487;&#33021;&#20301;&#20110;&#19981;&#21516;&#30340;char_device_struct&#23454;&#20363;&#20013;&#65292;&#23613;&#31649;&#36825;&#22522;&#26412;&#19978;&#19981;&#20250;&#21457;&#29983;&#12290;&#35813;&#20989;&#25968;&#36890;&#24120;&#36820;&#22238;&#30340;&#38169;&#35823;&#26159;-16&#65292;&#36825;&#34920;&#31034;&#38656;&#35201;&#30003;&#35831;&#30340;&#35774;&#22791;&#21495;&#24050;&#34987;&#21344;&#29992;&#65292;&#25552;&#31034;&#20449;&#24687;&#20026;&#65306;
<pre class="programlisting">
Device or resource busy
</pre>
<div class="note" title="&#27880;&#24847;" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#27880;&#24847;</h3>&#22270;&#20013;&#27809;&#26377;&#20351;&#29992;&#20027;&#35774;&#22791;&#21495;0&#65292;&#26159;&#22240;&#20026;&#65292;&#24403;__register_chrdev_region&#30340;&#31532;&#19968;&#20010;&#21442;&#25968;&#20026;0&#26159;&#65292;&#23558;&#33258;&#21160;&#20998;&#37197;&#19968;&#20010;&#20027;&#35774;&#22791;&#21495;&#65292;&#20063;&#21363;&#20027;&#35774;&#22791;0&#20445;&#30041;&#20351;&#29992;&#12290;</div>
</div>
<div class="sect4" title="21.1.2.2. &#21160;&#24577;&#30003;&#35831;&#35774;&#22791;&#21495;"><div class="titlepage"><div><div><h5 class="title"><a name="idp81734852"></a>21.1.2.2. &#21160;&#24577;&#30003;&#35831;&#35774;&#22791;&#21495;</h5></div></div></div>
&#22312;&#24050;&#30693;&#26576;&#19968;&#31867;&#22411;&#35774;&#22791;&#30340;&#32479;&#19968;&#20998;&#37197;&#30340;&#35774;&#22791;&#21495;&#21518;&#65292;&#20351;&#29992;register_chrdev_region&#26159;&#19968;&#20010;&#19981;&#38169;&#30340;&#36873;&#25321;&#65292;&#20294;&#26159;&#19968;&#20123;&#35774;&#22791;&#65292;&#21487;&#33021;&#24182;&#27809;&#26377;&#32479;&#19968;&#35268;&#23450;&#30340;&#35774;&#22791;&#21495;&#65292;&#27492;&#26102;&#20351;&#29992;&#21160;&#24577;&#20998;&#37197;&#26159;&#21512;&#36866;&#30340;&#65292;&#22240;&#20026;&#36825;&#21487;&#20197;&#36991;&#20813;&#19981;&#24517;&#35201;&#30340;&#20914;&#31361;&#12290;register_chrdev_region&#22312;&#25552;&#20379;&#30340;&#31532;&#19968;&#20010;dev_t&#21442;&#25968;&#20013;&#65292;&#22914;&#26524;&#20027;&#35774;&#22791;&#21495;&#20026;0&#23558;&#33258;&#21160;&#20998;&#37197;&#20027;&#35774;&#22791;&#21495;&#65292;&#20294;&#26159;&#20869;&#26680;&#36824;&#19987;&#38376;&#25552;&#20379;&#20102;&#19968;&#20010;&#21160;&#24577;&#20998;&#37197;&#20027;&#35774;&#22791;&#21495;&#30340;&#31243;&#24207;alloc_chrdev_region&#65292;&#26174;&#28982;&#23427;&#23601;&#26159;&#23545;__register_chrdev_region&#30340;&#31532;&#19968;&#20010;&#21442;&#25968;&#35774;&#32622;&#20026;0&#23454;&#29616;&#21160;&#24577;&#20998;&#37197;&#30340;&#12290;
<pre class="programlisting">
int alloc_chrdev_region(dev_t *dev, unsigned int firstminor, unsigned int count, char *name)
{
	struct char_device_struct *cd;
	cd = __register_chrdev_region(0, baseminor, count, name);
	if (IS_ERR(cd))
		return PTR_ERR(cd);
	*dev = MKDEV(cd-&gt;major, cd-&gt;baseminor);
	return 0;
}
</pre>
&#21160;&#24577;&#20998;&#37197;&#20027;&#35774;&#22791;&#21495;&#30340;&#21407;&#21017;&#26159;&#20174;&#25955;&#21015;&#34920;&#30340;&#26368;&#21518;&#19968;&#20010;&#34920;&#39033;&#21521;&#21069;&#23547;&#25214;&#65292;&#22914;&#26524;&#26159;&#31354;&#30340;&#65292;&#20027;&#35774;&#22791;&#21495;&#23601;&#26159;&#30456;&#24212;&#25955;&#21015;&#34920;&#30340;&#24207;&#21495;&#12290;&#25152;&#20197;&#21160;&#24577;&#20998;&#37197;&#30340;&#20027;&#35774;&#22791;&#21495;&#24635;&#26159;&#23567;&#20110;256&#65292;&#22914;&#26524;&#27599;&#20010;&#25955;&#21015;&#39033;&#37117;&#26377;&#23383;&#31526;&#35774;&#22791;&#21344;&#25454;&#20102;&#65292;&#37027;&#21160;&#24577;&#20998;&#37197;&#23601;&#20250;&#22833;&#36133;&#12290;&#35813;&#20989;&#25968;&#30340;&#31532;&#19968;&#20010;&#21442;&#25968;&#29992;&#26469;&#36820;&#22238;&#31532;&#19968;&#20010;&#35774;&#22791;&#21495;&#12290;&#31532;&#20108;&#20010;&#21442;&#25968;&#20026;&#20174;&#35774;&#22791;&#21495;&#33539;&#22260;&#30340;&#31532;&#19968;&#20010;&#35774;&#22791;&#21495;&#12290;
<p>
&#19968;&#20010;&#20196;&#20154;&#39047;&#24863;&#22855;&#24618;&#30340;&#22320;&#26041;&#26102;&#65292;&#35813;&#20989;&#25968;&#19981;&#23545;count&#20570;&#20219;&#20309;&#38480;&#21046;&#65292;&#25152;&#20197;&#25552;&#20379;&#19968;&#20010;&#38750;&#24120;&#22823;&#30340;&#20540;&#65292;&#24182;&#19988;&#36275;&#20197;&#36229;&#36807;&#35813;&#20027;&#35774;&#22791;&#21495;&#21487;&#20197;&#25903;&#25345;&#30340;&#20174;&#35774;&#22791;&#21495;(&#36890;&#24120;&#20026;2<sup>20</sup>)&#30340;&#20010;&#25968;&#26159;&#21487;&#33021;&#30340;&#65292;&#36825;&#37324;&#20043;&#25152;&#20197;&#19981;&#20570;&#26816;&#26597;&#65292;&#22522;&#20110;&#23545;&#20869;&#26680;&#24320;&#21457;&#20154;&#21592;&#33258;&#24459;&#30340;&#20551;&#35774;&#65292;&#22240;&#20026;&#36890;&#24120;&#22914;&#27492;&#22810;&#30340;&#20174;&#35774;&#22791;&#21495;&#26174;&#28982;&#26159;&#24694;&#24847;&#30340;&#34892;&#20026;&#65292;&#24182;&#19988;&#36825;&#23548;&#33268;&#35813;&#20027;&#35774;&#22791;&#21495;&#30340;&#28010;&#36153;&#65292;&#21478;&#22806;unregister_chrdev_region&#23545;&#36825;&#31181;&#24773;&#20917;&#23558;&#20250;&#27880;&#38144;&#22833;&#36133;&#65292;&#32780;&#26080;&#20219;&#20309;&#25552;&#31034;&#12290;
</p>
&#21160;&#24577;&#20998;&#37197;&#30340;&#32570;&#28857;&#26159;&#20320;&#26080;&#27861;&#25552;&#21069;&#21019;&#24314;&#35774;&#22791;&#33410;&#28857;, &#22240;&#20026;&#20998;&#37197;&#32473;&#20320;&#30340;&#27169;&#22359;&#30340;&#20027;&#32534;&#21495;&#20250;&#21464;&#21270;&#12290;&#23545;&#20110;&#39537;&#21160;&#30340;&#27491;&#24120;&#20351;&#29992;, &#36825;&#19981;&#26159;&#38382;&#39064;, &#22240;&#20026;&#19968;&#26086;&#32534;&#21495;&#20998;&#37197;&#20102;, &#20320;&#21487;&#20174;/proc/devices&#20013;&#35835;&#21462;&#23427;&#65292;&#25110;&#32773;&#24403;&#35813;&#35774;&#22791;&#21495;&#34987;&#30495;&#27491;&#20851;&#32852;&#21040;&#35774;&#22791;&#39537;&#21160;&#21518;&#21487;&#20197;&#20174;/sys&#19979;&#33719;&#21462;&#26356;&#35814;&#23613;&#30340;&#20449;&#24687;&#12290;
</div>
<div class="sect4" title="21.1.2.3. &#37322;&#25918;&#35774;&#22791;&#21495;"><div class="titlepage"><div><div><h5 class="title"><a name="idp81737420"></a>21.1.2.3. &#37322;&#25918;&#35774;&#22791;&#21495;</h5></div></div></div>
&#20219;&#20309;&#24050;&#20998;&#37197;&#30340;&#35774;&#22791;&#32534;&#21495;, &#24212;&#24403;&#22312;&#19981;&#20877;&#20351;&#29992;&#23427;&#20204;&#26102;&#37322;&#25918;&#23427;&#12290;&#35774;&#22791;&#32534;&#21495;&#30340;&#37322;&#25918;&#20351;&#29992;:
<pre class="programlisting">
void unregister_chrdev_region(dev_t from, unsigned count)
{
	dev_t to = from + count;
	dev_t n, next;

	for (n = from; n &lt; to; n = next) {
		next = MKDEV(MAJOR(n)+1, 0);
		if (next &gt; to)
			next = to;
		kfree(__unregister_chrdev_region(MAJOR(n), MINOR(n), next - n));
	}
}
</pre>
&#23427;&#26680;&#24515;&#23454;&#29616;&#26159;__unregister_chrdev_region&#65292;&#22312;&#35813;&#20989;&#25968;&#20013;&#23558;&#26681;&#25454;&#19977;&#20803;&#32032;(&#20027;&#65292;&#20174;&#36215;&#22987;&#21495;&#65292;&#33539;&#22260;)&#26469;&#21024;&#38500;char_device_struct&#32467;&#26500;&#20307;&#65292;&#20174;&#35813;&#20989;&#25968;&#30340;&#23454;&#29616;&#21487;&#20197;&#28165;&#26970;&#30340;&#30475;&#21040;&#65292;<span class="emphasis"><em>&#22914;&#26524;&#20351;&#29992;alloc_chrdev_region&#30003;&#35831;&#20102;&#19968;&#20010;&#22823;&#20110;&#20027;&#35774;&#22791;&#21495;&#21487;&#23481;&#32435;&#30340;&#20174;&#35774;&#22791;&#21495;&#30340;&#20010;&#25968;&#30340;&#23383;&#31526;&#35774;&#22791;&#65292;&#20351;&#29992;unregister_chrdev_region&#23558;&#26080;&#27861;&#37322;&#25918;&#12290;</em></span>&#36890;&#24120;&#22312;&#27169;&#22359;module_exit&#30340;&#28165;&#29702;&#20989;&#25968;&#20013;&#35843;&#29992;&#23427;&#12290;&#32487;&#32493;&#19978;&#38754;&#30340;&#31034;&#20363;&#65306;
<pre class="programlisting">
static void __exit dev_number_exit(void)
{
	unregister_chrdev_region(MKDEV(TEST_MAJOR, 0), 2); 
	......
}
</pre>
</div>
</div>
<div class="sect3" title="21.1.3. &#23383;&#31526;&#35774;&#22791;&#30340;&#21704;&#24076;&#34920;"><div class="titlepage"><div><div><h4 class="title"><a name="idp81740276"></a>21.1.3. &#23383;&#31526;&#35774;&#22791;&#30340;&#21704;&#24076;&#34920;</h4></div></div></div>
&#21069;&#38754;&#24050;&#32463;&#38750;&#24120;&#35814;&#32454;&#30340;&#20171;&#32461;&#20102;&#31649;&#29702;&#23383;&#31526;&#35774;&#22791;&#30340;&#21704;&#24076;&#34920;chrdevs[CHRDEV_MAJOR_HASH_SIZE]&#65292;&#24182;&#19988;&#35828;&#26126;&#20102;&#23427;&#30340;&#19968;&#20123;&#29305;&#24615;&#65292;&#23427;&#26681;&#25454;&#20027;&#35774;&#22791;&#21495;&#19982;CHRDEV_MAJOR_HASH_SIZE&#20313;&#25968;&#26469;&#20915;&#23450;&#35813;&#23383;&#31526;&#35774;&#22791;&#23545;&#24212;&#30340;struct char_device_struct&#23454;&#20363;&#25918;&#22312;&#21738;&#19968;&#20010;&#21704;&#24076;&#34920;&#39033;&#19978;&#65292;&#32780;&#30456;&#21516;&#20027;&#35774;&#22791;&#21495;&#30340;&#19981;&#21516;&#35774;&#22791;&#65292;&#23558;&#25353;&#29031;&#36215;&#22987;&#20174;&#35774;&#22791;&#21495;&#30340;&#22823;&#23567;&#25490;&#24207;&#65292;&#32780;&#27880;&#20876;&#23427;&#20204;&#30340;&#20989;&#25968;register_chrdev_region&#20445;&#35777;&#23427;&#20204;&#19981;&#20250;&#30456;&#20114;&#37325;&#21472;&#12290;
<div class="figure"><a name="idp81740988"></a><p class="title"><b>&#22270; 115. &#23383;&#31526;&#35774;&#22791;&#30340;&#21704;&#24076;&#34920;</b></p><div class="figure-contents"><div><img src="images/device/charhash.gif" alt="&#23383;&#31526;&#35774;&#22791;&#30340;&#21704;&#24076;&#34920;"></div></div></div><br class="figure-break">
&#27492;&#22806;&#65292;&#35813;&#21704;&#24076;&#34920;&#20351;&#29992;&#21517;&#20026;chrdevs_lock&#30340;&#20114;&#26021;&#38145;&#26469;&#20445;&#35777;&#23545;&#23427;&#30340;&#39034;&#24207;&#35775;&#38382;&#12290;
<pre class="programlisting">
static DEFINE_MUTEX(chrdevs_lock);
</pre>
<div class="sect4" title="21.1.3.1. &#30456;&#20851;&#30340;proc&#25509;&#21475;"><div class="titlepage"><div><div><h5 class="title"><a name="idp81742124"></a>21.1.3.1. &#30456;&#20851;&#30340;proc&#25509;&#21475;</h5></div></div></div>
/proc/devices&#26159;&#19968;&#20010;&#21476;&#32769;&#30340;&#25509;&#21475;&#65292;&#23613;&#31649;&#24403;&#21069;sysfs&#31995;&#32479;&#28176;&#28176;&#21462;&#20195;&#20102;&#23427;&#30340;&#20840;&#37096;&#21151;&#33021;&#65292;&#20294;&#26159;&#20381;&#28982;&#26159;&#19968;&#20010;&#31616;&#27905;&#26126;&#20102;&#30340;&#26597;&#30475;&#31995;&#32479;&#20869;&#35774;&#22791;&#27880;&#20876;&#24773;&#20917;&#30340;&#22909;&#36884;&#24452;&#12290;&#23427;&#21487;&#20197;&#36755;&#20986;&#23383;&#31526;&#35774;&#22791;&#21644;&#22359;&#35774;&#22791;&#30340;&#24773;&#20917;&#12290;
<pre class="programlisting">
# cat /proc/devices 
Character devices:
  1 mem
  4 /dev/vc/0
 ...... 
Block devices:
259 blkext
  8 sd
 31 mtdblock
 ......
</pre>
&#30456;&#20851;&#30340;&#23454;&#29616;&#20195;&#30721;&#20301;&#20110;fs/proc/devices.c&#19979;&#65292;&#20854;&#20013;&#30340;&#26174;&#31034;&#25805;&#20316;&#20301;&#20110;devinfo_show&#65292;&#32780;&#23427;&#35843;&#29992;&#20102;char_dev.c&#20013;&#30340;chrdev_show&#20197;&#21450;&#22359;&#35774;&#22791;&#30456;&#20851;&#30340;blkdev_show&#12290;
<pre class="programlisting">
static int __init proc_devices_init(void)
{
        proc_create("devices", 0, NULL, &amp;proc_devinfo_operations);
        return 0;
}
module_init(proc_devices_init);
</pre>
chrdev_show&#26681;&#25454;offset&#20540;&#36941;&#21382;&#20102;&#21704;&#24076;&#34920;chrdevs&#65292;seq_printf&#20989;&#25968;&#39318;&#20808;&#25171;&#21360;&#20986;&#20027;&#35774;&#22791;&#21495;&#65292;&#28982;&#21518;&#25171;&#21360;&#35774;&#22791;&#21517;&#31216;&#65292;&#22914;&#26524;&#30475;&#21040;&#20004;&#20010;&#36830;&#32493;&#30340;&#20027;&#35774;&#22791;&#21495;&#65292;&#24182;&#19988;&#35774;&#22791;&#21517;&#30456;&#21516;&#65292;&#37027;&#20040;&#24456;&#21487;&#33021;&#26159;&#27880;&#20876;&#20102;&#19968;&#20010;&#36328;&#20027;&#35774;&#22791;&#21495;&#30340;&#35774;&#22791;&#65292;&#23427;&#23454;&#38469;&#23545;&#24212;&#20102;&#22810;&#20010;char_device_struct&#23454;&#20363;&#12290;
<pre class="programlisting">
void chrdev_show(struct seq_file *f, off_t offset)
{
	struct char_device_struct *cd;

	if (offset &lt; CHRDEV_MAJOR_HASH_SIZE) {
		mutex_lock(&amp;chrdevs_lock);
		for (cd = chrdevs[offset]; cd; cd = cd-&gt;next)
			seq_printf(f, "%3d %s\n", cd-&gt;major, cd-&gt;name);
		mutex_unlock(&amp;chrdevs_lock);
	}
}
</pre>
</div>
</div>
&#21019;&#24314;&#22359;&#35774;&#22791;&#30340;&#26041;&#24335;&#19982;&#27492;&#31867;&#20284;&#65292;&#20294;&#26159;&#27809;&#26377;&#25552;&#20379;&#21160;&#24577;&#20998;&#37197;&#35774;&#22791;&#21495;&#30340;&#20989;&#25968;&#65292;&#20294;&#26159;&#31649;&#29702;&#30340;&#26041;&#24335;&#20381;&#28982;&#37319;&#29992;&#21704;&#24076;&#34920;&#65292;&#36825;&#37324;&#19981;&#20877;&#21333;&#29420;&#20998;&#26512;&#65292;&#30456;&#20851;&#30340;&#20989;&#25968;&#21644;&#32467;&#26500;&#20307;&#23450;&#20041;&#20301;&#20110;block/genhd.c&#12290;
</div>
<div class="sect2" title="21.2. &#23383;&#31526;&#35774;&#22791;&#27880;&#20876;"><div class="titlepage"><div><div><h3 class="title"><a name="idp81745260"></a>21.2. &#23383;&#31526;&#35774;&#22791;&#27880;&#20876;</h3></div></div></div>
&#23613;&#31649;&#25105;&#20204;&#30693;&#36947;&#20102;&#22914;&#20309;&#21019;&#24314;&#35774;&#22791;&#25991;&#20214;&#65292;&#20197;&#21450;&#30003;&#35831;&#19968;&#31995;&#21015;&#30340;&#35774;&#22791;&#21495;&#65292;&#20294;&#26159;&#23427;&#20204;&#21482;&#19981;&#36807;&#26159;&#23384;&#22312;&#20110;&#21704;&#24076;&#34920;chrdevs&#20013;&#30340;char_device_struct&#23454;&#20363;&#65292;&#27880;&#24847;&#21040;&#35813;&#32467;&#26500;&#20013;&#30340;struct cdev *cdev&#25104;&#21592;&#65292;&#23427;&#25351;&#21521;&#20102;&#23553;&#35013;&#30495;&#27491;&#23383;&#31526;&#35774;&#22791;&#39537;&#21160;&#30340;cdev&#32467;&#26500;&#20307;&#12290;
<pre class="programlisting">
linux/cdev.h
struct cdev {
	struct kobject kobj;
	struct module *owner;
	const struct file_operations *ops;
	struct list_head list;
	dev_t dev;
	unsigned int count;
};
</pre>
&#27880;&#24847;&#21040;ops&#21442;&#25968;&#65292;&#23427;&#25351;&#21521;&#19968;&#20010;struct file_operations&#32467;&#26500;&#20307;&#30340;&#31034;&#20363;&#65292;&#25152;&#26377;&#23545;cdev&#30340;&#21021;&#22987;&#21270;&#37117;&#38656;&#35201;&#22635;&#20805;&#23427;&#65292;&#23427;&#23553;&#35013;&#20102;&#25152;&#26377;&#23545;&#23383;&#31526;&#35774;&#22791;&#30340;&#25805;&#20316;&#25351;&#38024;&#12290;
<div class="sect3" title="21.2.1. &#20998;&#37197;&#21644;&#21021;&#22987;&#21270;cdev"><div class="titlepage"><div><div><h4 class="title"><a name="idp81746476"></a>21.2.1. &#20998;&#37197;&#21644;&#21021;&#22987;&#21270;cdev</h4></div></div></div>
&#23545;cdev&#32467;&#26500;&#20307;&#30340;&#20998;&#37197;&#26377;&#20004;&#31181;&#26041;&#24335;&#65306;&#21160;&#24577;&#20998;&#37197;&#21644;&#38745;&#24577;&#20998;&#37197;&#65292;&#20869;&#26680;&#25552;&#20379;&#20102;cdev_alloc&#20989;&#25968;&#23454;&#29616;&#21160;&#24577;&#20998;&#37197;&#65292;&#23427;&#19982;&#29992;&#25143;&#31354;&#38388;&#30340;malloc&#21151;&#33021;&#30456;&#20284;&#65306;
<pre class="programlisting">
struct cdev *cdev_alloc(void)
{
	struct cdev *p = kzalloc(sizeof(struct cdev), GFP_KERNEL);
	if (p) {
		INIT_LIST_HEAD(&amp;p-&gt;list);
		kobject_init(&amp;p-&gt;kobj, &amp;ktype_cdev_dynamic);
	}
	return p;
}
</pre>
&#27880;&#24847;&#21040;kobject_init&#20013;&#31532;&#20108;&#20010;&#21442;&#25968;&#65292;&#23427;&#19982;cdev&#32467;&#26500;&#20307;&#30340;&#37322;&#25918;&#25805;&#20316;&#26377;&#20851;&#65292;&#36825;&#20063;&#20915;&#23450;&#20102;&#36890;&#36807;cdev_alloc&#30003;&#35831;&#30340;&#32467;&#26500;&#20307;&#19968;&#23450;&#19981;&#21487;&#20197;&#25509;&#19979;&#37324;&#38745;&#24577;&#20998;&#37197;&#21021;&#22987;&#21270;&#25152;&#29992;&#30340;&#20989;&#25968;cdev_init&#26469;&#21021;&#22987;&#21270;&#12290;
<pre class="programlisting">
struct cdev *vcdev = cdev_alloc();
if (!vcdev)
	goto err;

vcdev-&gt;owner = THIS_MODULE;
vcdev-&gt;ops = &amp;vcdev_fops;
</pre>
&#21160;&#24577;&#20998;&#37197;&#36866;&#29992;&#20110;&#33719;&#24471;&#19968;&#20010;&#29420;&#31435;&#30340;cdev&#32467;&#26500;&#65292;&#24403;&#28982;&#20063;&#36866;&#29992;&#20110;&#20869;&#23884;cdev&#25351;&#38024;&#30340;&#32467;&#26500;&#20307;&#65292;&#22914;&#19979;&#25152;&#31034;&#12290;&#24403;&#28982;&#37319;&#29992;&#38745;&#24577;&#20998;&#37197;&#23558;&#26356;&#36866;&#21512;&#36825;&#31181;&#24212;&#29992;&#65292;&#22240;&#20026;&#21487;&#20197;&#26041;&#20415;&#30340;&#36890;&#36807;cdev&#30340;&#25351;&#38024;&#33719;&#21462;struct test_cdev&#30340;&#25351;&#38024;&#12290;
<pre class="programlisting">
struct vcdev {
	char name[16];
	/* case1 struct cdev *cdev; */
	struct cdev cdev; 
};
</pre>
&#37319;&#29992;&#38745;&#24577;&#20998;&#37197;&#30340;&#32467;&#26500;&#20307;&#20013;&#30340;cdev&#25104;&#21592;&#24212;&#35813;&#20351;&#29992;cdev_init&#26469;&#21021;&#22987;&#21270;&#65292;&#32780;&#38750;&#25163;&#21160;&#25351;&#23450;&#65292;&#36825;&#21462;&#20915;&#20110;ktype_cdev_default&#21644;ktype_cdev_dynamic&#30340;&#21306;&#21035;&#12290;
<pre class="programlisting">
void cdev_init(struct cdev *cdev, const struct file_operations *fops)
{
	memset(cdev, 0, sizeof *cdev);
	INIT_LIST_HEAD(&amp;cdev-&gt;list);
	kobject_init(&amp;cdev-&gt;kobj, &amp;ktype_cdev_default);
	cdev-&gt;ops = fops;
}
</pre>
&#20851;&#20110;kobject&#26426;&#21046;&#23558;&#22312;&#29305;&#23450;&#31456;&#33410;&#35814;&#32454;&#20998;&#26512;&#65292;&#36825;&#37324;&#27880;&#24847;&#21040;kobject_init&#30340;&#31532;&#20108;&#20010;&#21442;&#25968;struct kobj_type *ktype&#65292;&#20854;&#20013;&#30340;release&#20989;&#25968;&#20250;&#22312;cdev_del&#26102;&#34987;&#35843;&#29992;&#65306;
<pre class="programlisting">
fs/char_dev.c
static struct kobj_type ktype_cdev_default = {
	.release	= cdev_default_release,
};

static struct kobj_type ktype_cdev_dynamic = {
	.release	= cdev_dynamic_release,
};
</pre>
&#27880;&#24847;&#21040;cdev_dynamic_release&#20013;&#30340;kfree&#35843;&#29992;&#65292;&#23601;&#21487;&#20197;&#26126;&#30333;&#20004;&#31181;&#20998;&#37197;cdev&#23454;&#20363;&#30340;&#26041;&#24335;&#65292;&#38656;&#35201;&#23545;&#24212;&#30340;&#21021;&#22987;&#21270;&#26041;&#27861;&#12290;
<pre class="programlisting">
static void cdev_default_release(struct kobject *kobj)
{
	struct cdev *p = container_of(kobj, struct cdev, kobj);
	cdev_purge(p);
}

static void cdev_dynamic_release(struct kobject *kobj)
{
	struct cdev *p = container_of(kobj, struct cdev, kobj);
	cdev_purge(p);
	kfree(p);
}
</pre>
</div>
<div class="sect3" title="21.2.2. &#27880;&#20876;cdev"><div class="titlepage"><div><div><h4 class="title"><a name="idp81750820"></a>21.2.2. &#27880;&#20876;cdev</h4></div></div></div>
&#24403;cdev&#32467;&#26500;&#20307;&#34987;&#21021;&#22987;&#21270;&#23436;&#27605;&#21518;&#65292;&#24212;&#35813;&#21152;&#20837;&#20869;&#26680;&#65292;&#23427;&#20195;&#34920;&#20102;&#30495;&#27491;&#30340;&#23383;&#31526;&#35774;&#22791;&#65292;&#20869;&#26680;&#23558;&#23545;&#23427;&#36827;&#34892;&#32479;&#19968;&#31649;&#29702;&#65306;&#20998;&#37197;&#30456;&#20851;&#36164;&#28304;&#65292;&#25346;&#36733;&#21040;&#35774;&#22791;&#21495;&#23545;&#24212;&#30340;&#32467;&#26500;&#20307;char_device_struct&#20869;&#30340;*cdev&#25351;&#38024;&#19978;&#12290;
<pre class="programlisting">
int cdev_add(struct cdev *p, dev_t dev, unsigned count)
{
	p-&gt;dev = dev;
	p-&gt;count = count;
	return kobj_map(cdev_map, dev, count, NULL, exact_match, exact_lock, p);
}
</pre>
<div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">&#21442;&#25968;p&#21363;&#20026;&#38656;&#35201;&#21152;&#20837;&#20869;&#26680;&#30340;cdev&#32467;&#26500;&#20307;&#30340;&#25351;&#38024;&#12290;</li><li class="listitem">dev&#26159;&#31532;&#19968;&#20010;&#35774;&#22791;&#21495;&#12290;</li><li class="listitem">count&#26159;&#20851;&#32852;&#21040;&#27492;&#35774;&#22791;&#30340;&#35774;&#22791;&#21495;&#30340;&#25968;&#30446;(&#20063;&#21363;&#23376;&#35774;&#22791;&#21495;&#30340;&#20010;&#25968;)&#65292;&#36890;&#24120;&#20026;1&#65292;&#23545;&#20110;&#30913;&#30424;&#22359;&#35774;&#22791;&#65292;&#21487;&#33021;&#22823;&#20110;1&#12290;</li></ul></div>
cdev_add&#30340;&#26680;&#24515;&#25805;&#20316;&#22312;&#20110;kobj_map&#20989;&#25968;&#65292;&#23427;&#26159;Linux&#35774;&#22791;&#27169;&#22411;&#20013;&#30340;&#19968;&#31181;&#35774;&#22791;&#21495;&#26144;&#23556;&#21040;&#20869;&#26680;&#23545;&#35937;kobject&#30340;&#26426;&#21046;&#65292;&#20197;&#23454;&#29616;&#32479;&#19968;&#30340;&#35774;&#22791;&#31649;&#29702;&#27169;&#22411;&#12290;&#19968;&#20010;&#37325;&#35201;&#30340;&#32467;&#26500;&#20307;&#19982;&#35813;&#20989;&#25968;&#21516;&#21517;&#65306;
<pre class="programlisting">
drivers/base/map.c
struct kobj_map {
	struct probe {
		struct probe *next;
		dev_t dev;
		unsigned long range;
		struct module *owner;
		kobj_probe_t *get;
		int (*lock)(dev_t, void *);
		void *data;
	} *probes[255];
	struct mutex *lock;
};
</pre>
&#27880;&#24847;&#21040;struct probe&#32467;&#26500;&#20307;&#65292;&#23427;&#29992;&#26469;&#23454;&#29616;&#35774;&#22791;&#30340;&#25506;&#27979;&#65292;&#21253;&#21547;&#20102;&#35774;&#22791;&#39537;&#21160;&#21495;&#31561;&#20449;&#24687;&#65292;&#20197;&#21450;&#23545;&#24212;&#30340;&#25805;&#20316;&#20989;&#25968;&#30340;&#25351;&#38024;&#12290;probes&#26159;&#19968;&#20010;255&#20010;&#20803;&#32032;&#30340;&#25955;&#21015;&#34920;&#65292;&#25955;&#21015;&#31639;&#27861;&#19982;&#21704;&#24076;&#34920;chrdevs&#30456;&#21516;&#65292;&#22343;&#20026;&#20027;&#35774;&#22791;&#21495;&#23545;255&#21462;&#20313;&#12290;
<div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">next&#23558;&#25152;&#26377;&#25506;&#27979;&#35774;&#22791;&#29992;&#30340;probe&#32467;&#26500;&#20307;&#25955;&#21015;&#20803;&#32032;&#20018;&#32852;&#22312;&#19968;&#36215;&#12290;</li><li class="listitem">dev&#21644;range&#20998;&#21035;&#23545;&#24212;&#20102;&#35774;&#22791;&#21495;&#20197;&#21450;&#35774;&#22791;&#21495;&#30340;&#33539;&#22260;&#12290;</li><li class="listitem">owner&#25351;&#21521;&#25552;&#20379;&#35774;&#22791;&#39537;&#21160;&#31243;&#24207;&#30340;&#27169;&#22359;(&#22914;&#26524;&#26159;&#27169;&#22359;&#30340;&#35805;)&#12290;</li><li class="listitem">get&#20989;&#25968;&#25351;&#38024;&#29992;&#20110;&#36820;&#22238;&#19982;&#35774;&#22791;&#20851;&#32852;&#30340;kobject&#23454;&#20363;&#12290;</li><li class="listitem">lock&#20989;&#25968;&#25351;&#38024;&#29992;&#20110;&#25805;&#20316;kobject&#20013;&#35745;&#25968;&#22120;&#65292;&#20197;&#23454;&#29616;&#23545;&#35774;&#22791;&#24341;&#29992;&#30340;&#32479;&#19968;&#35745;&#25968;&#12290;</li><li class="listitem">data&#25351;&#21521;&#30495;&#27491;&#30340;&#35774;&#22791;&#39537;&#21160;&#65292;&#22914;&#26524;&#26159;&#23383;&#31526;&#35774;&#22791;&#65292;&#23601;&#20026;struct cdev&#30340;&#23454;&#20363;&#65292;&#23545;&#20110;&#22359;&#35774;&#22791;&#25351;&#21521;struct genhd&#30340;&#23454;&#20363;&#65292;&#23427;&#34987;&#32473;&#20256;&#36882;&#32473;get&#21644;lock&#20989;&#25968;&#12290;</li></ul></div>
&#32479;&#19968;&#35774;&#22791;&#27169;&#22411;&#20013;&#31649;&#29702;&#23383;&#31526;&#35774;&#22791;&#30340;&#32467;&#26500;&#20307;&#26159;&#19968;&#20010;struct kobj_map&#31867;&#22411;&#30340;&#25351;&#38024;&#65292;&#34987;&#22768;&#26126;&#22914;&#19979;(&#22359;&#35774;&#22791;&#20013;&#23545;&#24212;&#30340;&#21464;&#37327;&#20026;bdev_map)&#65306;
<pre class="programlisting">
fs/char_dev.c
static struct kobj_map *cdev_map;
</pre>
&#35813;&#25351;&#38024;&#22312;&#20989;&#25968;&#20013;chrdev_init&#30003;&#35831;&#31354;&#38388;&#65292;&#24182;&#34987;&#21021;&#22987;&#21270;&#12290;
<pre class="programlisting">
fs/char_dev.c
start_kernel-&gt;vfs_caches_init-&gt;chrdev_init

void __init chrdev_init(void)
{
	cdev_map = kobj_map_init(base_probe, &amp;chrdevs_lock);
	bdi_init(&amp;directly_mappable_cdev_bdi);
}
</pre>
kobj_map_init&#26159;&#19968;&#20010;&#30456;&#24403;&#31616;&#21333;&#30340;&#20989;&#25968;&#65292;&#23427;&#21516;&#26102;&#30003;&#35831;&#19968;&#20010;kobj_map&#23454;&#20363;&#21644;&#19968;&#20010;probe&#23454;&#20363;&#65292;&#24182;&#23545;probe&#20013;&#30340;&#35774;&#22791;&#21495;&#65292;&#35774;&#22791;&#21495;&#33539;&#22260;&#20197;&#21450;get&#20989;&#25968;&#36171;&#20540;&#12290;base_probe&#26159;&#19968;&#20010;&#40664;&#35748;&#30340;&#25506;&#27979;&#20989;&#25968;&#12290;&#21478;&#22806;&#21487;&#20197;&#30475;&#21040;probes&#30340;&#27599;&#20010;&#20803;&#32032;&#37117;&#25351;&#21521;&#20102;probe&#23454;&#20363;base&#65292;&#32780;&#38145;&#25351;&#21521;&#20102;&#20445;&#25252;&#21704;&#24076;&#34920;chrdevs&#30340;chrdevs_lock&#38145;&#65292;&#27492;&#26102;&#30475;&#36215;&#26469;&#22914;&#19979;&#22270;&#25152;&#31034;&#65306;
<div class="figure"><a name="idp81758116"></a><p class="title"><b>&#22270; 116. &#21021;&#22987;&#21270;kmap</b></p><div class="figure-contents"><div><img src="images/device/kmapinit.gif" alt="&#21021;&#22987;&#21270;kmap"></div></div></div><br class="figure-break">
<pre class="programlisting">
drivers/base/map.c
struct kobj_map *kobj_map_init(kobj_probe_t *base_probe, struct mutex *lock)
{
	struct kobj_map *p = kmalloc(sizeof(struct kobj_map), GFP_KERNEL);
	struct probe *base = kzalloc(sizeof(*base), GFP_KERNEL);
	int i;
  ......
	base-&gt;dev = 1;
	base-&gt;range = ~0;
	base-&gt;get = base_probe;
	for (i = 0; i &lt; 255; i++)
		p-&gt;probes[i] = base;
	p-&gt;lock = lock;
	return p;
}
</pre>
base_probe&#26681;&#25454;&#35774;&#22791;&#21495;&#22312;&#31995;&#32479;&#27169;&#22359;&#25152;&#22312;&#30340;&#40664;&#35748;&#25991;&#20214;&#22841;&#20013;&#26597;&#25214;&#21305;&#37197;&#30340;&#21517;&#20026;char-major-MAJOR(dev)-MANOR(dev).ko&#30340;&#27169;&#22359;&#25991;&#20214;&#65292;&#24182;&#21152;&#36733;&#12290;
<pre class="programlisting">
static struct kobject *base_probe(dev_t dev, int *part, void *data)
{
	if (request_module("char-major-%d-%d", MAJOR(dev), MINOR(dev)) &gt; 0)
		/* Make old-style 2.4 aliases work */
		request_module("char-major-%d", MAJOR(dev));
	return NULL;
}
</pre>
kobj_kmap&#20989;&#25968;&#30340;&#23454;&#29616;&#26377;&#20123;&#22797;&#26434;&#65292;&#23427;&#39318;&#20808;&#20250;&#21019;&#24314;&#19968;&#20010;probe&#23545;&#35937;&#65292;&#28982;&#21518;&#26681;&#25454;dev&#20013;&#23545;&#24212;&#30340;&#20027;&#35774;&#22791;&#21495;&#30456;&#23545;&#20110;255&#21306;&#22495;&#21518;&#25214;&#21040;&#25955;&#21015;&#20540;&#65292;&#23558;probe&#23545;&#35937;&#25554;&#20837;&#65292;&#24182;&#20851;&#32852;probe&#20013;&#30340;data&#25351;&#21521;cdev&#12290;&#23545;&#25554;&#20837;&#30340;&#25805;&#20316;&#26681;&#25454;range&#36827;&#34892;&#21319;&#24207;&#25490;&#21015;&#65292;&#22312;&#25805;&#20316;cdev_map&#26102;&#65292;&#20849;&#29992;&#20445;&#25252;chrdevs&#30340;&#38145;chrdevs_lock&#12290;
<pre class="programlisting">
int kobj_map(struct kobj_map *domain, dev_t dev, unsigned long range,
	     struct module *module, kobj_probe_t *probe,
	     int (*lock)(dev_t, void *), void *data)
{
	......
	p = kmalloc(sizeof(struct probe) * n, GFP_KERNEL);
	......
	for (i = 0; i &lt; n; i++, p++) {
		p-&gt;owner = module;
		p-&gt;get = probe;
		p-&gt;lock = lock;
		p-&gt;dev = dev;
		p-&gt;range = range;
		p-&gt;data = data;
	}
	mutex_lock(domain-&gt;lock);
	for (i = 0, p -= n; i &lt; n; i++, p++, index++) {
		struct probe **s = &amp;domain-&gt;probes[index % 255];
		while (*s &amp;&amp; (*s)-&gt;range &lt; range)
			s = &amp;(*s)-&gt;next;
		p-&gt;next = *s;
		*s = p;
	}
	mutex_unlock(domain-&gt;lock);
	return 0;
}
</pre>
&#25554;&#20837;&#20004;&#20010;&#20027;&#35774;&#22791;&#21495;&#20026;1&#30340;&#35774;&#22791;&#21518;&#21015;&#34920;&#22914;&#19979;&#22270;&#25152;&#31034;&#65306;
<div class="figure"><a name="idp81761620"></a><p class="title"><b>&#22270; 117. &#27880;&#20876;cdev&#35774;&#22791;</b></p><div class="figure-contents"><div><img src="images/device/kmap.gif" alt="&#27880;&#20876;cdev&#35774;&#22791;"></div></div></div><br class="figure-break">
&#22312;&#20351;&#29992;cdev_add&#26102;&#35201;&#27880;&#24847;&#23427;&#21487;&#33021;&#36820;&#22238;&#22833;&#36133;&#65292;&#22914;&#26524;&#24050;&#32463;&#36827;&#34892;&#36807;cdev_init&#65292;&#37027;&#20040;&#20173;&#28982;&#38656;&#35201;&#35843;&#29992;cdev_del&#28165;&#38500;&#24050;&#32463;&#21021;&#22987;&#21270;&#30340;&#36164;&#28304;&#65292;&#36825;&#36890;&#24120;&#26159;&#23545;cdev&#30340;&#37322;&#25918;&#21160;&#20316;&#12290;&#19968;&#20010;&#22855;&#24618;&#30340;&#20107;&#23454;&#26159;cdev_add&#19968;&#36820;&#22238;&#25104;&#21151;&#65292;&#37027;&#20040;&#35774;&#22791;&#23601;&#26159;"&#27963;&#30340;"&#65292;&#24182;&#19988;&#20869;&#26680;&#21487;&#20197;&#35843;&#29992;&#23427;&#30340;&#25805;&#20316;&#65292;&#25152;&#20197;&#39537;&#21160;&#24517;&#39035;&#23436;&#20840;&#20934;&#22791;&#22909;&#22788;&#29702;&#35774;&#22791;&#19978;&#30340;&#25805;&#20316;&#25165;&#21487;&#35843;&#29992;&#35813;&#20989;&#25968;&#27880;&#20876;&#35774;&#22791;&#12290;&#23545;&#20110;&#20026;&#20309;cdev_add&#25805;&#20316;&#21518;&#35774;&#22791;&#23601;&#26159;"&#27963;&#30340;"&#65292;&#23558;&#22312;&#19979;&#19968;&#33410;&#32487;&#32493;&#20998;&#26512;&#12290;
<p>
</p><div class="note" title="&#27880;&#24847;" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#27880;&#24847;</h3>cdev_map&#21644;chrdevs&#30340;&#21306;&#21035;&#22312;&#20110;&#65306;cdev_map&#20013;&#27880;&#20876;&#30495;&#27491;&#30340;&#35774;&#22791;&#39537;&#21160;&#65292;chrdevs&#38500;&#20102;&#29992;&#20110;&#32769;&#30340;&#26041;&#24335;&#30340;&#35774;&#22791;&#27880;&#20876;&#22806;&#65292;&#21482;&#29992;&#20110;&#31649;&#29702;&#35774;&#22791;&#21495;&#30340;&#20998;&#37197;&#21644;&#22238;&#25910;&#12290;&#21478;&#22806;&#22312;&#36890;&#36807;cdev_add&#27880;&#20876;cdev&#26102;&#65292;&#24182;&#19981;&#26816;&#26597;&#35774;&#22791;&#21495;&#26159;&#21542;&#24050;&#32463;&#30003;&#35831;&#65292;&#25152;&#20197;&#32534;&#30721;&#32773;&#24517;&#39035;&#28165;&#26970;&#36825;&#19968;&#28857;&#65281;</div><p>
</p>
</div>
<div class="sect3" title="21.2.3. &#27880;&#38144;cdev"><div class="titlepage"><div><div><h4 class="title"><a name="idp81751292"></a>21.2.3. &#27880;&#38144;cdev</h4></div></div></div>
&#27880;&#38144;cdev&#30340;&#20989;&#25968;&#20026;cdev_del&#65292;&#20854;&#20013;&#35843;&#29992;cdev_unmap&#38388;&#25509;&#35843;&#29992;kobj_unmap&#65292;&#23427;&#26159;kobj_map&#30340;&#21453;&#25805;&#20316;&#12290;kobject_put&#21017;&#35843;&#29992;&#27880;&#20876;&#26102;&#32473;&#23450;&#30340;release&#20989;&#25968;&#26469;&#37322;&#25918;cdev&#23454;&#20363;&#65292;&#36825;&#19968;&#28857;&#22312;&#36890;&#36807;&#21160;&#24577;&#20998;&#37197;cdev&#26102;&#65292;&#30456;&#24403;&#37325;&#35201;&#12290;
<pre class="programlisting">
void cdev_del(struct cdev *p)
{
	cdev_unmap(p-&gt;dev, p-&gt;count);
	kobject_put(&amp;p-&gt;kobj);
}
</pre>
<div class="note" title="&#27880;&#24847;" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#27880;&#24847;</h3>&#22914;&#26524;&#22312;&#35843;&#29992;cdev_add&#27880;&#20876;&#22833;&#36133;&#26102;&#65292;&#20381;&#28982;&#35201;&#35843;&#29992;cdev_del&#26469;&#27880;&#38144;&#24050;&#32463;&#30003;&#35831;&#30340;&#36164;&#28304;&#12290;</div>
</div>
</div>
<div class="sect2" title="21.3. &#20851;&#32852;&#25991;&#20214;&#31995;&#32479;"><div class="titlepage"><div><div><h3 class="title"><a name="idp81764860"></a>21.3. &#20851;&#32852;&#25991;&#20214;&#31995;&#32479;</h3></div></div></div>
&#38500;&#20102;&#26497;&#23569;&#25968;&#20363;&#22806;&#65292;&#35774;&#22791;&#25991;&#20214;&#22343;&#26159;&#30001;&#34394;&#25311;&#25991;&#20214;&#31995;&#32479;&#30340;&#26631;&#20934;&#20989;&#25968;&#22788;&#29702;&#65292;&#36825;&#30475;&#36215;&#26469;&#24456;&#20687;&#22788;&#29702;&#26222;&#36890;&#25991;&#20214;&#12290;&#22312;&#27492;&#38656;&#35201;&#29087;&#24713;&#19968;&#20123;&#34394;&#25311;&#25991;&#20214;&#31995;&#32479;&#20013;&#37325;&#35201;&#30340;&#25968;&#25454;&#32467;&#26500;&#12290;
<div class="sect3" title="21.3.1. inode&#20869;&#30340;&#35774;&#22791;&#25991;&#20214;&#25104;&#21592;"><div class="titlepage"><div><div><h4 class="title"><a name="idp81765324"></a>21.3.1. inode&#20869;&#30340;&#35774;&#22791;&#25991;&#20214;&#25104;&#21592;</h4></div></div></div>
&#34394;&#25311;&#25991;&#20214;&#31995;&#32479;&#20013;&#30340;&#27599;&#20010;&#25991;&#20214;&#37117;&#20851;&#32852;&#21040;&#19968;&#20010;inode&#65292;&#29992;&#20110;&#31649;&#29702;&#25991;&#20214;&#30340;&#23646;&#24615;&#12290;&#23427;&#21253;&#21547;&#26377;&#32321;&#26434;&#30340;&#25968;&#25454;&#25104;&#21592;&#65292;&#36825;&#37324;&#20165;&#21015;&#20986;&#19982;&#35774;&#22791;&#39537;&#21160;&#31243;&#24207;&#30456;&#20851;&#30340;&#25104;&#21592;&#65306;
<pre class="programlisting">
linux/fs.h
struct inode
{
	umode_t			i_mode;
......
	dev_t			i_rdev;
......
	const struct file_operations	*i_fop;	/* former -&gt;i_op-&gt;default_file_ops */
......
	struct list_head	i_devices;
	union {
......
		struct block_device	*i_bdev;
		struct cdev		*i_cdev;
	};	
}
</pre>
<div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">i_mode&#19982;&#26222;&#36890;&#25991;&#20214;&#19968;&#26679;&#65292;&#35760;&#24405;&#20102;&#35774;&#22791;&#25991;&#20214;&#30340;&#35835;&#20889;&#31561;&#26435;&#38480;&#12290;</li><li class="listitem">dev_t&#31867;&#22411;&#30340;&#35774;&#22791;&#21495;&#21807;&#19968;&#26631;&#35782;&#20102;&#19968;&#20010;&#35774;&#22791;&#25991;&#20214;&#65292;&#19968;&#20010;&#26631;&#35782;&#35774;&#22791;&#25991;&#20214;&#30340;inode&#65292;&#20854;i_rdev&#25104;&#21592;&#35760;&#24405;&#20102;&#20027;&#20174;&#35774;&#22791;&#21495;&#12290;</li><li class="listitem">i_fop&#26159;&#19968;&#32452;&#20989;&#25968;&#25351;&#38024;&#30340;&#38598;&#21512;&#65292;&#23427;&#26159;&#35774;&#22791;&#39537;&#21160;&#30340;&#26680;&#24515;&#12290;</li><li class="listitem">&#22810;&#20010;&#35774;&#22791;&#21487;&#20197;&#20849;&#29992;&#21516;&#19968;&#20010;&#39537;&#21160;&#31243;&#24207;&#65292;&#36890;&#36807;&#23383;&#31526;&#35774;&#22791;&#30340;inode&#20013;&#30340;i_devices &#21644; cdev&#20013;&#30340;list&#32452;&#25104;&#19968;&#20010;&#38142;&#34920;&#12290;</li><li class="listitem">i_bdev&#21644;i_cdev&#29992;&#26469;&#25191;&#34892;&#26356;&#22810;&#30340;&#35774;&#22791;&#25991;&#20214;&#29305;&#26377;&#30340;&#20449;&#24687;&#37096;&#20998;&#65292;&#36890;&#24120;&#20026;struct genhd&#25110;&#32773;struct cdev&#23545;&#35937;&#23454;&#20363;&#12290;</li></ul></div>
&#20026;&#20102;&#31243;&#24207;&#30340;&#21487;&#31227;&#26893;&#24615;, &#20869;&#26680;&#25552;&#20379;&#20102;&#20004;&#20010;&#23439;, &#29992;&#26469;&#20174;&#19968;&#20010;inode&#20013;&#33719;&#21462;&#20027;&#27425;&#32534;&#21495;&#65306;
<pre class="programlisting">
unsigned int iminor(struct inode *inode);
unsigned int imajor(struct inode *inode);
</pre>
&#19968;&#20010;&#30097;&#38382;&#26159;&#21512;&#36866;&#21019;&#24314;&#21487;&#20197;&#35843;&#29992;&#35774;&#22791;&#39537;&#21160;&#30340;inode&#32467;&#26500;&#65311;&#23427;&#26159;&#36890;&#36807;mknod&#21629;&#20196;&#29983;&#25104;&#22312;&#30913;&#30424;(&#20063;&#21487;&#33021;&#22312;RAMFS&#20013;)&#19978;&#30340;&#35774;&#22791;&#25991;&#20214;&#23545;&#24212;&#30340;inode&#21527;&#65311;&#22312;&#35774;&#22791;&#25991;&#20214;&#25171;&#24320;&#26102;&#21644;&#21019;&#24314;&#35774;&#22791;&#25991;&#20214;&#26102;&#37117;&#21019;&#24314;&#20102;inode,&#20294;&#36825;&#20004;&#20010;inode&#19981;&#26159;&#21516;&#19968;&#20010;&#65292;&#26159;&#20004;&#20010;&#19981;&#21516;&#31867;&#22411;&#30340;&#25968;&#25454;&#12290;&#35774;&#22791;&#25991;&#20214;&#21019;&#24314;&#30340;&#26102;&#20505;&#29983;&#25104;&#30340;inode&#26159;&#20445;&#23384;&#22312;&#30828;&#30424;&#20013;&#30340;&#65292;&#23427;&#30340;&#32467;&#26500;&#27604;&#36739;&#31616;&#21333;&#65292;&#38543;&#35774;&#22791;&#25991;&#20214;&#30340;&#21024;&#38500;&#20250;&#28040;&#22833;&#30340;&#12290;&#32780;&#35774;&#22791;&#25991;&#20214;&#25171;&#24320;&#30340;&#26102;&#20505;&#21019;&#24314;&#30340;inode&#26159;struct inode&#32467;&#26500;&#20307;&#65292;&#23427;&#26159;&#20445;&#23384;&#22312;&#20869;&#23384;&#20013;&#30340;&#65292;&#38543;&#30528;&#25991;&#20214;&#30340;&#20851;&#38381;&#20250;&#28040;&#22833;&#12290;&#20998;&#28165;&#20102;&#36825;&#20004;&#31867;inode&#23601;&#30475;&#30475;&#20309;&#26102;&#21019;&#24314;&#20869;&#23384;&#20013;&#30340;inode&#21543;&#12290;
<p>
&#34394;&#25311;&#25991;&#20214;&#31995;&#32479;&#32479;&#19968;&#20102;&#25991;&#20214;&#30340;&#25171;&#24320;&#20989;&#25968;&#65292;&#36825;&#23601;&#26159;open&#12290;&#20174;open&#21040;&#21019;&#24314;inode&#65292;&#32463;&#21382;&#20102;&#19968;&#20010;&#30456;&#23545;&#22797;&#26434;&#30340;&#36807;&#31243;&#65292;&#26597;&#30475;&#20989;&#25968;&#35843;&#29992;&#30340;&#36807;&#31243;&#30340;&#31616;&#20415;&#26041;&#27861;&#26159;&#22312;&#26368;&#32456;&#30340;&#20989;&#25968;&#29992;&#21152;&#20837;dump_stack&#20989;&#25968;&#65292;&#21478;&#22806;&#28155;&#21152;linux/printk.h&#22836;&#25991;&#20214;&#12290;
</p><div class="note" title="&#27880;&#24847;" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#27880;&#24847;</h3>&#30701;&#23567;&#30340;&#38745;&#24577;&#20989;&#25968;&#20250;&#23384;&#20648;&#22312;&#20840;&#23616;&#25968;&#25454;&#21306;&#65292;&#31867;&#20284;&#27719;&#32534;&#35821;&#35328;&#20013;&#30340;.data&#27573;&#65292;&#25152;&#20197;&#22312;&#26632;&#20013;&#23427;&#20204;&#21487;&#33021;&#24182;&#19981;&#20986;&#29616;&#65292;&#36825;&#22312;&#20351;&#29992;&#35813;&#26041;&#27861;&#26102;&#24212;&#35813;&#27880;&#24847;&#12290;</div><p>
</p><pre class="programlisting">
sys_open-&gt;do_sys_open-&gt;do_filp_open-&gt;path_openat-&gt;do_last-&gt;nameidata_to_filp-&gt;__dentry_open

[&lt;c002e788&gt;] (unwind_backtrace+0x0/0xf8) from [&lt;bf01c00c&gt;] (vcdev_open+0xc/0x18 [vcdev])
[&lt;bf01c00c&gt;] (vcdev_open+0xc/0x18 [vcdev]) from [&lt;c00b79dc&gt;] (chrdev_open+0x9c/0x160)
[&lt;c00b79dc&gt;] (chrdev_open+0x9c/0x160) from [&lt;c00b2e94&gt;] (__dentry_open+0xd4/0x268)
[&lt;c00b2e94&gt;] (__dentry_open+0xd4/0x268) from [&lt;c00b3c8c&gt;] (nameidata_to_filp+0x5c/0x64)
[&lt;c00b3c8c&gt;] (nameidata_to_filp+0x5c/0x64) from [&lt;c00be974&gt;] (do_last+0xc0/0x6bc)
[&lt;c00be974&gt;] (do_last+0xc0/0x6bc) from [&lt;c00bfc80&gt;] (path_openat+0xb8/0x38c)
[&lt;c00bfc80&gt;] (path_openat+0xb8/0x38c) from [&lt;c00c003c&gt;] (do_filp_open+0x30/0x84)
[&lt;c00c003c&gt;] (do_filp_open+0x30/0x84) from [&lt;c00b2cf8&gt;] (do_sys_open+0xe8/0x184)
[&lt;c00b2cf8&gt;] (do_sys_open+0xe8/0x184) from [&lt;c0029a80&gt;] (ret_fast_syscall+0x0/0x30)
</pre><p>
&#26080;&#35770;&#22914;&#20309;open&#20989;&#25968;&#37117;&#35201;&#21435;&#25171;&#24320;&#19968;&#20010;&#25991;&#20214;&#65292;&#32780;&#25991;&#20214;&#30340;&#36335;&#24452;&#33258;&#28982;&#22312;&#21442;&#25968;&#20013;&#25351;&#23450;&#65292;&#32463;&#36807;&#19968;&#20123;&#21015;&#30340;&#35843;&#29992;&#21518;&#65292;&#23558;&#20250;&#25214;&#30340;/dev/xxx&#35774;&#22791;&#25991;&#20214;&#23545;&#24212;&#30340;struct inode&#65292;&#27880;&#24847;&#21040;__dentry_open&#20989;&#25968;&#20013;&#30340;fops_get&#25805;&#20316;&#65292;&#23427;&#33719;&#21462;&#35774;&#22791;&#25991;&#20214;&#23545;&#24212;&#30340;inode&#65292;&#26174;&#28982;&#35813;inode&#30001;mknod&#21019;&#24314;&#35813;&#25991;&#20214;&#26102;&#25351;&#23450;&#12290;
</p><pre class="programlisting">
fs/open.c
static struct file *__dentry_open(struct dentry *dentry, struct vfsmount *mnt,
					struct file *f,
					int (*open)(struct inode *, struct file *),
					const struct cred *cred)
{
......
	f-&gt;f_op = fops_get(inode-&gt;i_fop);

	error = security_dentry_open(f, cred);
	if (error)
		goto cleanup_all;

	if (!open &amp;&amp; f-&gt;f_op)
		open = f-&gt;f_op-&gt;open;
	if (open) {
		error = open(inode, f);
		if (error)
			goto cleanup_all;
	}
......	
}
</pre><p>
&#36825;&#37324;&#20197;&#20551;&#35774;/dev&#20351;&#29992;RAMFS&#25991;&#20214;&#31995;&#32479;&#20026;&#20363;&#65292;ramfs_mknod&#20013;&#35843;&#29992;&#20102;ramfs_get_inode&#65292;ramfs_get_inode&#20013;&#21017;&#36890;&#36807;init_special_inode&#20989;&#25968;&#25351;&#23450;&#20102;&#35774;&#22791;&#25991;&#20214;&#23545;&#24212;&#30340;inode&#21019;&#24314;&#20989;&#25968;&#30340;&#25351;&#38024;&#12290;
</p><pre class="programlisting">
fs/ramfs/inode.c
static int ramfs_mknod(struct inode *dir, struct dentry *dentry, int mode, dev_t dev)
{
        struct inode * inode = ramfs_get_inode(dir-&gt;i_sb, dir, mode, dev);
......
}

struct inode *ramfs_get_inode(struct super_block *sb,
                                const struct inode *dir, int mode, dev_t dev)
{
        struct inode * inode = new_inode(sb);

        if (inode) {
......
                switch (mode &amp; S_IFMT) {
                default:
                        init_special_inode(inode, mode, dev);
                        break;
......
</pre><p>
&#27880;&#24847;&#21040;new_inode&#20989;&#25968;&#65292;&#23427;&#20998;&#37197;&#20102;inode&#33410;&#28857;&#12290;init_special_inode&#26159;&#19968;&#20010;&#20998;&#25903;&#20989;&#25968;&#65292;&#26681;&#25454;&#19981;&#21516;&#30340;&#25991;&#20214;&#31867;&#22411;&#65292;&#25346;&#25509;&#19981;&#21516;&#30340;&#25991;&#20214;&#22788;&#29702;&#20989;&#25968;def_chr_fops&#12290;
</p><pre class="programlisting">
fs/inode.c
void init_special_inode(struct inode *inode, umode_t mode, dev_t rdev)
{
	inode-&gt;i_mode = mode;
	if (S_ISCHR(mode)) {
		inode-&gt;i_fop = &amp;def_chr_fops;
		inode-&gt;i_rdev = rdev;
	} else if (S_ISBLK(mode)) {
		inode-&gt;i_fop = &amp;def_blk_fops;
		inode-&gt;i_rdev = rdev;
	}
	......
}
</pre><p>
&#32487;&#32493;&#22238;&#21040;__dentry_open&#65292;&#23427;&#22312;&#33719;&#21462;&#21040;&#25991;&#20214;&#30340;open&#20989;&#25968;&#25351;&#38024;&#21518;&#65292;&#23545;&#23427;&#30340;&#35843;&#29992;&#23558;&#24341;&#21457;chrdev_open&#30340;&#25191;&#34892;&#12290;
</p><pre class="programlisting">
fs/char_dev.c
const struct file_operations def_chr_fops = {
	.open = chrdev_open,
	.llseek = noop_llseek,
};
</pre><p>
</p>
</div>
<div class="sect3" title="21.3.2. &#21019;&#24314;&#35774;&#22791;&#25991;&#20214;&#30340;inode"><div class="titlepage"><div><div><h4 class="title"><a name="idp81774332"></a>21.3.2. &#21019;&#24314;&#35774;&#22791;&#25991;&#20214;&#30340;inode</h4></div></div></div>
chrdev_open&#26159;&#21019;&#24314;&#23383;&#31526;&#35774;&#22791;inode&#30340;&#26680;&#24515;&#20989;&#25968;&#65292;&#19982;&#27492;&#23545;&#24212;&#30340;&#22359;&#35774;&#22791;&#20989;&#25968;&#26159;def_blk_fops&#12290;
<pre class="programlisting">
static int chrdev_open(struct inode *inode, struct file *filp)
{
	struct cdev *p;
	struct cdev *new = NULL;
	int ret = 0;

	spin_lock(&amp;cdev_lock);
	p = inode-&gt;i_cdev;
	if (!p) {
		struct kobject *kobj;
		int idx;
		spin_unlock(&amp;cdev_lock);
		kobj = kobj_lookup(cdev_map, inode-&gt;i_rdev, &amp;idx);
		if (!kobj)
			return -ENXIO;
		new = container_of(kobj, struct cdev, kobj);
		spin_lock(&amp;cdev_lock);
		/* Check i_cdev again in case somebody beat us to it while
		   we dropped the lock. */
		p = inode-&gt;i_cdev;
		if (!p) {
			inode-&gt;i_cdev = p = new;
			list_add(&amp;inode-&gt;i_devices, &amp;p-&gt;list);
			new = NULL;
		} else if (!cdev_get(p))
			ret = -ENXIO;
	} else if (!cdev_get(p))
		ret = -ENXIO;
	spin_unlock(&amp;cdev_lock);
	cdev_put(new);
	if (ret)
		return ret;

	ret = -ENXIO;
	filp-&gt;f_op = fops_get(p-&gt;ops);
	if (!filp-&gt;f_op)
		goto out_cdev_put;

	if (filp-&gt;f_op-&gt;open) {
		ret = filp-&gt;f_op-&gt;open(inode,filp);
		if (ret)
			goto out_cdev_put;
	}

	return 0;

 out_cdev_put:
	cdev_put(p);
	return ret;
}
</pre>
<div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">&#38024;&#23545;&#35774;&#22791;&#25991;&#20214;&#30340;&#25805;&#20316;&#65292;&#38656;&#35201;cdev_lock&#30340;&#20445;&#25252;&#12290;</li><li class="listitem">&#22914;&#26524;&#31995;&#32479;&#20013;&#27809;&#26377;&#20219;&#20309;&#19968;&#20010;&#36827;&#31243;&#25171;&#24320;&#20102;&#24403;&#21069;&#35774;&#22791;&#25991;&#20214;&#65292;&#37027;&#20040;inode&#20013;&#30340;i_cdev&#23558;&#20026;&#31354;&#12290;</li><li class="listitem">&#22914;&#26524;&#20026;&#31354;&#65292;&#21017;&#26681;&#25454;i_rdev&#35774;&#22791;&#21495;&#36890;&#36807;kobj_lookup&#26597;&#25214;&#35774;&#22791;&#39537;&#21160;&#20013;&#30340;kobj&#25351;&#38024;&#12290;</li><li class="listitem">&#26681;&#25454;kobj&#25351;&#38024;&#36890;&#36807;container_of&#23439;&#33719;&#21462;cdev&#30340;&#25351;&#38024;&#65292;&#24182;&#36171;&#20540;&#32473;inode&#20013;&#30340;i_cdev&#25104;&#21592;&#12290;&#19982;&#27492;&#21516;&#26102;&#23558;i_devices&#25918;&#20837;cdev&#30340;&#38142;&#34920;&#12290;</li><li class="listitem">&#37322;&#25918;cdev_lock&#65292;&#25509;&#30528;&#30340;fops_get&#23558;&#33719;&#21462;&#25105;&#20204;&#36890;&#36807;cdev_init&#25110;&#32773;&#25163;&#21160;&#27880;&#20876;&#30340;file_operations&#32467;&#26500;&#20307;&#12290;</li><li class="listitem">&#32039;&#25509;&#30528;&#65292;&#22914;&#26524;&#19981;&#20026;&#31354;&#65292;&#21017;&#25191;&#34892;&#20854;&#20013;&#30340;open&#25805;&#20316;&#12290;</li></ul></div>
&#21487;&#20197;&#27880;&#24847;&#21040;&#65292;&#19968;&#26086;&#24314;&#31435;&#20102;&#19968;&#20010;inode&#65292;&#22914;&#26524;&#27809;&#26377;&#20851;&#38381;&#65292;&#24403;&#20854;&#20182;&#36827;&#31243;&#36890;&#36807;open&#25171;&#24320;&#26102;&#23558;&#30452;&#25509;inode&#20013;&#30340;&#25805;&#20316;&#36171;&#20540;&#32473;filp&#20013;&#30340;f_op&#65292;&#20851;&#20110;struct file&#32467;&#26500;&#20307;&#23558;&#22312;&#19979;&#19968;&#33410;&#23637;&#24320;&#12290;
</div>
<div class="sect3" title="21.3.3. &#25991;&#20214;&#32467;&#26500;"><div class="titlepage"><div><div><h4 class="title"><a name="idp81779436"></a>21.3.3. &#25991;&#20214;&#32467;&#26500;</h4></div></div></div>
struct file&#26159;&#35774;&#22791;&#39537;&#21160;&#20013;&#20989;&#25968;&#25805;&#20316;&#30340;&#31532;&#20108;&#20010;&#26368;&#37325;&#35201;&#30340;&#25968;&#25454;&#32467;&#26500;&#65292;&#27880;&#24847;file&#19982;&#29992;&#25143;&#31354;&#38388;&#31243;&#24207;&#30340;FILE &#25351;&#38024;&#27809;&#26377;&#20219;&#20309;&#20851;&#31995;. &#19968;&#20010; FILE &#23450;&#20041;&#22312; C &#24211;&#20013;, &#20174;&#19981;&#20986;&#29616;&#22312;&#20869;&#26680;&#20195;&#30721;&#20013;. &#19968;&#20010; struct file, &#21478;&#19968;&#26041;&#38754;, &#26159;&#19968;&#20010;&#20869;&#26680;&#32467;&#26500;, &#20174;&#19981;&#20986;&#29616;&#22312;&#29992;&#25143;&#31243;&#24207;&#20013;&#12290;&#25991;&#20214;&#32467;&#26500;&#20195;&#34920;&#19968;&#20010;&#25171;&#24320;&#30340;&#25991;&#20214;&#12290;(&#23427;&#19981;&#29305;&#23450;&#32473;&#35774;&#22791;&#39537;&#21160;; &#31995;&#32479;&#20013;&#27599;&#20010;&#25171;&#24320;&#30340;&#25991;&#20214;&#26377;&#19968;&#20010;&#20851;&#32852;&#30340; struct
file &#22312;&#20869;&#26680;&#31354;&#38388;)&#12290;&#23427;&#30001;&#20869;&#26680;&#22312;open&#26102;&#21019;&#24314;, &#24182;&#20256;&#36882;&#32473;&#22312;&#25991;&#20214;&#19978;&#25805;&#20316;&#30340;&#20219;&#20309;&#20989;&#25968;, &#30452;&#21040;&#26368;&#21518;&#30340;close&#20851;&#38381;&#12290;&#22312;&#20869;&#26680;&#28304;&#30721;&#20013;, struct file &#30340;&#25351;&#38024;&#24120;&#24120;&#31216;&#20026; file &#25110;&#32773; filp("file pointer")&#12290;&#36825;&#37324;&#20171;&#32461;&#19982;&#35774;&#22791;&#25991;&#20214;&#25805;&#20316;&#30456;&#20851;&#30340;&#25104;&#21592;&#65306;
<div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">mode_t f_mode;
&#25991;&#20214;&#27169;&#24335;&#30830;&#23450;&#25991;&#20214;&#26159;&#21487;&#35835;&#30340;&#25110;&#32773;&#26159;&#21487;&#20889;&#30340;(&#25110;&#32773;&#37117;&#26159;), &#36890;&#36807;&#20301; FMODE_READ &#21644;FMODE_WRITE. &#20320;&#21487;&#33021;&#24819;&#22312;&#20320;&#30340; open &#25110;&#32773; ioctl &#20989;&#25968;&#20013;&#26816;&#26597;&#36825;&#20010;&#25104;&#21592;&#30340;&#35835;&#20889;&#35768;&#21487;, &#20294;&#26159;&#20320;&#19981;&#38656;&#35201;&#26816;&#26597;&#35835;&#20889;&#35768;&#21487;, &#22240;&#20026;&#20869;&#26680;&#22312;&#35843;&#29992;&#20320;&#30340;&#26041;&#27861;&#20043;&#21069;&#26816;&#26597;. &#24403;&#25991;&#20214;&#36824;&#27809;&#26377;&#20026;&#37027;&#31181;&#23384;&#21462;&#32780;&#25171;&#24320;&#26102;&#35835;&#25110;&#20889;&#30340;&#20225;&#22270;&#34987;&#25298;&#32477;, &#39537;&#21160;&#29978;&#33267;&#19981;&#30693;&#36947;&#36825;&#20010;&#24773;&#20917;.</li><li class="listitem">loff_t f_pos; &#24403;&#21069;&#35835;&#20889;&#20301;&#32622;. loff_t &#22312;&#25152;&#26377;&#24179;&#21488;&#37117;&#26159; 64 &#20301;( &#22312; gcc &#26415;&#35821;&#37324;&#26159; long long ). &#39537;&#21160;&#21487;&#20197;&#35835;&#36825;&#20010;&#20540;,&#22914;&#26524;&#23427;&#38656;&#35201;&#30693;&#36947;&#25991;&#20214;&#20013;&#30340;&#24403;&#21069;&#20301;&#32622;, &#20294;&#26159;&#27491;&#24120;&#22320;&#19981;&#24212;&#35813;&#25913;&#21464;&#23427;; &#35835;&#21644;&#20889;&#24212;&#24403;&#20351;&#29992;&#23427;&#20204;&#20316;&#20026;&#26368;&#21518;&#21442;&#25968;&#32780;&#25910;&#21040;&#30340;&#25351;&#38024;&#26469;&#26356;&#26032;&#19968;&#20010;&#20301;&#32622;, &#20195;&#26367;&#30452;&#25509;&#20316;&#29992;&#20110; filp-&gt;f_pos. &#36825;&#20010;&#35268;&#21017;&#30340;&#19968;&#20010;&#20363;&#22806;&#26159;&#22312; llseek &#26041;&#27861;&#20013;, &#23427;&#30340;&#30446;&#30340;&#23601;&#26159;&#25913;&#21464;&#25991;&#20214;&#20301;&#32622;.</li><li class="listitem">unsigned int f_flags; &#36825;&#20123;&#26159;&#25991;&#20214;&#26631;&#24535;, &#20363;&#22914; O_RDONLY, O_NONBLOCK, &#21644; O_SYNC. &#39537;&#21160;&#24212;&#24403;&#26816;&#26597;O_NONBLOCK &#26631;&#24535;&#26469;&#30475;&#26159;&#21542;&#26159;&#35831;&#27714;&#38750;&#38459;&#22622;&#25805;&#20316;( &#25105;&#20204;&#22312;&#31532;&#19968;&#31456;&#30340;"&#38459;&#22622;&#21644;&#38750;&#38459;&#22622;&#25805;&#20316;"&#19968;&#33410;&#20013;&#35752;&#35770;&#38750;&#38459;&#22622; I/O ); &#20854;&#20182;&#26631;&#24535;&#24456;&#23569;&#20351;&#29992;. &#29305;&#21035;&#22320;, &#24212;&#24403;&#26816;&#26597;&#35835;/&#20889;&#35768;&#21487;, &#20351;&#29992; f_mode &#32780;&#19981;&#26159;f_flags. &#25152;&#26377;&#30340;&#26631;&#24535;&#22312;&#22836;&#25991;&#20214;linux/fcntl.h&#20013;&#23450;&#20041;.</li><li class="listitem">struct file_operations *f_op; &#21644;&#25991;&#20214;&#20851;&#32852;&#30340;&#25805;&#20316;. &#20869;&#26680;&#23433;&#25490;&#25351;&#38024;&#20316;&#20026;&#23427;&#30340; open &#23454;&#29616;&#30340;&#19968;&#37096;&#20998;, &#25509;&#30528;&#35835;&#21462;&#23427;&#24403;&#23427;&#38656;&#35201;&#20998;&#27966;&#20219;
&#20309;&#30340;&#25805;&#20316;&#26102;. filp-&gt;f_op &#20013;&#30340;&#20540;&#20174;&#19981;&#30001;&#20869;&#26680;&#20445;&#23384;&#20026;&#21518;&#38754;&#30340;&#24341;&#29992;; &#36825;&#24847;&#21619;&#30528;&#20320;&#21487;&#25913;&#21464;&#20320;&#30340;&#25991;&#20214;&#20851;&#32852;&#30340;&#25991;&#20214;&#25805;&#20316;, &#22312;&#20320;&#36820;&#22238;&#35843;&#29992;&#32773;&#20043;&#21518;&#26032;&#26041;&#27861;&#20250;&#36215;&#20316;&#29992;. &#20363;&#22914;, &#20851;&#32852;&#21040;&#20027;&#32534;&#21495; 1 (/dev/null, /dev/zero, &#31561;&#31561;)&#30340; open &#20195;&#30721;&#26681;&#25454;&#25171;&#24320;&#30340;&#27425;&#32534;&#21495;&#26469;&#26367;&#20195; filp-&gt;f_op &#20013;&#30340;&#25805;&#20316;. &#36825;&#20010;&#20570;&#27861;&#20801;&#35768;&#23454;&#29616;&#20960;&#31181;&#34892;&#20026;, &#22312;&#21516;&#19968;&#20010;&#20027;&#32534;&#21495;&#19979;&#32780;&#19981;&#24517;&#22312;&#27599;&#20010;&#31995;&#32479;&#35843;&#29992;&#20013;&#24341;&#20837;&#24320;&#38144;. &#26367;&#25442;&#25991;&#20214;&#25805;&#20316;&#30340;&#33021;&#21147;&#26159;&#38754;&#21521;&#23545;&#35937;&#32534;&#31243;&#30340;"&#26041;&#27861;&#37325;&#36733;"&#30340;&#20869;&#26680;&#23545;&#31561;&#20307;.</li><li class="listitem">void *private_data; open &#31995;&#32479;&#35843;&#29992;&#35774;&#32622;&#36825;&#20010;&#25351;&#38024;&#20026; NULL, &#22312;&#20026;&#39537;&#21160;&#35843;&#29992; open &#26041;&#27861;&#20043;&#21069;. &#20320;&#21487;&#33258;&#30001;&#20351;&#29992;&#36825;&#20010;&#25104;&#21592;&#25110;&#32773;&#24573;&#30053;&#23427;; &#20320;&#21487;&#20197;&#20351;&#29992;&#36825;&#20010;&#25104;&#21592;&#26469;&#25351;&#21521;&#20998;&#37197;&#30340;&#25968;&#25454;, &#20294;&#26159;&#25509;&#30528;&#20320;&#24517;&#39035;&#35760;&#20303;&#22312;&#20869;&#26680;&#38144;&#27585;&#25991;&#20214;&#32467;&#26500;&#20043;&#21069;, &#22312; release &#26041;&#27861;&#20013;&#37322;&#25918;&#37027;&#20010;&#20869;&#23384;. private_data &#26159;&#19968;&#20010;&#26377;&#29992;&#30340;&#36164;&#28304;, &#22312;&#31995;&#32479;&#35843;&#29992;&#38388;&#20445;&#30041;&#29366;&#24577;&#20449;&#24687;.</li><li class="listitem">struct dentry *f_dentry; &#20851;&#32852;&#21040;&#25991;&#20214;&#30340;&#30446;&#24405;&#20837;&#21475;( dentry )&#32467;&#26500;. &#35774;&#22791;&#39537;&#21160;&#32534;&#20889;&#32773;&#27491;&#24120;&#22320;&#19981;&#38656;&#35201;&#20851;&#24515; dentry &#32467;&#26500;, &#38500;&#20102;&#20316;&#20026; filp-&gt;f_dentry-&gt;d_inode &#23384;&#21462; inode &#32467;&#26500;.</li></ul></div>
&#22238;&#39038;open&#31995;&#32479;&#35843;&#29992;&#30340;&#36807;&#31243;&#65292;file&#32467;&#26500;&#20307;&#22312;path_openat&#30003;&#35831;&#65292;&#20854;&#20013;&#30340;get_empty_filp&#20989;&#25968;&#36890;&#36807;kmemcache&#26426;&#21046;&#30003;&#35831;&#21487;&#29992;&#30340;file&#32467;&#26500;&#20307;&#12290;
<pre class="programlisting">
fs/namei.c
static struct file *path_openat(int dfd, const char *pathname,
		struct nameidata *nd, const struct open_flags *op, int flags)
{
	struct file *base = NULL;
	struct file *filp;
	struct path path;
	int error;

	filp = get_empty_filp();
	if (!filp)
		return ERR_PTR(-ENFILE);
......		
</pre>
path_openat&#30340;&#21518;&#21322;&#37096;&#20998;&#22343;&#26159;&#22312;&#23545;filp&#25351;&#21521;&#30340;file&#32467;&#26500;&#20307;&#36827;&#34892;&#21021;&#22987;&#21270;&#12290;&#30452;&#33267;&#22312;chrdev_open&#22788;&#29702;&#20013;&#20854;f_op&#25104;&#21592;&#34987;&#36171;&#20540;&#20026;&#25105;&#20204;&#23450;&#20041;&#30340;&#23383;&#31526;&#35774;&#22791;&#23545;&#24212;&#30340;&#25805;&#20316;&#38598;&#12290;
</div>
<div class="figure"><a name="idp81785420"></a><p class="title"><b>&#22270; 118. inode&#65292;file&#21644;cdev&#38388;&#20851;&#31995;</b></p><div class="figure-contents"><div><img src="images/device/fops.gif" alt="inode&#65292;file&#21644;cdev&#38388;&#20851;&#31995;"></div></div></div><br class="figure-break">
&#19968;&#20010;&#39537;&#21160;&#21487;&#20197;&#39537;&#21160;&#22810;&#20010;&#23383;&#31526;&#35774;&#22791;&#65292;&#25152;&#20197;&#36825;&#37324;&#23558;&#23545;&#24212;&#36825;&#20123;&#35774;&#22791;&#25991;&#20214;&#30340;inode&#25918;&#20837;&#39537;&#21160;&#23545;&#24212;&#30340;cdev&#20013;&#65292;&#20415;&#20110;&#31649;&#29702;&#12290;
</div>
<div class="sect2" title="21.4. &#23383;&#31526;&#35774;&#22791;&#25805;&#20316;"><div class="titlepage"><div><div><h3 class="title"><a name="idp81786316"></a>21.4. &#23383;&#31526;&#35774;&#22791;&#25805;&#20316;</h3></div></div></div>
&#23383;&#31526;&#35774;&#22791;&#30340;&#25805;&#20316;&#22522;&#20110;&#26631;&#20934;&#25991;&#20214;&#30340;&#25805;&#20316;&#65292;&#23427;&#20204;&#26159;&#36825;&#20123;&#25805;&#20316;&#30340;&#23376;&#38598;&#65292;&#25152;&#26377;&#25805;&#20316;&#34987;&#23450;&#20041;&#22312;&#21517;&#20026;file_operation&#32467;&#26500;&#20013;&#65292;&#35774;&#22791;&#25991;&#20214;&#30340;&#25805;&#20316;&#38598;&#30001;&#39537;&#21160;&#24320;&#21457;&#32773;&#23450;&#20041;&#65292;&#24182;&#22312;open&#30340;&#36807;&#31243;&#20013;&#36171;&#20540;&#32473;file&#32467;&#26500;&#20307;&#20013;&#30340;f_op&#25351;&#38024;&#65292;&#28982;&#21518;&#19968;&#31995;&#21015;&#30340;&#25805;&#20316;&#37117;&#20250;&#23450;&#20301;&#21040;&#35774;&#22791;&#25991;&#20214;&#30340;&#25805;&#20316;&#38598;&#12290;&#35299;&#26512;&#26469;&#23558;&#20998;&#26512;&#36825;&#20123;&#25805;&#20316;&#30340;&#20844;&#29992;&#12290;
<div class="sect3" title="21.4.1. open&#21644;release"><div class="titlepage"><div><div><h4 class="title"><a name="idp81786948"></a>21.4.1. open&#21644;release</h4></div></div></div>
open &#26041;&#27861;&#25552;&#20379;&#32473;&#39537;&#21160;&#26469;&#20570;&#20219;&#20309;&#30340;&#21021;&#22987;&#21270;&#26469;&#20934;&#22791;&#21518;&#32493;&#30340;&#25805;&#20316;&#12290;&#22312;&#22823;&#37096;&#20998;&#39537;&#21160;&#20013;, open&#24212;&#24403;&#36827;&#34892;&#19979;&#38754;&#30340;&#24037;&#20316;:
<div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">&#30830;&#23450;&#35774;&#22791;&#26377;&#27809;&#26377;&#23601;&#32490;&#31561;&#31867;&#20284;&#30340;&#38169;&#35823;&#12290;</li><li class="listitem">&#22914;&#26524;&#23427;&#31532;&#19968;&#27425;&#25171;&#24320;, &#21021;&#22987;&#21270;&#35774;&#22791;&#12290;</li><li class="listitem">&#22914;&#26524;&#38656;&#35201;, &#26356;&#26032;f_op&#25351;&#38024;&#65292;&#36825;&#19968;&#28857;&#21487;&#20197;&#23454;&#29616;&#30456;&#21516;&#20027;&#35774;&#22791;&#21495;&#35774;&#22791;&#30340;&#19981;&#21516;&#25805;&#20316;&#38598;&#30340;&#26367;&#25442;&#12290;</li><li class="listitem">&#20998;&#37197;&#24182;&#22635;&#20805;&#35201;&#25918;&#36827; filp-&gt;private_data &#30340;&#20219;&#20309;&#25968;&#25454;&#32467;&#26500;&#12290;&#24403;cdev&#31561;&#26159;&#20869;&#23884;&#20837;&#20854;&#20182;&#32467;&#26500;&#20307;&#20013;&#26102;&#65292;&#21487;&#20197;&#25351;&#21521;&#35813;&#32467;&#26500;&#20307;&#12290;</li></ul></div>
&#25805;&#20316;&#38598;&#20013;open&#30340;&#21407;&#22411;&#23450;&#20041;&#22914;&#19979;&#65306;
<pre class="programlisting">
int (*open)(struct inode *inode, struct file *filp);
</pre>
<p>
inode&#21442;&#25968;&#26377;&#25105;&#20204;&#38656;&#35201;&#30340;&#20449;&#24687;&#65292;&#20197;&#23427;&#30340;i_cdev&#25104;&#21592;&#30340;&#24418;&#24335;&#65292;&#37324;&#38754;&#21253;&#21547;&#20043;&#21069;&#24314;&#31435;&#30340;cdev&#32467;&#26500;&#12290;&#22914;&#26524;cdev&#20869;&#23884;&#22312;&#20854;&#20182;&#32467;&#26500;&#20307;&#20013;&#65292;&#37027;&#20040;&#21807;&#19968;&#30340;&#38382;&#39064;&#26159;&#36890;&#24120;&#19981;&#38656;&#35201;cdev&#32467;&#26500;&#26412;&#36523;, &#32780;&#26159;&#21253;&#21547;cdev&#32467;&#26500;&#30340;vcdev&#32467;&#26500;&#12290;&#20869;&#26680;&#23454;&#29616;&#20102;container_of &#23439;&#65292;&#20197;&#20174;&#25104;&#21592;&#24471;&#21040;&#32467;&#26500;&#20307;&#30340;&#24320;&#22987;&#25351;&#38024;&#12290;
</p><pre class="programlisting">
struct vcdev *dev;
dev = container_of(inode-&gt;i_cdev, struct vcdev, cdev);
filp-&gt;private_data = dev;
</pre><p>
&#19968;&#26086;&#23427;&#25214;&#21040;vcdev&#32467;&#26500;&#65292;open&#20989;&#25968;&#23601;&#22312;&#25991;&#20214;&#32467;&#26500;&#30340; private_data &#25104;&#21592;&#20013;&#23384;&#20648;&#19968;&#20010;&#23427;&#30340;&#25351;&#38024;&#65292;&#20026;&#20197;&#21518;&#26356;&#26131;&#23384;&#21462;&#12290;&#23545;&#20110;&#35813;&#32467;&#26500;&#30340;&#21478;&#19968;&#20010;&#25805;&#20316;&#26159;&#23545;&#20854;&#20013;&#30340;f_op&#23454;&#26045;&#20599;&#26753;&#25442;&#26609;&#12290;&#32771;&#34385;&#21040;&#20027;&#35774;&#22791;&#21495;&#20026;1&#30340;&#20960;&#20010;&#35774;&#22791;&#65306;
</p><pre class="programlisting">
# ls /dev/ -l |grep -wrn 1,
......
31:crw-rw-rw-    1 root     root        1,   3 Mar  6  2012 null
35:crw-rw-rw-    1 root     root        1,   8 Mar  6  2012 random
110:crw-rw----    1 root     root        1,   9 Mar  6  2012 urandom
123:crw-rw-rw-    1 root     root        1,   5 Mar  6  2012 zero
</pre><p>
&#23427;&#20204;&#22343;&#26159;&#23383;&#31526;&#35774;&#22791;&#65292;&#20855;&#26377;&#30456;&#21516;&#30340;&#20027;&#35774;&#22791;&#21495;&#65292;&#20294;&#26159;&#23454;&#29616;&#20102;&#25130;&#28982;&#19981;&#21516;&#30340;&#21151;&#33021;&#12290;
</p><pre class="programlisting">
drivers/char/mem.c
static const struct memdev {
        const char *name;
        mode_t mode;
        const struct file_operations *fops;
        struct backing_dev_info *dev_info;
} devlist[] = {
......
         [3] = { "null", 0666, &amp;null_fops, NULL },
......
         [5] = { "zero", 0666, &amp;zero_fops, &amp;zero_bdi },
         [7] = { "full", 0666, &amp;full_fops, NULL },
         [8] = { "random", 0666, &amp;random_fops, NULL },
         [9] = { "urandom", 0666, &amp;urandom_fops, NULL },
......
};
</pre><p>
&#23427;&#20204;&#30340;&#25805;&#20316;&#21644;&#30456;&#20851;&#20449;&#24687;&#22343;&#23450;&#20041;&#22312;&#19968;&#20010;&#21517;&#20026;devlist&#30340;&#25968;&#32452;&#20013;&#65292;&#26377;&#24847;&#24605;&#30340;&#26159;&#23427;&#20204;&#30340;&#20174;&#35774;&#22791;&#21495;&#23601;&#26159;&#23427;&#20204;&#22312;&#35813;&#25968;&#32452;&#30340;&#19979;&#26631;&#12290;&#26681;&#25454;&#21069;&#20960;&#33410;&#30340;&#20998;&#26512;chardev_open&#22312;&#25171;&#24320;&#35774;&#22791;&#25991;&#20214;&#26102;&#65292;&#23558;file&#32467;&#26500;&#20013;&#30340;f_op&#25351;&#38024;&#36171;&#20540;&#20026;&#35813;&#35774;&#22791;&#25991;&#20214;&#30340;open&#20989;&#25968;&#65292;&#36825;&#37324;&#23601;&#26159;memory_open&#12290;
</p><pre class="programlisting">
static int memory_open(struct inode *inode, struct file *filp)
{
  int minor;
  const struct memdev *dev;

  minor = iminor(inode);
  if (minor &gt;= ARRAY_SIZE(devlist))
          return -ENXIO;

  dev = &amp;devlist[minor];
  if (!dev-&gt;fops)
          return -ENXIO;

  filp-&gt;f_op = dev-&gt;fops; /* &#20599;&#26753;&#25442;&#26609; */
  if (dev-&gt;dev_info)
          filp-&gt;f_mapping-&gt;backing_dev_info = dev-&gt;dev_info;
......
  if (dev-&gt;fops-&gt;open)
          return dev-&gt;fops-&gt;open(inode, filp);

  return 0;
}

static const struct file_operations memory_fops = {
	.open = memory_open,
	.llseek = noop_llseek,
};
</pre><p>
memory_open&#23454;&#29616;&#20102;&#19968;&#20010;&#20998;&#25903;&#22120;&#30340;&#20316;&#29992;&#65292;&#23427;&#39318;&#20808;&#26681;&#25454;&#23439;iminor&#21462;&#20986;inode&#20013;&#30340;&#20174;&#35774;&#22791;&#21495;&#65292;&#28982;&#21518;&#20174;&#25968;&#32452;&#20013;&#25214;&#21040;&#20174;&#35774;&#22791;&#21495;&#23545;&#24212;&#30340;&#25805;&#20316;&#65292;&#25509;&#30528;&#23454;&#29616;&#20102;&#8220;&#20599;&#26753;&#25442;&#26609;&#8221;&#12290;&#20854;&#20182;&#35774;&#22791;&#31867;&#22411;&#20063;&#37319;&#29992;&#20102;&#21516;&#26679;&#30340;&#26041;&#27861;&#65292;&#39318;&#20808;&#26681;&#25454;&#20027;&#35774;&#22791;&#21495;&#35774;&#32622;&#19968;&#20010;&#29305;&#23450;&#30340;&#25991;&#20214;&#25805;&#20316;&#38598;&#65292;&#22312;&#20854;open&#20989;&#25968;&#20013;&#21448;&#26681;&#25454;&#20174;&#35774;&#22791;&#21495;&#36873;&#25321;&#29305;&#23450;&#30340;&#25805;&#20316;&#26367;&#25442;&#24403;&#21069;&#30340;&#25805;&#20316;&#12290;
</p>
<p>
open&#20013;&#36824;&#20250;&#28041;&#21450;&#21478;&#22806;&#30340;&#19968;&#31867;&#25805;&#20316;&#65306;&#26435;&#38480;&#26816;&#26597;&#21644;&#20449;&#24687;&#32479;&#35745;&#12290;&#22914;&#26524;&#35774;&#22791;&#26159;&#21482;&#35835;&#65292;&#37027;&#20040;&#35774;&#22791;&#25991;&#20214;&#26435;&#38480;&#19978;&#21363;&#20415;&#21487;&#35835;&#20889;&#65292;&#37027;&#20040;&#23454;&#38469;&#20063;&#21482;&#33021;&#35835;&#65292;&#27492;&#26102;&#23601;&#38656;&#35201;&#36820;&#22238;&#38169;&#35823;&#20449;&#24687;&#12290;&#22914;&#26524;&#26159;&#20889;&#25805;&#20316;&#65292;&#21487;&#33021;&#38656;&#35201;&#28165;&#38500;&#20869;&#23481;&#30340;&#21160;&#20316;&#12290;&#36825;&#20123;&#26631;&#24535;&#20301;&#20110;file&#32467;&#26500;&#20013;&#30340;f_flags&#20013;&#12290;&#30456;&#20851;&#30340;&#25513;&#30721;&#23450;&#20041;&#22914;&#19979;&#65306;
</p><pre class="programlisting">
include/asm-generic/fcntl.h
#define O_ACCMODE       00000003
#define O_RDONLY        00000000
#define O_WRONLY        00000001
#define O_RDWR          00000002
......
</pre><p>
&#20449;&#24687;&#32479;&#35745;&#21487;&#20197;&#21253;&#21547;&#65292;&#25171;&#24320;&#30340;&#27425;&#25968;&#65292;&#27169;&#24335;&#31561;&#12290;
</p>
<pre class="programlisting">
int (*release) (struct inode *, struct file *);
</pre>
release &#26041;&#27861;&#20855;&#26377;&#19982;open&#30456;&#21516;&#30340;&#21442;&#25968;&#65292;&#23427;&#30340;&#35282;&#33394;&#19982;open&#30456;&#21453;&#12290;&#26377;&#26102;&#20250;&#21457;&#29616;&#26041;&#27861;&#30340;&#23454;&#29616;&#31216;&#20026;device_close, &#32780;&#19981;&#26159;device_release&#12290; &#20219;&#19968;&#26041;&#24335;, &#35774;&#22791;&#26041;&#27861;&#24212;&#24403;&#36827;&#34892;&#19979;&#38754;&#30340;&#20219;&#21153;:
<div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">&#37322;&#25918; open &#20998;&#37197;&#22312; filp-&gt;private_data &#20013;&#30340;&#20219;&#20309;&#19996;&#35199;&#65306;&#21160;&#24577;&#20998;&#37197;&#30340;&#36164;&#28304;&#30340;&#37322;&#25918;&#26159;&#24517;&#39035;&#30340;&#12290;</li><li class="listitem">&#22312;&#26368;&#21518;&#30340; close &#20851;&#38381;&#35774;&#22791;&#12290;</li></ul></div>
&#24403;&#19968;&#20010;&#35774;&#22791;&#25991;&#20214;&#20851;&#38381;&#27425;&#25968;&#36229;&#36807;&#23427;&#34987;&#25171;&#24320;&#30340;&#27425;&#25968;&#20250;&#21457;&#29983;&#20160;&#20040;&#65311;dup &#21644; fork &#31995;&#32479;&#35843;&#29992;&#19981;&#35843;&#29992; open &#26469;&#21019;&#24314;&#25171;&#24320;&#25991;&#20214;&#30340;&#25335;&#36125;; &#27599;&#20010;&#25335;&#36125;&#25509;&#30528;&#22312;&#31243;&#24207;&#32456;&#27490;&#26102;&#34987;&#20851;&#38381;&#12290; &#36825;&#37324;&#20998;&#26512;&#19968;&#19979;close&#20989;&#25968;&#30340;&#31995;&#32479;&#35843;&#29992;&#12290;
<pre class="programlisting">
fs/open.c
SYSCALL_DEFINE1(close, unsigned int, fd)

[&lt;c002e788&gt;] (unwind_backtrace+0x0/0xf8) from [&lt;bf00000c&gt;] (vcdev_release+0xc/0x18 [vcdev])
[&lt;bf00000c&gt;] (vcdev_release+0xc/0x18 [vcdev]) from [&lt;c00b5b40&gt;] (fput+0xc0/0x1e8)
[&lt;c00b5b40&gt;] (fput+0xc0/0x1e8) from [&lt;c00b2b9c&gt;] (filp_close+0x64/0x88)
[&lt;c00b2b9c&gt;] (filp_close+0x64/0x88) from [&lt;c00b3a94&gt;] (sys_close+0x90/0xbc)
[&lt;c00b3a94&gt;] (sys_close+0x90/0xbc) from [&lt;c0029a80&gt;] (ret_fast_syscall+0x0/0x30)
</pre>
&#36890;&#36807;&#22312;release&#20989;&#25968;&#20013;&#26597;&#30475;&#26632;&#65292;&#23481;&#26131;&#25214;&#21040;&#25972;&#20010;&#35843;&#29992;&#27969;&#31243;&#65292;&#30001;&#20110;__fput&#26159;static&#31867;&#22411;&#65292;&#38745;&#24577;&#20989;&#25968;&#20250;&#34987;&#33258;&#21160;&#20998;&#37197;&#22312;&#19968;&#20010;&#19968;&#30452;&#20351;&#29992;&#30340;&#23384;&#20648;&#21306;&#65292;&#30452;&#21040;&#36864;&#20986;&#24212;&#29992;&#31243;&#24207;&#23454;&#20363;&#65292;&#36991;&#20813;&#20102;&#35843;&#29992;&#20989;&#25968;&#26102;&#21387;&#26632;&#20986;&#26632;&#65292;&#25152;&#20197;&#36825;&#37324;&#30475;&#19981;&#21040;&#23427;&#12290;&#30456;&#27604;open&#35843;&#29992;&#65292;&#36825;&#37324;&#31616;&#21333;&#35768;&#22810;&#12290;
<pre class="programlisting">
sys_close-&gt;filp_close-&gt;fput-&gt;__fput-&gt;.release
</pre>
&#19981;&#26159;&#27599;&#20010; close &#31995;&#32479;&#35843;&#29992;&#37117;&#24341;&#36215;&#35843;&#29992; release&#12290;&#21482;&#26377;&#30495;&#27491;&#37322;&#25918;&#35774;&#22791;&#25968;&#25454;&#32467;&#26500;&#30340;&#35843;&#29992;&#20250;&#35843;&#29992;&#36825;&#20010;&#26041;&#27861;&#12290;&#20869;&#26680;&#32500;&#25345;&#19968;&#20010;&#25991;&#20214;&#32467;&#26500;&#34987;&#20351;&#29992;&#22810;&#23569;&#27425;&#30340;&#35745;&#25968;&#65292;&#23427;&#23601;&#26159;file&#32467;&#26500;&#20013;&#30340;f_count&#12290; fork &#21644; dup &#37117;&#19981;&#21019;&#24314;&#26032;&#25991;&#20214;(&#21482;&#26377; open &#36825;&#26679;); &#23427;&#20204;&#36890;&#36807;&#20989;&#25968;fget(fget_raw)&#21482;&#36882;&#22686;&#27491;&#23384;&#22312;&#30340;&#32467;&#26500;&#20013;&#30340;&#35745;&#25968;&#12290; close &#32479;&#35843;&#29992;&#20165;&#22312;&#25991;&#20214;&#32467;&#26500;&#35745;&#25968;&#25481;&#21040; 0 &#26102;&#25191;&#34892; release &#26041;&#27861;, &#36825;&#22312;&#32467;&#26500;&#34987;&#38144;&#27585;&#26102;&#21457;&#29983;&#12290;release &#26041;&#27861;&#21644; close &#31995;&#32479;&#35843;&#29992;&#20043;&#38388;&#30340;&#36825;&#31181;&#20851;&#31995;&#20445;&#35777;&#20102;&#39537;&#21160;&#19968;&#27425; open &#21482;&#30475;&#21040;&#19968;&#27425; release&#12290;
<pre class="programlisting">
fs/file_table.c
void fput(struct file *file)
{
	if (atomic_long_dec_and_test(&amp;file-&gt;f_count))
		__fput(file);	
}
</pre>
fput&#20013;&#30340;atomic_long_dec_and_test&#23601;&#26159;&#29992;&#26469;&#27979;&#35797;f_count&#26159;&#21542;&#36882;&#20943;&#20026;0&#65292;&#22914;&#26524;&#26159;&#25165;&#35843;&#29992;__fput&#23436;&#25104;file&#32467;&#26500;&#20307;&#30340;&#37322;&#25918;&#12290;
</div>
<div class="sect3" title="21.4.2. read&#21644;write"><div class="titlepage"><div><div><h4 class="title"><a name="idp81799316"></a>21.4.2. read&#21644;write</h4></div></div></div>
&#35835;&#21644;&#20889;&#30340;&#25805;&#20316;&#31867;&#20284;&#65292;&#20854;&#23454;&#29616;&#20989;&#25968;&#30340;&#21442;&#25968;&#20063;&#31867;&#20284;&#12290;&#20250;&#27880;&#24847;&#21040;&#19981;&#23569;&#21442;&#25968;&#21253;&#21547;&#23383;&#20018; __user&#12290;&#36825;&#31181;&#27880;&#35299;&#26159;&#19968;&#31181;&#25991;&#26723;&#24418;&#24335;, &#27880;&#24847;&#65292;&#19968;&#20010;&#25351;&#38024;&#26159;&#19968;&#20010;&#19981;&#33021;&#34987;&#30452;&#25509;&#35299;&#24341;&#29992;&#30340;&#29992;&#25143;&#31354;&#38388;&#22320;&#22336;. &#23545;&#20110;&#27491;&#24120;&#30340;&#32534;&#35793;, __user &#27809;&#26377;&#25928;&#26524;&#65292;&#20294;&#26159;&#23427;&#21487;&#34987;&#22806;&#37096;&#26816;&#26597;&#36719;&#20214;&#20351;&#29992;&#26469;&#25214;&#20986;&#23545;&#29992;&#25143;&#31354;&#38388;&#22320;&#22336;&#30340;&#38169;&#35823;&#20351;&#29992;&#12290;
<pre class="programlisting">
ssize_t read(struct file *filp, char __user *buff, size_t count, loff_t *offp);
ssize_t write(struct file *filp, const char __user *buff, size_t count, loff_t *offp);
</pre>
&#23545;&#20110;&#36825;&#20004;&#20010;&#26041;&#27861;&#65292;filp&#26159;&#25991;&#20214;&#25351;&#38024;&#65292;count&#26159;&#35831;&#27714;&#30340;&#20256;&#36755;&#25968;&#25454;&#22823;&#23567;&#12290;buff&#21442;&#25968;&#25351;&#21521;&#25345;&#26377;&#34987;&#20889;&#20837;&#25968;&#25454;&#30340;&#32531;&#23384;&#65292;&#25110;&#32773;&#25918;&#20837;&#26032;&#25968;&#25454;&#30340;&#31354;&#32531;&#23384;&#12290;&#26368;&#21518;, offp &#26159;&#19968;&#20010;&#25351;&#38024;&#25351;&#21521;&#19968;&#20010;"long offset type"&#23545;&#35937;&#65292;&#23427;&#25351;&#20986;&#29992;&#25143;&#27491;&#22312;&#23384;&#21462;&#30340;&#25991;&#20214;&#20301;&#32622;&#12290;&#36820;&#22238;&#20540;&#26159;&#19968;&#20010;"signed size type"&#12290;
<p>
read &#21644; write &#26041;&#27861;&#30340; buff &#21442;&#25968;&#26159;&#29992;&#25143;&#31354;&#38388;&#25351;&#38024;. &#22240;&#27492;, &#23427;&#19981;&#33021;&#34987;&#20869;&#26680;&#20195;&#30721;&#30452;&#25509;&#35299;&#24341;&#29992;&#12290;&#20869;&#26680;&#25552;&#20379;&#20102;&#20004;&#20010;&#20989;&#25968;&#23454;&#29616;&#20869;&#26680;&#19982;&#29992;&#25143;&#31354;&#38388;&#25968;&#25454;&#30340;&#25644;&#31227;&#65306;
</p><pre class="programlisting">
unsigned long copy_to_user(void __user *to,const void *from,unsigned long count);
unsigned long copy_from_user(void *to,const void __user *from,unsigned long count);
</pre><p>	
&#36825; 2 &#20010;&#20989;&#25968;&#30340;&#35282;&#33394;&#19981;&#38480;&#20110;&#25335;&#36125;&#25968;&#25454;&#21040;&#21644;&#20174;&#29992;&#25143;&#31354;&#38388;: &#23427;&#20204;&#36824;&#26816;&#26597;&#29992;&#25143;&#31354;&#38388;&#25351;&#38024;&#26159;&#21542;&#26377;&#25928;. &#22914;&#26524;&#25351;&#38024;&#26080;&#25928;, &#19981;&#36827;&#34892;&#25335;&#36125;; &#22914;&#26524;&#22312;&#25335;&#36125;&#20013;&#36935;&#21040;&#19968;&#20010;&#26080;&#25928;&#22320;&#22336;, &#21478;&#19968;&#26041;&#38754;, &#21482;&#25335;&#36125;&#37096;&#20998;&#25968;&#25454;. &#22312; 2 &#31181;&#24773;&#20917;&#19979;, &#36820;&#22238;&#20540;&#26159;&#36824;&#35201;&#25335;&#36125;&#30340;&#25968;&#25454;&#37327;&#12290;&#19981;&#31649;&#36825;&#20123;&#26041;&#27861;&#20256;&#36865;&#22810;&#23569;&#25968;&#25454;, &#23427;&#20204;&#36890;&#24120;&#24212;&#24403;&#26356;&#26032; *offp &#20013;&#30340;&#25991;&#20214;&#20301;&#32622;&#26469;&#34920;&#31034;&#22312;&#31995;&#32479;&#35843;&#29992;&#25104;&#21151;&#23436;&#25104;&#21518;&#24403;&#21069;&#30340;&#25991;&#20214;&#20301;&#32622;&#12290;
</p>
<p>
read &#21644; write &#26041;&#27861;&#37117;&#22312;&#21457;&#29983;&#38169;&#35823;&#26102;&#36820;&#22238;&#19968;&#20010;&#36127;&#20540;. &#30456;&#21453;, &#22823;&#20110;&#25110;&#31561;&#20110; 0 &#30340;&#36820;&#22238;&#20540;&#21578;&#30693;&#35843;&#29992;&#31243;&#24207;&#26377;&#22810;&#23569;&#23383;&#33410;&#24050;&#32463;&#25104;&#21151;&#20256;&#36865;&#12290;&#23613;&#31649;&#20869;&#26680;&#20989;&#25968;&#36820;&#22238;&#19968;&#20010;&#36127;&#25968;&#25351;&#31034;&#19968;&#20010;&#38169;&#35823;&#65292;&#36825;&#20010;&#25968;&#30340;&#20540;&#25351;&#20986;&#25152;&#21457;&#29983;&#30340;&#38169;&#35823;&#31867;&#22411;&#65292;&#29992;
&#25143;&#31354;&#38388;&#36816;&#34892;&#30340;&#31243;&#24207;&#24120;&#24120;&#30475;&#21040; -1 &#20316;&#20026;&#38169;&#35823;&#36820;&#22238;&#20540;&#12290; &#23427;&#20204;&#38656;&#35201;&#23384;&#21462; errno &#21464;&#37327;&#26469;&#25214;&#20986;&#21457;&#29983;&#20102;&#20160;&#20040;&#12290;&#29992;&#25143;&#31354;&#38388;&#30340;&#34892;&#20026;&#30001; POSIX &#26631;&#20934;&#26469;&#35268;&#23450;, &#20294;&#26159;&#36825;&#20010;&#26631;&#20934;&#27809;&#26377;&#35268;&#23450;&#20869;&#26680;&#20869;&#37096;&#22914;&#20309;&#25805;&#20316;&#12290;
</p>
<p>
read &#30340;&#36820;&#22238;&#20540;&#30001;&#35843;&#29992;&#30340;&#24212;&#29992;&#31243;&#24207;&#35299;&#37322;:
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">&#22914;&#26524;&#36825;&#20010;&#20540;&#31561;&#20110;&#20256;&#36882;&#32473; read &#31995;&#32479;&#35843;&#29992;&#30340; count &#21442;&#25968;, &#35831;&#27714;&#30340;&#23383;&#33410;&#25968;&#24050;&#32463;&#34987;&#20256;&#36865;. &#36825;&#26159;&#26368;&#22909;&#30340;&#24773;&#20917;&#12290;</li><li class="listitem">&#22914;&#26524;&#26159;&#27491;&#25968;, &#20294;&#26159;&#23567;&#20110; count, &#21482;&#26377;&#37096;&#20998;&#25968;&#25454;&#34987;&#20256;&#36865;. &#36825;&#21487;&#33021;&#30001;&#20110;&#20960;&#20010;&#21407;&#22240;, &#20381;&#36182;&#20110;&#35774;&#22791;&#12290; &#24120;&#24120;,
&#24212;&#29992;&#31243;&#24207;&#37325;&#26032;&#35797;&#30528;&#35835;&#21462;&#12290;&#20363;&#22914;, &#22914;&#26524;&#20320;&#20351;&#29992; fread &#20989;&#25968;&#26469;&#35835;&#21462;, &#24211;&#20989;&#25968;&#37325;&#26032;&#21457;&#20986;&#31995;&#32479;&#35843;&#29992;&#30452;&#21040;&#35831;&#27714;&#30340;&#25968;&#25454;&#20256;&#36865;&#23436;&#25104;&#12290;</li><li class="listitem">&#22914;&#26524;&#20540;&#20026; 0, &#21040;&#36798;&#20102;&#25991;&#20214;&#26411;&#23614;(&#27809;&#26377;&#35835;&#21462;&#25968;&#25454;)&#12290;</li><li class="listitem">&#19968;&#20010;&#36127;&#20540;&#34920;&#31034;&#26377;&#19968;&#20010;&#38169;&#35823;. &#36825;&#20010;&#20540;&#25351;&#20986;&#20102;&#20160;&#20040;&#38169;&#35823;, &#26681;&#25454;linux/errno.h&#12290;&#20986;&#38169;&#30340;&#20856;&#22411;&#36820;&#22238;&#20540;&#21253;&#25324; -EINTR( &#34987;&#25171;&#26029;&#30340;&#31995;&#32479;&#35843;&#29992;) &#25110;&#32773; -EFAULT(&#22351;&#22320;&#22336;)&#12290;</li></ul></div><p>
write, &#35937; read, &#21487;&#20197;&#20256;&#36865;&#23569;&#20110;&#35201;&#27714;&#30340;&#25968;&#25454;, &#26681;&#25454;&#36820;&#22238;&#20540;&#30340;&#19979;&#21015;&#35268;&#21017;:
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">&#22914;&#26524;&#20540;&#31561;&#20110; count, &#35201;&#27714;&#30340;&#23383;&#33410;&#25968;&#24050;&#34987;&#20256;&#36865;.</li><li class="listitem">&#22914;&#26524;&#27491;&#20540;, &#20294;&#26159;&#23567;&#20110; count, &#21482;&#26377;&#37096;&#20998;&#25968;&#25454;&#34987;&#20256;&#36865;. &#31243;&#24207;&#26368;&#21487;&#33021;&#37325;&#35797;&#20889;&#20837;&#21097;&#19979;&#30340;&#25968;&#25454;.</li><li class="listitem">&#22914;&#26524;&#20540;&#20026; 0, &#20160;&#20040;&#27809;&#26377;&#20889;. &#36825;&#20010;&#32467;&#26524;&#19981;&#26159;&#19968;&#20010;&#38169;&#35823;, &#27809;&#26377;&#29702;&#30001;&#36820;&#22238;&#19968;&#20010;&#38169;&#35823;&#30721;. &#20877;&#19968;&#27425;, &#26631;&#20934;&#24211;&#37325;&#35797;&#20889;&#35843;&#29992;&#12290;</li><li class="listitem">&#19968;&#20010;&#36127;&#20540;&#34920;&#31034;&#21457;&#29983;&#19968;&#20010;&#38169;&#35823;; &#22914;&#21516;&#23545;&#20110;&#35835;, &#26377;&#25928;&#30340;&#38169;&#35823;&#20540;&#26159;&#23450;&#20041;&#20110;linux/errno.h&#20013;&#12290;</li></ul></div><p>
</p>
</div>
<div class="sect3" title="21.4.3. ioctl&#25509;&#21475;"><div class="titlepage"><div><div><h4 class="title"><a name="idp81804436"></a>21.4.3. ioctl&#25509;&#21475;</h4></div></div></div>
&#22823;&#37096;&#20998;&#39537;&#21160;&#38500;&#20102;&#38656;&#35201;&#35835;&#20889;&#35774;&#22791;&#30340;&#33021;&#21147;&#65292;&#36824;&#36890;&#36807;&#35774;&#22791;&#39537;&#21160;&#36827;&#34892;&#21508;&#31181;&#30828;&#20214;&#25511;&#21046;&#30340;&#33021;&#21147;&#12290;&#22823;&#37096;&#20998;&#35774;&#22791;&#21487;&#36827;&#34892;&#36229;&#20986;&#31616;&#21333;&#30340;&#25968;&#25454;&#20256;&#36755;&#20043;&#22806;&#30340;&#25805;&#20316;; &#29992;&#25143;&#31354;&#38388;&#24517;&#39035;&#24120;&#24120;&#33021;&#22815;&#35831;&#27714;, &#20363;&#22914;, led&#35774;&#22791;&#21487;&#20197;&#20142;&#65292;&#28781;&#21644;&#38378;&#28865;&#65292;&#28201;&#24230;&#25511;&#21046;&#22120;&#21487;&#20197;&#35774;&#32622;&#25253;&#35686;&#38408;&#20540;&#65292;&#25110;&#32773;&#24320;&#21551;&#20851;&#38381;&#12290;&#36825;&#20123;&#25805;&#20316;&#24120;&#24120;&#36890;&#36807; ioctl &#26041;&#27861;&#26469;&#25903;&#25345;, &#23427;&#36890;&#36807;&#30456;&#21516;&#21517;&#23376;&#30340;&#31995;&#32479;&#35843;&#29992;&#26469;&#23454;&#29616;&#12290;&#22312;&#29992;&#25143;&#31354;&#38388;, ioctl &#31995;&#32479;&#35843;&#29992;&#26377;&#19979;&#38754;&#30340;&#21407;&#22411;:
<pre class="programlisting">
#include &lt;sys/ioctl.h&gt;
int ioctl(int d, int request, ...);
</pre>
ioctl&#20989;&#25968;&#24182;&#19981;&#20855;&#26377;&#25968;&#30446;&#19981;&#23450;&#30340;&#21442;&#25968;&#12290;&#22312;&#23454;&#38469;&#31995;&#32479;&#20013;&#19968;&#20010;&#31995;&#32479;&#35843;&#29992;&#19981;&#33021;&#30495;&#27491;&#26377;&#21464;&#25968;&#30446;&#30340;&#21442;&#25968;&#12290;&#31995;&#32479;&#35843;&#29992;&#24517;&#39035;&#26377;&#19968;&#20010;&#24456;&#22909;&#23450;&#20041;&#30340;&#21407;&#22411;&#65292;&#22240;&#20026;&#29992;&#25143;&#31243;&#24207;&#21487;&#23384;&#21462;&#23427;&#20204;&#24517;&#39035;&#28385;&#36275;&#30828;&#20214;&#30340;&#38480;&#21046;&#12290;ioctl&#20989;&#25968;&#26159;&#19968;&#20010;&#21333;&#20010;&#21487;&#36873;&#30340;&#21442;&#25968;, &#20256;&#32479;&#19978;&#26631;&#35782;&#20026;char *argp&#65292;&#36825;&#20123;&#28857;&#22312;&#37027;&#37324;&#21482;&#26159;&#20026;&#20102;&#38459;&#27490;&#22312;&#32534;&#35793;&#26102;&#30340;&#31867;&#22411;&#26816;&#26597;&#12290;&#31532;3&#20010;&#21442;&#25968;&#30340;&#23454;&#38469;&#29305;&#28857;&#20381;&#36182;&#25152;&#21457;&#20986;&#30340;&#29305;&#23450;&#30340;&#25511;&#21046;&#21629;&#20196;(&#31532;2&#20010;&#21442;&#25968; ). &#19968;&#20123;&#21629;&#20196;&#19981;&#29992;&#21442;&#25968;, &#19968;&#20123;&#29992;&#19968;&#20010;&#25972;&#25968;&#20540;, &#20197;&#21450;&#19968;&#20123;&#20351;&#29992;&#25351;&#21521;&#20854;&#20182;&#25968;&#25454;&#30340;&#25351;&#38024;&#12290;&#20351;&#29992;&#19968;&#20010;&#25351;&#38024;&#26159;&#20256;&#36882;&#20219;&#24847;&#25968;&#25454;&#21040;ioctl&#35843;&#29992;&#30340;&#26041;&#27861;; &#35774;&#22791;
&#25509;&#30528;&#21487;&#19982;&#29992;&#25143;&#31354;&#38388;&#20132;&#25442;&#20219;&#20309;&#25968;&#37327;&#30340;&#25968;&#25454;&#12290;
<p>
ioctl &#35843;&#29992;&#30340;&#38750;&#32467;&#26500;&#21270;&#29305;&#24615;&#20351;&#23427;&#22312;&#20869;&#26680;&#24320;&#21457;&#32773;&#20013;&#22833;&#23456;&#12290;&#27599;&#20010;ioctl&#21629;&#20196;, &#22522;&#26412;&#19978;, &#26159;&#19968;&#20010;&#21333;&#29420;&#30340;, &#24120;&#24120;&#26080;&#25991;&#26723;&#30340;&#31995;&#32479;&#35843;&#29992;, &#24182;&#19988;&#27809;&#26377;&#26041;&#27861;&#20197;&#20219;&#20309;&#31867;&#22411;&#30340;&#20840;&#38754;&#30340;&#26041;&#24335;&#26680;&#26597;&#36825;&#20123;&#35843;&#29992;. &#20063;&#38590;&#20110;&#20351;&#38750;&#32467;&#26500;&#21270;&#30340; ioctl&#21442;&#25968;&#22312;&#25152;&#26377;&#31995;&#32479;&#19978;&#19968;&#33268;&#24037;&#20316;; &#20363;&#22914;, &#32771;&#34385;&#36816;&#34892;&#22312; 32-&#20301;&#27169;&#24335;&#30340;&#19968;&#20010;&#29992;&#25143;&#36827;&#31243;&#30340; 64-&#20301;&#31995;&#32479;&#12290; &#32467;&#26524;, &#26377;&#24456;&#22823;&#30340;&#21387;&#21147;&#26469;&#23454;&#29616;&#28151;&#26434;&#30340;&#25511;&#21046;&#25805;&#20316;, &#21482;&#36890;&#36807;&#20219;&#20309;&#20854;&#20182;&#30340;&#26041;&#27861;. &#21487;&#33021;&#30340;&#36873;&#25321;&#21253;&#25324;&#23884;&#20837;&#21629;&#20196;&#21040;&#25968;&#25454;&#27969;, &#35201;&#20040;&#26159; sysfs &#35201;&#20040;&#26159;&#35774;&#22791;&#29305;&#23450;&#30340;&#25991;&#20214;&#31995;&#32479;&#12290;&#20294;&#26159;, &#20107;&#23454;&#26159; ioctl &#24120;&#24120;&#26159;&#26368;&#23481;&#26131;&#30340;&#21644;&#26368;&#30452;&#25509;&#30340;&#36873;&#25321;&#12290;
</p>
<p>
ioctl &#39537;&#21160;&#26041;&#27861;&#26377;&#21644;&#29992;&#25143;&#31354;&#38388;&#29256;&#26412;&#19981;&#21516;&#30340;&#21407;&#22411;:
</p><pre class="programlisting">
	/* old system */
	int (*ioctl) (struct inode *inode, struct file *filp, unsigned int cmd, unsigned long arg);

	long (*unlocked_ioctl) (struct file *, unsigned int, unsigned long);
	long (*compat_ioctl) (struct file *, unsigned int, unsigned long);
</pre><p>
&#22312;kernel 2.6.36 &#20013;&#24050;&#32463;&#23436;&#20840;&#21024;&#38500;&#20102;struct file_operations &#20013;&#30340;ioctl &#20989;&#25968;&#25351;&#38024;&#65292;&#21462;&#32780;&#20195;&#20043;&#30340;&#26159;unlocked_ioctl&#12290;&#36825;&#20010;&#25351;&#38024;&#20989;&#25968;&#21464;&#20102;&#20043;&#21518;&#26368;&#22823;&#30340;&#24433;&#21709;&#26159;&#21442;&#25968;&#20013;&#23569;&#20102;inode &#65292; &#19981;&#36807;&#36825;&#20010;&#19981;&#26159;&#38382;&#39064;&#65292;&#22240;&#20026;&#29992;&#25143;&#31243;&#24207;&#20013;&#30340;ioctl&#23545;&#24212;&#30340;&#31995;&#32479;&#35843;&#29992;&#25509;&#21475;&#27809;&#26377;&#21464;&#21270;&#65292;&#25152;&#20197;&#29992;&#25143;&#31243;&#24207;&#19981;&#38656;&#35201;&#25913;&#21464;&#65292;&#19968;&#20999;&#37117;&#20132;&#32473;&#20869;&#26680;&#22788;&#29702;&#20102;&#65292;&#22914;&#26524;&#24819;&#22312;unlocked_ioctl&#20013;&#33719;&#24471;inode &#31561;&#20449;&#24687;&#21487;&#20197;&#29992;&#22914;&#19979;&#26041;&#27861;&#65306;
</p><pre class="programlisting">
struct inode *inode = file-&gt;f_mapping-&gt;host;
</pre><p>
compat_ioctl&#34987;&#20351;&#29992;&#22312;&#29992;&#25143;&#31354;&#38388;&#20026;32&#20301;&#27169;&#24335;&#65292;&#32780;&#20869;&#26680;&#36816;&#34892;&#22312;64&#20301;&#27169;&#24335;&#26102;&#12290;&#36825;&#26102;&#20505;&#65292;&#38656;&#35201;&#23558;64&#20301;&#36716;&#25104;32&#20301;&#12290;compat_ioctl&#23569;&#20102;inode&#21442;&#25968;, &#21487;&#20197;&#36890;&#36807;&#22914;&#19979;&#26041;&#27861;&#33719;&#24471;&#12290;&#26032;&#20989;&#25968;&#30340;&#31532;&#20108;&#20010;&#21442;&#25968;&#19982;ioctl&#20013;&#30340;cmd&#20316;&#29992;&#30456;&#21516;&#65292;&#32780;&#31532;&#19977;&#20010;&#21442;&#25968;&#20381;&#28982;&#34920;&#31034;&#29992;&#25143;&#31354;&#38388;&#20256;&#36882;&#26469;&#30340;&#25351;&#38024;&#12290;
</p><pre class="programlisting">
struct inode *inode = filp-&gt;f_dentry-&gt;d_inode;
</pre><p>
</p>
<div class="sect4" title="21.4.3.1. ioctl&#35843;&#29992;&#27969;&#31243;"><div class="titlepage"><div><div><h5 class="title"><a name="idp81811764"></a>21.4.3.1. ioctl&#35843;&#29992;&#27969;&#31243;</h5></div></div></div>
ioctl&#36890;&#36807;&#19968;&#31181;&#21487;&#29992;&#20110;&#22788;&#29702;&#25991;&#20214;&#30340;&#29305;&#27530;&#26041;&#27861;&#23454;&#29616;&#12290;&#35813;&#26041;&#27861;&#23545;&#35774;&#22791;&#25991;&#20214;&#26377;&#25928;&#65292;&#20294;&#23545;&#26222;&#36890;&#25991;&#20214;&#26080;&#25928;&#12290;&#20869;&#26680;&#20351;&#29992;sys_ioctl&#22788;&#29702;&#29992;&#25143;&#31354;&#38388;ioctl&#35843;&#29992;&#12290;
&#26681;&#25454;&#35843;&#29992;&#26632;&#21487;&#20197;&#24471;&#21040;&#35843;&#29992;&#27969;&#31243;&#65306;
<pre class="programlisting">
[&lt;c002e788&gt;] (unwind_backtrace+0x0/0xf8) from [&lt;bf004050&gt;] (vcdev_ioctl+0x24/0x1b0 [vcdev])
[&lt;bf004050&gt;] (vcdev_ioctl+0x24/0x1b0 [vcdev]) from [&lt;c00c212c&gt;] (vfs_ioctl+0x30/0x44)
[&lt;c00c212c&gt;] (vfs_ioctl+0x30/0x44) from [&lt;c00c23d0&gt;] (do_vfs_ioctl+0x6c/0x534)
[&lt;c00c23d0&gt;] (do_vfs_ioctl+0x6c/0x534) from [&lt;c00c28d0&gt;] (sys_ioctl+0x38/0x60)
[&lt;c00c28d0&gt;] (sys_ioctl+0x38/0x60) from [&lt;c0029a80&gt;] (ret_fast_syscall+0x0/0x30)

sys_ioctl-&gt;do_vfs_ioctl-&gt;vfs_ioctl-&gt;unlocked_ioctl
</pre>
do_vfs_ioctl&#23558;&#21028;&#26029;&#25991;&#20214;&#30340;&#31867;&#22411;&#65292;&#22914;&#26524;&#26159;&#24120;&#35268;&#25991;&#20214;(regular)&#65292;&#21017;&#35843;&#29992;file_ioctl&#65292;&#21542;&#21017;&#35843;&#29992;VFS&#20013;&#30340;vfs_ioctl&#12290;
<pre class="programlisting">
int do_vfs_ioctl(struct file *filp, unsigned int fd, unsigned int cmd,
	     unsigned long arg)
{
......
	default:
		if (S_ISREG(inode-&gt;i_mode))
			error = file_ioctl(filp, cmd, arg);
		else
			error = vfs_ioctl(filp, cmd, arg);
		break;
	}
	return error;
}
</pre>
vfs_ioctl&#20013;&#35843;&#29992;unlocked_ioctl&#65292;&#22914;&#26524;&#27809;&#26377;&#21017;&#36820;&#22238;ENOTTY&#12290;
<pre class="programlisting">
static long vfs_ioctl(struct file *filp, unsigned int cmd,
		      unsigned long arg)
{
	int error = -ENOTTY;

	if (!filp-&gt;f_op || !filp-&gt;f_op-&gt;unlocked_ioctl)
		goto out;

	error = filp-&gt;f_op-&gt;unlocked_ioctl(filp, cmd, arg);
	if (error == -ENOIOCTLCMD)
		error = -EINVAL;
 out:
	return error;
}
</pre>
</div>
<div class="sect4" title="21.4.3.2. ioctl&#21629;&#20196;"><div class="titlepage"><div><div><h5 class="title"><a name="idp81814644"></a>21.4.3.2. ioctl&#21629;&#20196;</h5></div></div></div>
&#22312;&#20026; ioctl &#32534;&#20889;&#20195;&#30721;&#20043;&#21069;, &#38656;&#35201;&#36873;&#25321;&#23545;&#24212;&#21629;&#20196;&#30340;&#25968;&#23383;&#12290;&#35768;&#22810;&#31243;&#24207;&#21592;&#30340;&#31532;&#19968;&#20010;&#26412;&#33021;&#30340;&#21453;&#24212;&#26159;&#36873;&#25321;&#19968;&#32452;&#23567;&#25968;&#20174;0&#25110;1&#24320;&#22987;&#65292;&#24182;&#19988;&#20174;&#27492;&#24320;&#22987;&#21521;&#19978;&#12290; &#20294;&#26159;&#65292;&#26377;&#20805;&#20998;&#30340;&#29702;&#30001;&#19981;&#36825;&#26679;&#20570;&#12290;ioctl&#21629;&#20196;&#25968;&#23383;&#24212;&#24403;&#22312;&#36825;&#20010;&#31995;&#32479;&#26159;&#21807;&#19968;&#30340;, &#20026;&#20102;&#38459;&#27490;&#21521;&#38169;&#35823;&#30340;&#35774;&#22791;&#21457;&#20986;&#27491;&#30830;&#30340;&#21629;&#20196;&#32780;&#24341;&#36215;&#30340;&#38169;&#35823;&#12290; &#21629;&#20196;&#32534;&#30721;&#24050;&#34987;&#21010;&#20998;&#20026;&#20960;&#20010;&#20301;&#27573;&#65306;
<pre class="programlisting">
cmd&#30340;&#22823;&#23567;&#20026; 32&#20301;&#65292;&#20849;&#20998; 4 &#20010;&#22495;&#65306;
b[31:30] 2&#20301;&#20026; &#8220;&#21306;&#21035;&#35835;&#20889;&#8221; &#21306;&#65292;&#20316;&#29992;&#26159;&#21306;&#20998;&#26159;&#35835;&#21462;&#21629;&#20196;&#36824;&#26159;&#20889;&#20837;&#21629;&#20196;&#12290;
b[29:15] 14&#20301;&#20026; "&#21442;&#25968;&#22823;&#23567;" &#21306;&#65292;&#34920;&#31034; ioctl() &#20013;&#30340;arg&#21464;&#37327;&#20256;&#36865;&#30340;&#20869;&#23384;&#22823;&#23567;&#12290;
b[14:08]  8&#20301;&#20026; &#8220;&#39764;&#25968;"(&#20063;&#31216;&#20026;"&#24187;&#25968;")&#21306;&#65292;&#36825;&#20010;&#20540;&#29992;&#20197;&#19982;&#20854;&#23427;&#35774;&#22791;&#39537;&#21160;&#31243;&#24207;&#30340; ioctl &#21629;&#20196;&#36827;&#34892;&#21306;&#21035;&#12290;
b[07:00]  8&#20301;&#20026; "&#21306;&#21035;&#24207;&#21495;" &#21306;&#65292;&#26159;&#21306;&#20998;&#21629;&#20196;&#30340;&#21629;&#20196;&#39034;&#24207;&#24207;&#21495;&#65292;&#20063;&#34987;&#31216;&#20026;&#22522;&#25968;&#12290;
</pre>
&#26681;&#25454; Linux &#20869;&#26680;&#24815;&#20363;&#26469;&#20026;&#20320;&#30340;&#39537;&#21160;&#36873;&#25321; ioctl &#21495;&#65292;&#24212;&#24403;&#39318;&#20808;&#26816;&#26597;include/asm/ioctl.h&#21644;Documentation/ioctl/ioctl-number.txt&#12290;&#36825;&#20010;&#22836;&#25991;&#20214;&#23450;&#20041;&#20320;&#23558;&#20351;&#29992;&#30340;&#20301;&#27573;: &#20256;&#36755;&#26041;&#21521;&#65292;&#21442;&#25968;&#22823;&#23567;&#65292;type(&#39764;&#25968;), &#24207;&#21495;&#21644;&#21442;&#25968;&#22823;&#23567;&#12290;
<p>
&#20687;&#21629;&#20196;&#30721;&#20013;&#30340; &#8220;&#21306;&#20998;&#35835;&#20889;&#21306;&#8221; &#37324;&#30340;&#20540;&#34987;&#23450;&#20041;&#20026;&#23439;_IOC_NONE &#65288;0&#20540;&#65289;&#34920;&#31034;&#26080;&#25968;&#25454;&#20256;&#36755;&#65292;_IOC_READ (&#35835;)&#65292; _IOC_WRITE (&#20889;) &#65292; _IOC_READ|_IOC_WRITE (&#21452;&#21521;)&#12290;&#20869;&#26680;&#23450;&#20041;&#20102; _IO() , _IOR() , IOW() &#21644; _IOWR() &#36825; 4 &#20010;&#23439;&#26469;&#36741;&#21161;&#29983;&#25104;&#19978;&#38754;&#30340;&#23439;&#12290;
</p><pre class="programlisting">
include/asm/ioctl.h
#define _IO(type,nr)            _IOC(_IOC_NONE,(type),(nr),0)
#define _IOR(type,nr,size)      _IOC(_IOC_READ,(type),(nr),(_IOC_TYPECHECK(size)))
#define _IOW(type,nr,size)      _IOC(_IOC_WRITE,(type),(nr),(_IOC_TYPECHECK(size)))
#define _IOWR(type,nr,size)     _IOC(_IOC_READ|_IOC_WRITE,(type),(nr),(_IOC_TYPECHECK(size)))
</pre><p>
type&#39764;&#25968;&#30340;&#33539;&#22260;&#24517;&#39035;&#20026;0~255&#65292;&#36890;&#24120;&#29992;&#33521;&#25991;&#23383;&#31526; "A" ~ "Z" &#25110;&#32773; "a" ~ "z" &#26469;&#34920;&#31034;&#12290;&#35774;&#22791;&#39537;&#21160;&#31243;&#24207;&#20174;&#20256;&#36882;&#36827;&#26469;&#30340;&#21629;&#20196;&#33719;&#21462;&#39764;&#25968;&#65292;&#28982;&#21518;&#19982;&#33258;&#36523;&#22788;&#29702;&#30340;&#39764;&#25968;&#24819;&#27604;&#36739;&#65292;&#22914;&#26524;&#30456;&#21516;&#21017;&#22788;&#29702;&#65292;&#19981;&#21516;&#21017;&#19981;&#22788;&#29702;&#12290;&#39764;&#25968;&#26159;&#25298;&#32477;&#35823;&#20351;&#29992;&#30340;&#21021;&#27493;&#36741;&#21161;&#29366;&#24577;&#12290;&#35774;&#22791;&#39537;&#21160;&#31243;&#24207;&#21487;&#20197;&#36890;&#36807; _IOC_TYPE (cmd)&#26469;&#33719;&#21462;&#39764;&#25968;&#12290;&#19981;&#21516;&#30340;&#35774;&#22791;&#39537;&#21160;&#31243;&#24207;&#26368;&#22909;&#35774;&#32622;&#19981;&#21516;&#30340;&#39764;&#25968;&#65292;&#20294;&#24182;&#19981;&#26159;&#35201;&#27714;&#32477;&#23545;&#65292;&#20063;&#26159;&#21487;&#20197;&#20351;&#29992;&#20854;&#20182;&#35774;&#22791;&#39537;&#21160;&#31243;&#24207;&#24050;&#29992;&#36807;&#30340;&#39764;&#25968;&#12290;
</p>
<p>
&#22522;&#25968;nr&#29992;&#20110;&#21306;&#21035;&#21508;&#31181;&#21629;&#20196;&#12290;&#36890;&#24120;&#65292;&#20174;0&#24320;&#22987;&#36882;&#22686;&#65292;&#30456;&#21516;&#35774;&#22791;&#39537;&#21160;&#31243;&#24207;&#19978;&#21487;&#20197;&#37325;&#22797;&#20351;&#29992;&#35813;&#20540;&#12290;&#20363;&#22914;&#65292;&#35835;&#21462;&#21644;&#20889;&#20837;&#21629;&#20196;&#20013;&#20351;&#29992;&#20102;&#30456;&#21516;&#30340;&#22522;&#25968;&#65292;&#35774;&#22791;&#39537;&#21160;&#31243;&#24207;&#20063;&#33021;&#20998;&#36776;&#20986;&#26469;&#65292;&#21407;&#22240;&#22312;&#20110;&#35774;&#22791;&#39537;&#21160;&#31243;&#24207;&#21306;&#20998;&#21629;&#20196;&#26102;&#20351;&#29992;switch&#65292;&#19988;&#30452;&#25509;&#20351;&#29992;&#21629;&#20196;&#21464;&#37327;cmd&#20540;&#12290;&#21019;&#24314;&#21629;&#20196;&#30340;&#23439;&#29983;&#25104;&#30340;&#20540;&#30001;&#22810;&#20010;&#22495;&#32452;&#21512;&#32780;&#25104;&#65292;&#25152;&#20197;&#21363;&#20351;&#26159;&#30456;&#21516;&#30340;&#22522;&#25968;&#65292;&#20063;&#20250;&#21028;&#26029;&#20026;&#19981;&#21516;&#30340;&#21629;&#20196;&#12290;&#35774;&#22791;&#39537;&#21160;&#31243;&#24207;&#24819;&#35201;&#20174;&#21629;&#20196;&#20013;&#33719;&#21462;&#35813;&#22522;&#25968;&#65292;&#23601;&#20351;&#29992;&#23439;_IOC_NR (cmd)&#12290;&#36890;&#24120;&#65292;switch &#20013;&#30340; case &#20540;&#20351;&#29992;&#30340;&#26159;&#21629;&#20196;&#30340;&#26412;&#36523;&#12290;
</p>
<p>
size&#26159;&#21464;&#37327;&#31867;&#22411;&#65292;&#21464;&#37327;&#31867;&#22411;&#20351;&#29992; arg &#21464;&#37327;&#25351;&#23450;&#20256;&#36865;&#30340;&#25968;&#25454;&#22823;&#23567;&#65292;&#20294;&#26159;&#19981;&#30452;&#25509;&#20195;&#20837;&#36755;&#20837;&#65292;&#32780;&#26159;&#20195;&#20837;&#21464;&#37327;&#25110;&#32773;&#26159;&#21464;&#37327;&#30340;&#31867;&#22411;&#65292;&#21407;&#22240;&#26159;&#22312;&#20351;&#29992;&#23439;&#21019;&#24314;&#21629;&#20196;&#65292;&#24050;&#32463;&#21253;&#21547;&#20102;sizeof&#32534;&#35793;&#21629;&#20196;&#12290;&#35774;&#22791;&#39537;&#21160;&#31243;&#24207;&#24819;&#35201;&#20174;&#20256;&#36865;&#30340;&#21629;&#20196;&#33719;&#21462;&#30456;&#24212;&#30340;&#20540;&#65292;&#23601;&#35201;&#20351;&#29992;&#23439;_IOC_SIZE(cmd)&#12290;
</p>
<p>
&#20960;&#20010;&#31034;&#20363;&#22914;&#19979;&#65292;_IO&#21482;&#29992;&#26469;&#20256;&#36882;&#21629;&#20196;&#65292;&#32780;&#27809;&#26377;&#32780;&#22806;&#30340;&#21442;&#25968;&#65292;_IOR&#29992;&#26469;&#20256;&#36882;&#21482;&#35835;&#30340;&#21442;&#25968;&#65292;_IOW&#29992;&#26469;&#20256;&#36882;&#21482;&#20889;&#30340;&#21442;&#25968;&#65292;_IOWR&#20256;&#36882;&#35835;&#20889;&#30340;&#21442;&#25968;&#65292;&#26041;&#21521;&#22343;&#26159;&#21442;&#32771;&#29992;&#25143;&#31354;&#38388;&#65292;&#20063;&#21363;&#35835;&#26159;&#35835;&#21462;&#35774;&#22791;&#20869;&#23481;&#12290;
</p><pre class="programlisting">
#define AGPIOC_ACQUIRE    _IO  (AGPIOC_BASE, 1)
#define AGPIOC_INFO       _IOR (AGPIOC_BASE, 0, struct agp_info*)
#define AGPIOC_SETUP      _IOW (AGPIOC_BASE, 3, struct agp_setup*)
#define AGPIOC_ALLOCATE   _IOWR(AGPIOC_BASE, 6, struct agp_allocate*)
</pre><p>
</p>
</div>
</div>
</div>
<div class="sect2" title="21.5. &#38459;&#22622;I/O"><div class="titlepage"><div><div><h3 class="title"><a name="idp81820268"></a>21.5. &#38459;&#22622;I/O</h3></div></div></div>
&#26377;&#20123;&#26102;&#20505;&#65292;&#19968;&#20010;&#31995;&#32479;&#35843;&#29992;&#21487;&#33021;&#26080;&#27861;&#39532;&#19978;&#21462;&#21040;&#25110;&#32773;&#36865;&#20986;&#25968;&#25454;&#65306;&#19968;&#20010;&#28201;&#24230;&#37319;&#38598;&#22120;&#22914;&#26524;&#27809;&#26377;&#37319;&#29992;&#20013;&#26029;&#25110;&#32773;&#36718;&#35810;&#30340;&#31574;&#30053;&#65292;&#32780;&#26159;&#22312;&#29992;&#25143;&#21457;&#20986;&#35831;&#27714;&#26102;&#25165;&#36827;&#34892;&#37319;&#38598;&#65292;&#24182;&#22312;&#19968;&#23450;&#30340;&#26102;&#38388;&#21518;&#36820;&#22238;&#32467;&#26524;&#12290;&#22914;&#26524;&#29992;&#25143;&#31243;&#24207;&#24076;&#26395;&#35843;&#29992;read&#25110;write&#24182;&#19988;&#22312;&#35843;&#29992;&#36820;&#22238;&#26102;&#33021;&#30830;&#20445;&#24471;&#21040;&#24819;&#35201;&#30340;&#32467;&#26524;&#65292;&#37027;&#20040;&#29992;&#25143;&#31243;&#24207;&#24212;&#35813;&#38459;&#22622;&#65292;&#30452;&#21040;&#26377;&#32467;&#26524;&#25110;&#32773;&#38169;&#35823;&#21518;&#36820;&#22238;&#65292;&#29992;&#25143;&#31243;&#24207;&#30340;&#38459;&#22622;&#20307;&#29616;&#20026;&#36827;&#31243;&#30340;&#30561;&#30496;&#65292;&#20063;&#21363;&#31995;&#32479;&#35843;&#29992;&#20013;&#23558;&#36827;&#31243;&#29366;&#24577;&#20999;&#25442;&#20026;&#30561;&#30496;&#24577;&#12290;
<div class="sect3" title="21.5.1. &#30561;&#30496;&#21644;&#31561;&#24453;&#38431;&#21015;"><div class="titlepage"><div><div><h4 class="title"><a name="idp81821396"></a>21.5.1. &#30561;&#30496;&#21644;&#31561;&#24453;&#38431;&#21015;</h4></div></div></div>
<p>&#19968;&#20010;&#36827;&#31243;&#30340;&#30561;&#30496;&#24847;&#21619;&#30528;&#23427;&#30340;&#36827;&#31243;&#29366;&#24577;&#26631;&#35782;&#31526;&#34987;&#32622;&#20026;&#30561;&#30496;&#65292;&#24182;&#19988;&#20174;&#35843;&#24230;&#22120;&#30340;&#36816;&#34892;&#38431;&#21015;&#20013;&#21435;&#38500;&#65292;&#30452;&#21040;&#26576;&#20123;&#20107;&#20214;&#30340;&#21457;&#29983;&#23558;&#23427;&#20204;&#20174;&#30561;&#30496;&#24577;&#20013;&#21796;&#37266;&#65292;&#22312;&#30561;&#30496;&#24577;&#65292;&#35813;&#36827;&#31243;&#23558;&#19981;&#34987;CPU&#35843;&#24230;&#65292;&#24182;&#19988;&#65292;&#22914;&#26524;&#19981;&#34987;&#21796;&#37266;&#65292;&#23427;&#23558;&#27704;&#36828;&#19981;&#34987;&#36816;&#34892;&#12290;</p>
<p>
&#22312;&#39537;&#21160;&#20013;&#24456;&#23481;&#26131;&#36890;&#36807;&#35843;&#24230;&#31561;&#26041;&#24335;&#20351;&#24403;&#21069;&#36827;&#31243;&#30561;&#30496;&#65292;&#20294;&#26159;&#36827;&#31243;&#24182;&#19981;&#26159;&#22312;&#20219;&#20309;&#26102;&#20505;&#37117;&#26159;&#21487;&#20197;&#36827;&#20837;&#30561;&#30496;&#29366;&#24577;&#30340;&#12290;
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">&#31532;&#19968;&#26465;&#35268;&#21017;&#26159;&#65306;&#24403;&#36816;&#34892;&#22312;&#21407;&#23376;&#19978;&#19979;&#25991;&#26102;&#19981;&#33021;&#30561;&#30496;&#65306;&#27604;&#22914;&#25345;&#26377;&#33258;&#26059;&#38145;&#65292;&#39034;&#24207;&#38145;&#25110;&#32773;RCU&#38145;&#12290;</li><li class="listitem">&#22312;&#20851;&#20013;&#26029;&#20013;&#20063;&#19981;&#33021;&#30561;&#30496;&#12290;</li><li class="listitem">&#25345;&#26377;&#20449;&#21495;&#37327;&#26102;&#30561;&#30496;&#26159;&#21512;&#27861;&#30340;&#65292;&#20294;&#23427;&#25152;&#25345;&#26377;&#30340;&#20449;&#21495;&#37327;&#19981;&#24212;&#35813;&#24433;&#21709;&#21796;&#37266;&#23427;&#30340;&#36827;&#31243;&#30340;&#25191;&#34892;&#12290;&#21478;&#22806;&#20219;&#20309;&#31561;&#24453;&#35813;&#20449;&#21495;&#37327;&#30340;&#32447;&#31243;&#20063;&#23558;&#30561;&#30496;&#65292;&#22240;&#27492;&#21457;&#29983;&#22312;&#25345;&#26377;&#20449;&#21495;&#37327;&#26102;&#30340;&#20219;&#20309;&#30561;&#30496;&#37117;&#24212;&#24403;&#30701;&#26242;&#12290;</li><li class="listitem">&#36827;&#31243;&#37266;&#26469;&#21518;&#24212;&#35813;&#36827;&#34892;&#31561;&#24453;&#20107;&#20214;&#30340;&#26816;&#26597;&#65292;&#20197;&#30830;&#20445;&#23427;&#30830;&#23454;&#21457;&#29983;&#20102;&#12290;</li></ul></div><p>
&#31561;&#24453;&#38431;&#21015;&#21487;&#20197;&#23436;&#25104;&#36827;&#31243;&#30340;&#30561;&#30496;&#24182;&#22312;&#20107;&#20214;&#21457;&#29983;&#26102;&#21796;&#37266;&#23427;&#65292;&#23427;&#30001;&#19968;&#20010;&#36827;&#31243;&#21015;&#34920;&#32452;&#25104;&#12290;&#22312; Linux &#20013;, &#19968;&#20010;&#31561;&#24453;&#38431;&#21015;&#30001;&#19968;&#20010;"&#31561;&#24453;&#38431;&#21015;&#22836;"&#26469;&#31649;&#29702;&#65306;
</p><pre class="programlisting">
linux/wait.h
struct __wait_queue_head {
	spinlock_t lock;
	struct list_head task_list;
};
typedef struct __wait_queue_head wait_queue_head_t;
</pre><p>
</p>
<p>&#30001;&#20110;&#30561;&#30496;&#30340;&#36827;&#31243;&#24456;&#26377;&#21487;&#33021;&#22312;&#31561;&#24453;&#19968;&#20010;&#20013;&#26029;&#26469;&#25913;&#21464;&#26576;&#20123;&#29366;&#24577;&#65292;&#25110;&#36890;&#21578;&#26576;&#20123;&#20107;&#20214;&#30340;&#21457;&#29983;&#65292;&#37027;&#20040;&#20013;&#26029;&#19978;&#19979;&#25991;&#24456;&#26377;&#21487;&#33021;&#20462;&#25913;&#35813;&#31561;&#24453;&#38431;&#21015;&#65292;&#25152;&#20197;&#35813;&#32467;&#26500;&#20013;&#30340;&#33258;&#26059;&#38145;lock&#24517;&#39035;&#32771;&#34385;&#31105;&#20013;&#26029;&#65292;&#20063;&#21363;&#20351;&#29992;spin_lock_irqsave&#12290;</p>
<p>
&#38431;&#21015;&#20013;&#30340;&#25104;&#21592;&#26159;&#22914;&#19979;&#25968;&#25454;&#32467;&#26500;&#30340;&#23454;&#20363;&#65292;&#23427;&#20204;&#32452;&#25104;&#20102;&#19968;&#20010;&#21452;&#21521;&#38142;&#34920;&#65306;
</p><div class="figure"><a name="idp81825764"></a><p class="title"><b>&#22270; 119. &#31561;&#24453;&#38431;&#21015;</b></p><div class="figure-contents"><div><img src="images/device/waitqueue.gif" alt="&#31561;&#24453;&#38431;&#21015;"></div></div></div><p><br class="figure-break">
</p><pre class="programlisting">
typedef struct __wait_queue wait_queue_t;
typedef int (*wait_queue_func_t)(wait_queue_t *wait, unsigned mode, int flags, void *key);
int default_wake_function(wait_queue_t *wait, unsigned mode, int flags, void *key);

struct __wait_queue {
	unsigned int flags;
#define WQ_FLAG_EXCLUSIVE	0x01
	void *private;
	wait_queue_func_t func;
	struct list_head task_list;
};
</pre><p>
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">flags&#30340;&#20540;&#25110;&#32773;&#20026;0&#65292;&#25110;&#32773;&#20026;WQ_FLAG_EXCLUSIVE&#12290;&#21518;&#32773;&#34920;&#31034;&#31561;&#24453;&#36827;&#31243;&#24819;&#35201;&#34987;&#29420;&#21344;&#22320;&#21796;&#37266;&#12290;</li><li class="listitem">private&#25351;&#38024;&#25351;&#21521;&#31561;&#24453;&#36827;&#31243;&#30340;task_struct&#23454;&#20363;&#12290;&#35813;&#21464;&#37327;&#26412;&#36136;&#19978;&#21487;&#20197;&#25351;&#21521;&#20219;&#20309;&#31169;&#26377;&#25968;&#25454;&#65292;&#21333;&#20869;&#26680;&#21482;&#26377;&#24456;&#23569;&#24773;&#20917;&#19979;&#25165;&#36825;&#20040;&#29992;&#12290;</li><li class="listitem">&#35843;&#29992;func&#65292;&#21796;&#37266;&#31561;&#24453;&#36827;&#31243;&#12290;</li><li class="listitem">task_list&#29992;&#20316;&#19968;&#20010;&#38142;&#34920;&#20803;&#32032;&#65292;&#23558;wait_queue_t&#23454;&#20363;&#25918;&#32622;&#21040;&#31561;&#24453;&#38431;&#21015;&#20013;&#12290;</li></ul></div><p>
&#20026;&#20102;&#20351;&#29992;&#31561;&#24453;&#38431;&#21015;&#65292;&#36890;&#24120;&#38656;&#35201;&#22914;&#19979;&#27493;&#39588;&#65306;&#39318;&#20808;&#24212;&#35813;&#24314;&#31435;&#19968;&#20010;&#31561;&#24453;&#38431;&#21015;&#22836;&#65306;
</p><pre class="programlisting">
DECLARE_WAIT_QUEUE_HEAD(name);
</pre><p>
&#21478;&#22806;&#19968;&#31181;&#26041;&#27861;&#26159;&#38745;&#24577;&#22768;&#26126;&#65292;&#24182;&#26174;&#24335;&#21021;&#22987;&#21270;&#23427;&#65306;
</p><pre class="programlisting">
wait_queue_head_t wait_queue;

init_waitqueue_head(&amp;wait_queue);
</pre><p>
&#25509;&#30528;&#20026;&#20351;&#24471;&#24403;&#21069;&#36827;&#31243;&#36827;&#20837;&#30561;&#30496;&#65292;&#24182;&#31561;&#24453;&#26576;&#19968;&#20107;&#20214;&#30340;&#21457;&#29983;&#65292;&#38656;&#35201;&#23558;&#23427;&#21152;&#20837;&#21040;&#31561;&#24453;&#38431;&#21015;&#20013;&#65292;&#20869;&#26680;&#25552;&#20379;&#20102;&#20197;&#19979;&#20989;&#25968;&#23436;&#25104;&#27492;&#21151;&#33021;&#65306;
</p><pre class="programlisting">
wait_event(queue, condition);
wait_event_interruptible(queue, condition);
wait_event_timeout(queue, condition, timeout);
wait_event_interruptible_timeout(queue, condition, timeout);
</pre><p>
&#22312;&#25152;&#26377;&#30340;&#24418;&#24335;&#20013;&#65292;&#21442;&#25968;queue&#26159;&#35201;&#31561;&#24453;&#30340;&#38431;&#21015;&#22836;&#65292;&#30001;&#20110;&#36825;&#20960;&#20010;&#20989;&#25968;&#37117;&#26159;&#36890;&#36807;&#23439;&#23454;&#29616;&#30340;&#65292;&#36825;&#37324;&#30340;&#38431;&#21015;&#22836;&#19981;&#26159;&#25351;&#38024;&#31867;&#22411;&#65292;&#32780;&#26159;&#23545;&#23427;&#30340;&#30452;&#25509;&#20351;&#29992;&#12290;&#26465;&#20214;condition&#26159;&#19968;&#20010;&#34987;&#36825;&#20123;&#23439;&#22312;&#30561;&#30496;&#21069;&#21518;&#25152;&#35201;&#27714;&#20540;&#30340;&#20219;&#24847;&#30340;&#24067;&#23572;&#34920;&#36798;&#24335;&#12290;&#30452;&#21040;&#26465;&#20214;&#27714;&#20540;&#20026;&#30495;&#65292;&#36827;&#31243;&#25345;&#32493;&#30561;&#30496;&#12290;
</p>
<p>
&#36890;&#36807;wait_event&#36827;&#20837;&#30561;&#30496;&#30340;&#36827;&#31243;&#26159;&#19981;&#21487;&#20013;&#26029;&#30340;&#65292;&#27492;&#26102;&#36827;&#31243;&#30340;state&#25104;&#21592;&#32622;TASK_UNINTERRUPTIBLE&#20301;&#12290;&#20294;&#26159;&#23427;&#24212;&#35813;&#34987;wait_event_interruptible&#25152;&#26367;&#20195;&#65292;&#23427;&#21487;&#20197;&#34987;&#20449;&#21495;&#20013;&#26029;&#65292;&#36825;&#24847;&#21619;&#30528;&#29992;&#25143;&#31243;&#24207;&#22312;&#31561;&#24453;&#30340;&#36807;&#31243;&#20013;&#21487;&#20197;&#36890;&#36807;&#20449;&#21495;&#20013;&#26029;&#31243;&#24207;&#30340;&#25191;&#34892;&#12290;&#19968;&#20010;&#19981;&#33021;&#34987;&#20449;&#21495;&#20013;&#26029;&#30340;&#31243;&#24207;&#24456;&#23481;&#26131;&#28608;&#24594;&#20351;&#29992;&#23427;&#30340;&#29992;&#25143;&#12290;wait_event&#20989;&#25968;&#27809;&#26377;&#36820;&#22238;&#20540;&#65292;&#32780;wait_event_interruptible&#26377;&#19968;&#20010;&#21487;&#20197;&#35782;&#21035;&#30561;&#30496;&#34987;&#26576;&#20123;&#20449;&#21495;&#25171;&#26029;&#30340;&#36820;&#22238;&#20540;-ERESTARTSYS&#12290;
</p>
<p>
wait_event_timeout&#21644;wait_event_interruptible_timeout&#24847;&#21619;&#30528;&#31561;&#24453;&#19968;&#27573;&#26102;&#38388;&#65292;&#23427;&#20197;&#28404;&#31572;&#25968;&#34920;&#31034;&#65292;&#22312;&#36825;&#20010;&#26102;&#38388;&#26399;&#38388;&#36229;&#26102;&#21518;&#65292;&#35813;&#23439;&#36820;&#22238;&#19968;&#20010;0&#20540;&#65292;&#32780;&#19981;&#31649;&#20107;&#20214;&#26159;&#21542;&#21457;&#29983;&#12290;
</p>
<p>
&#26368;&#21518;&#65292;&#25105;&#20204;&#38656;&#35201;&#22312;&#20854;&#20182;&#36827;&#31243;&#25110;&#32773;&#32447;&#31243;(&#20063;&#21487;&#33021;&#26159;&#20013;&#26029;)&#20013;&#36890;&#36807;&#30456;&#23545;&#24212;&#30340;&#20989;&#25968;&#65292;&#21796;&#37266;&#36825;&#20123;&#38431;&#21015;&#19978;&#27785;&#30561;&#30340;&#36827;&#31243;&#12290;&#20869;&#26680;&#25552;&#20379;&#20102;&#22914;&#19979;&#20989;&#25968;&#65306;
</p><pre class="programlisting">
void wake_up(wait_queue_head_t *queue);
void wake_up_interruptible(wait_queue_head_t *queue);
</pre><p>
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">wake_up&#21796;&#37266;&#25152;&#26377;&#30340;&#22312;&#32473;&#23450;&#38431;&#21015;&#19978;&#31561;&#24453;&#30340;&#36827;&#31243;&#12290;</li><li class="listitem">wake_up_interruptible&#21796;&#37266;&#25152;&#26377;&#30340;&#22312;&#32473;&#23450;&#38431;&#21015;&#19978;&#31561;&#24453;&#30340;&#21487;&#20013;&#26029;&#30340;&#30561;&#30496;&#30340;&#36827;&#31243;&#12290;</li></ul></div><p>
&#23613;&#31649;wake_up&#21487;&#20197;&#26367;&#20195;wake_up_interruptible&#30340;&#21151;&#33021;&#65292;&#20294;&#26159;&#23427;&#20204;&#24212;&#35813;&#20351;&#29992;&#19982;wait_event&#23545;&#24212;&#30340;&#20989;&#25968;&#12290;&#36890;&#36807;&#31561;&#24453;&#38431;&#21015;&#23454;&#29616;&#19968;&#20010;&#31649;&#36947;&#30340;&#35835;&#20889;&#26159;&#21487;&#34892;&#30340;&#65292;&#20869;&#26680;&#20013;fs/pipe.c&#23545;&#31649;&#36947;&#30340;&#23454;&#29616;&#23601;&#26159;&#22522;&#20110;&#31561;&#24453;&#38431;&#21015;&#23454;&#29616;&#30340;&#65292;&#23613;&#31649;&#23427;&#26377;&#20123;&#22797;&#26434;&#12290;&#21478;&#22806;&#23545;&#20110;&#35774;&#22791;&#39537;&#21160;&#26469;&#35828;&#65292;&#19968;&#20010;&#28201;&#24230;&#37319;&#38598;&#22120;&#22312;&#25910;&#21040;&#35835;&#25968;&#25454;&#35831;&#27714;&#21518;&#65292;&#35813;&#36827;&#31243;&#34987;&#25918;&#20837;&#31561;&#24453;&#38431;&#21015;&#65292;&#28982;&#21518;&#21796;&#37266;&#23427;&#30340;&#24067;&#23572;&#21464;&#37327;&#22312;&#35813;&#35774;&#22791;&#23545;&#24212;&#30340;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#20013;&#34987;&#32622;&#20026;&#30495;&#12290;</p>
<div class="note" title="&#27880;&#24847;" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#27880;&#24847;</h3>wake_up_interruptible&#30340;&#35843;&#29992;&#21487;&#33021;&#20351;&#22810;&#20010;&#20010;&#30561;&#30496;&#36827;&#31243;&#37266;&#26469;&#65292;&#32780;&#23427;&#20204;&#21448;&#26159;&#29420;&#21344;&#35775;&#38382;&#26576;&#19968;&#36164;&#28304;&#65292;&#22914;&#20309;&#20351;&#20165;&#19968;&#20010;&#36827;&#31243;&#30475;&#21040;&#36825;&#20010;&#30495;&#20540;&#65292;&#36825;&#23601;&#26159;WQ_FLAG_EXCLUSIVE&#30340;&#20316;&#29992;&#65292;&#20854;&#20182;&#36827;&#31243;&#23558;&#32487;&#32493;&#30561;&#30496;&#12290;</div>
<div class="sect4" title="21.5.1.1. &#31561;&#24453;&#38431;&#21015;&#21407;&#29702;"><div class="titlepage"><div><div><h5 class="title"><a name="idp81834284"></a>21.5.1.1. &#31561;&#24453;&#38431;&#21015;&#21407;&#29702;</h5></div></div></div>
wait_event&#20989;&#25968;&#30340;&#26680;&#24515;&#23454;&#29616;&#22914;&#19979;&#65306;
<pre class="programlisting">
#define __wait_event(wq, condition) 					\
do {									\
	DEFINE_WAIT(__wait);						\
									\
	for (;;) {							\
		prepare_to_wait(&amp;wq, &amp;__wait, TASK_UNINTERRUPTIBLE);	\
		if (condition)						\
			break;						\
		schedule();						\
	}								\
	finish_wait(&amp;wq, &amp;__wait);					\
} while (0)
</pre>
<div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">DEFINE_WAIT&#27880;&#20876;&#20102;&#19968;&#20010;&#21517;&#20026;__wait&#30340;&#38431;&#21015;&#20803;&#32032;&#65292;&#20854;&#20013;&#21253;&#21547;&#19968;&#20010;&#21517;&#20026;autoremove_wake_function&#30340;&#38057;&#23376;&#20989;&#25968;&#65292;&#23427;&#29992;&#26469;&#21796;&#37266;&#30340;&#36827;&#31243;&#24182;&#23558;&#35813;&#20803;&#32032;&#20174;&#31561;&#24453;&#38431;&#21015;&#20013;&#21024;&#38500;&#12290;</li><li class="listitem">prepare_to_wait&#29992;&#26469;&#23558;&#38431;&#21015;&#20803;&#32032;&#35745;&#20837;&#31561;&#24453;&#38431;&#21015;&#65292;&#24182;&#25351;&#23450;&#36827;&#31243;&#30340;state&#29366;&#24577;&#26631;&#35782;&#20026;TASK_UNINTERRUPTIBLE&#65292;&#24403;&#28982;&#23545;&#24212;wait_event_interruptible&#65292;&#21017;&#26159;TASK_INTERRUPTIBLE&#12290;</li><li class="listitem">for&#26080;&#38480;&#24490;&#29615;&#20915;&#23450;&#20102;&#24403;&#21069;&#36827;&#31243;&#22312;&#19981;&#28385;&#36275;condition&#26102;&#24635;&#26159;&#34987;&#35843;&#24230;&#65292;&#20854;&#20182;&#36827;&#31243;&#23558;&#26367;&#25442;&#35813;&#36827;&#31243;&#25191;&#34892;&#12290;&#24182;&#19988;&#36825;&#20010;&#24490;&#29615;&#23454;&#38469;&#19978;&#27704;&#36828;&#21482;&#25191;&#34892;&#19968;&#27425;&#65292;&#24182;&#19988;&#21482;&#22312;&#21796;&#37266;&#26102;&#30452;&#25509;</li><li class="listitem">&#22312;&#28385;&#36275;&#26465;&#20214;&#26102;&#65292;finish_wait&#23558;&#36827;&#31243;&#29366;&#24577;&#35774;&#32622;&#20026;TASK_RUNNING&#65292;&#24182;&#20174;&#31561;&#24453;&#38431;&#21015;&#20013;&#23558;&#20854;&#31227;&#38500;&#12290;</li></ul></div>
&#38656;&#35201;&#20180;&#32454;&#32771;&#34385;&#30340;&#26159;for&#24490;&#29615;&#30340;&#25191;&#34892;&#65292;&#26174;&#28982;&#23427;&#21487;&#33021;&#25191;&#34892;&#19968;&#27425;&#65292;&#20063;&#21487;&#33021;&#26159;&#22810;&#27425;&#65292;&#24403;condition&#19981;&#28385;&#36275;&#26102;&#65292;&#23558;&#20250;&#20135;&#29983;&#35843;&#24230;&#65292;&#32780;&#22312;&#27492;&#34987;&#35843;&#24230;&#26102;&#65292;&#23558;&#25191;&#34892;for&#30340;&#19979;&#19968;&#27425;&#24490;&#29615;&#65292;&#37027;&#20040;prepare_to_wait&#19981;&#26159;&#27599;&#27425;&#37117;&#28155;&#21152;&#19968;&#27425;__wait&#20803;&#32032;&#21527;&#65311;&#26597;&#30475;prepare_to_wait&#20195;&#30721;&#21487;&#20197;&#21457;&#29616;&#65292;&#21482;&#26377;wait-&gt;task_list&#25351;&#21521;&#30340;&#38142;&#34920;&#20026;&#31354;&#26102;&#65292;&#20063;&#21363;__wait&#20803;&#32032;&#27809;&#26377;&#21152;&#20837;&#20219;&#20309;&#20854;&#20182;&#31561;&#24453;&#38431;&#21015;&#26102;&#25165;&#20250;&#25226;&#23427;&#21152;&#20837;&#21040;&#24403;&#21069;&#31561;&#24453;&#38431;&#21015;&#20013;&#65292;&#36825;&#20063;&#34920;&#26126;&#19968;&#20010;&#31561;&#24453;&#38431;&#21015;&#20803;&#32032;&#21482;&#33021;&#21152;&#20837;&#19968;&#20010;&#31561;&#24453;&#38431;&#21015;&#12290;
<pre class="programlisting">
void prepare_to_wait(wait_queue_head_t *q, wait_queue_t *wait, int state)
{
	unsigned long flags;

	wait-&gt;flags &amp;= ~WQ_FLAG_EXCLUSIVE;
	spin_lock_irqsave(&amp;q-&gt;lock, flags);
	if (list_empty(&amp;wait-&gt;task_list))
		__add_wait_queue(q, wait);
	set_current_state(state);
	spin_unlock_irqrestore(&amp;q-&gt;lock, flags);
}
</pre>
&#21796;&#37266;&#19968;&#20010;&#31561;&#24453;&#38431;&#21015;&#26159;&#36890;&#36807;wake_up&#31995;&#21015;&#20989;&#25968;&#23436;&#25104;&#30340;&#65292;&#19968;&#20123;&#21015;&#30340;&#21796;&#37266;&#20989;&#25968;&#37117;&#26377;&#23545;&#24212;&#30340;&#21487;&#20013;&#26029;&#24418;&#24335;&#65306;
<pre class="programlisting">
#define wake_up(x)			__wake_up(x, TASK_NORMAL, 1, NULL)
#define wake_up_nr(x, nr)		__wake_up(x, TASK_NORMAL, nr, NULL)
#define wake_up_all(x)			__wake_up(x, TASK_NORMAL, 0, NULL)
#define wake_up_locked(x)		__wake_up_locked((x), TASK_NORMAL)
</pre>
&#36825;&#37324;&#20998;&#26512;&#23427;&#20204;&#30340;&#26680;&#24515;&#23454;&#29616;&#65306;
<pre class="programlisting">
kernel/sched.c
void __wake_up(wait_queue_head_t *q, unsigned int mode,
			int nr_exclusive, void *key)
{
	unsigned long flags;

	spin_lock_irqsave(&amp;q-&gt;lock, flags);
	__wake_up_common(q, mode, nr_exclusive, 0, key);
	spin_unlock_irqrestore(&amp;q-&gt;lock, flags);
}
</pre>
__wake_up&#39318;&#20808;&#33719;&#21462;&#20102;&#33258;&#26059;&#38145;&#65292;&#28982;&#21518;&#35843;&#29992;__wake_up_common&#12290;&#35813;&#20989;&#25968;&#36890;&#36807;list_for_each_entry_safe&#36941;&#21382;&#31561;&#24453;&#38431;&#21015;&#65292;&#22914;&#26524;&#27809;&#26377;&#35774;&#32622;&#29420;&#21344;&#26631;&#24535;&#65292;&#21017;&#26681;&#25454;mode&#21796;&#37266;&#27599;&#20010;&#30561;&#30496;&#30340;&#36827;&#31243;&#12290;nr_exclusiv&#34920;&#31034;&#38656;&#35201;&#21796;&#37266;&#30340;&#35774;&#32622;&#20102;&#29420;&#21344;&#26631;&#24535;&#36827;&#31243;&#30340;&#25968;&#30446;&#65292;&#23427;&#22312;wake_up&#20013;&#35774;&#32622;&#20026;1&#65292;&#34920;&#26126;&#24403;&#22788;&#29702;&#20102;&#19968;&#20010;&#21547;&#26377;WQ_FLAG_EXCLUSIVE&#26631;&#24535;&#36827;&#31243;&#21518;&#65292;&#23558;&#19981;&#20877;&#22788;&#29702;&#65292;&#29420;&#21344;&#26631;&#24535;&#30340;&#24847;&#20041;&#20063;&#22312;&#20110;&#27492;&#12290;&#21478;&#22806;&#30475;&#21040;&#36825;&#37324;&#36890;&#36807;func&#25351;&#38024;&#25191;&#34892;&#20102;&#30495;&#27491;&#30340;&#21796;&#37266;&#20989;&#25968;&#12290;
<pre class="programlisting">
kernel/sched.c
static void __wake_up_common(wait_queue_head_t *q, unsigned int mode,
			int nr_exclusive, int wake_flags, void *key)
{
	wait_queue_t *curr, *next;

	list_for_each_entry_safe(curr, next, &amp;q-&gt;task_list, task_list) {
		unsigned flags = curr-&gt;flags;

		if (curr-&gt;func(curr, mode, wake_flags, key) &amp;&amp;
				(flags &amp; WQ_FLAG_EXCLUSIVE) &amp;&amp; !--nr_exclusive)
			break;
	}
}
</pre>
&#22914;&#26524;&#21547;&#26377;&#29420;&#21344;&#26631;&#24535;&#30340;&#36827;&#31243;&#24182;&#19981;&#20301;&#20110;&#38431;&#21015;&#23614;&#37096;&#65292;&#23558;&#23548;&#33268;&#20854;&#21518;&#30340;&#19981;&#21547;&#26377;&#35813;&#26631;&#24535;&#30340;&#36827;&#31243;&#26080;&#27861;&#25191;&#34892;&#65292;prepare_to_wait_exclusive&#35299;&#20915;&#20102;&#35813;&#38382;&#39064;&#65292;&#23427;&#24635;&#26159;&#23558;&#21547;&#26377;&#29420;&#21344;&#26631;&#24535;&#30340;&#36827;&#31243;&#25554;&#20837;&#21040;&#38431;&#21015;&#23614;&#37096;&#65292;&#35813;&#20989;&#25968;&#34987;wait_event_interruptible_exclusive&#23439;&#35843;&#29992;&#12290;
</div>
</div>
<div class="sect3" title="21.5.2. &#38459;&#22622;&#21644;&#38750;&#38459;&#22622;"><div class="titlepage"><div><div><h4 class="title"><a name="idp81841100"></a>21.5.2. &#38459;&#22622;&#21644;&#38750;&#38459;&#22622;</h4></div></div></div>
&#23613;&#31649;&#31561;&#24453;&#38431;&#21015;&#21487;&#20197;&#23454;&#29616;&#38459;&#22622;&#25191;&#34892;&#65292;&#20294;&#26159;&#29992;&#25143;&#21487;&#20197;&#36890;&#36807;&#25551;&#36848;&#31526;&#23646;&#24615;O_NONBLOCK&#26469;&#26126;&#30830;&#25351;&#23450;&#19981;&#38459;&#22622;&#65292;&#25152;&#20197;&#23545;&#24212;&#30340;&#39537;&#21160;&#31243;&#24207;&#20063;&#24212;&#35813;&#28385;&#36275;&#36825;&#19968;&#34892;&#20026;&#65292;&#35813;&#26631;&#24535;&#36890;&#36807;filp&#20013;&#30340;f_flags&#26631;&#24535;&#20301;O_NONBLOCK&#26469;&#25351;&#31034;&#12290;&#38459;&#22622;&#25805;&#20316;&#26159;&#32570;&#30465;&#30340;,&#38500;&#38750;&#25351;&#23450;&#20102;O_NONBLOCK&#65306;
<div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">&#22914;&#26524;&#19968;&#20010;&#36827;&#31243;&#35843;&#29992; read &#20294;&#26159;&#27809;&#26377;&#25968;&#25454;&#21487;&#29992;(&#23578;&#26410;), &#36825;&#20010;&#36827;&#31243;&#24517;&#39035;&#38459;&#22622;. &#36825;&#20010;&#36827;&#31243;&#22312;&#26377;&#25968;&#25454;&#36798;&#21040;&#26102;&#34987;&#31435;&#21051;&#21796;
&#37266;, &#24182;&#19988;&#37027;&#20010;&#25968;&#25454;&#34987;&#36820;&#22238;&#32473;&#35843;&#29992;&#32773;, &#21363;&#20415;&#23567;&#20110;&#22312;&#32473;&#26041;&#27861;&#30340; count &#21442;&#25968;&#20013;&#35831;&#27714;&#30340;&#25968;&#37327;&#12290;</li><li class="listitem">&#22914;&#26524;&#19968;&#20010;&#36827;&#31243;&#35843;&#29992; write &#24182;&#19988;&#22312;&#32531;&#20914;&#20013;&#27809;&#26377;&#31354;&#38388;, &#36825;&#20010;&#36827;&#31243;&#24517;&#39035;&#38459;&#22622;, &#24182;&#19988;&#23427;&#24517;&#39035;&#22312;&#19968;&#20010;&#19982;&#29992;&#20316; read &#30340;&#19981;&#21516;&#30340;&#31561;&#24453;&#38431;&#21015;&#20013;&#12290;&#24403;&#19968;&#20123;&#25968;&#25454;&#34987;&#20889;&#20837;&#30828;&#20214;&#35774;&#22791;, &#24182;&#19988;&#22312;&#36755;&#20986;&#32531;&#20914;&#20013;&#30340;&#31354;&#38388;&#21464;&#31354;&#38386;, &#36825;&#20010;&#36827;&#31243;&#34987;&#21796;&#37266;&#24182;&#19988;&#20889;&#35843;&#29992;&#25104;&#21151;, &#23613;&#31649;&#25968;&#25454;&#21487;&#33021;&#21482;&#34987;&#37096;&#20998;&#20889;&#20837;&#22914;&#26524;&#22312;&#32531;&#20914;&#21482;&#27809;&#26377;&#31354;&#38388;&#32473;&#34987;&#35831;&#27714;&#30340; count &#23383;&#33410;&#12290;</li></ul></div>
<p>
&#36825; 2 &#21477;&#37117;&#20551;&#23450;&#26377;&#36755;&#20837;&#21644;&#36755;&#20986;&#32531;&#20914;; &#23454;&#38469;&#19978;, &#20960;&#20046;&#27599;&#20010;&#35774;&#22791;&#39537;&#21160;&#37117;&#26377;&#12290;&#35201;&#27714;&#26377;&#36755;&#20837;&#32531;&#20914;&#26159;&#20026;&#20102;&#36991;&#20813;&#20002;&#22833;&#21040;&#36798;&#30340;&#25968;&#25454;, &#24403;&#26080;&#20154;&#22312;&#35835;&#26102;&#12290;&#30456;&#21453;, &#25968;&#25454;&#22312;&#20889;&#26102;&#19981;&#33021;&#20002;&#22833;, &#22240;&#20026;&#22914;&#26524;&#31995;&#32479;&#35843;&#29992;&#19981;&#33021;&#25509;&#25910;&#25968;&#25454;&#23383;&#33410;, &#23427;&#20204;&#20445;&#30041;&#22312;&#29992;&#25143;&#31354;&#38388;&#32531;&#20914;&#12290;&#21363;&#20415;&#22914;&#27492;, &#36755;&#20986;&#32531;&#20914;&#20960;&#20046;&#19968;&#30452;&#26377;&#29992;, &#36825;&#21487;&#20197;&#20943;&#23569;&#24212;&#20026;&#31561;&#24453;&#32780;&#36896;&#25104;&#30340;&#36827;&#31243;&#20999;&#25442;&#26102;&#38388;&#25439;&#22833;&#65292;&#21487;&#20174;&#30828;&#20214;&#25380;&#20986;&#26356;&#22810;&#30340;&#24615;&#33021;&#12290;
</p>
<p>
&#19968;&#20010;&#38459;&#22622;&#35835;&#21462;&#30340;&#20363;&#23376;&#22914;&#19979;&#65292;&#39318;&#20808;&#20250;&#27979;&#35797;&#20195;&#34920;&#36164;&#28304;&#30340;&#24067;&#23572;&#37327;&#26159;&#21542;&#20026;&#30495;&#65292;&#22914;&#26524;&#19981;&#26159;&#21017;&#30452;&#25509;&#36820;&#22238;EAGAIN&#65292;&#24403;&#28982;&#36825;&#20063;&#24847;&#21619;&#30528;gen_rtc_irq_data&#20250;&#22312;&#20854;&#20182;&#20107;&#20214;(&#27604;&#22914;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;)&#20013;&#23558;&#34987;&#25913;&#21464;&#12290;&#23545;&#20110;write&#26469;&#35828;&#65292;&#22914;&#26524;&#21487;&#20197;&#25215;&#36733;&#20889;&#20986;&#25968;&#25454;&#30340;&#36164;&#28304;&#19981;&#21487;&#24471;&#65292;&#20063;&#24212;&#35813;&#30452;&#25509;&#36820;&#22238;EAGAIN&#12290;
</p><pre class="programlisting">
drivers/char/genrtc.c
  if (file-&gt;f_flags &amp; O_NONBLOCK &amp;&amp; !gen_rtc_irq_data)
          return -EAGAIN;

  retval = wait_event_interruptible(gen_rtc_wait,
                  (data = xchg(&amp;gen_rtc_irq_data, 0)));
</pre><p>
&#33258;&#28982;&#22320;, O_NONBLOCK &#20063;&#22312; open &#26041;&#27861;&#20013;&#26377;&#24847;&#20041;. &#36825;&#20010;&#21457;&#29983;&#22312;&#24403;&#36825;&#20010;&#35843;&#29992;&#30495;&#27491;&#38459;&#22622;&#38271;&#26102;&#38388;&#26102;; &#20363;&#22914;, &#24403;&#25171;&#24320;(&#20026;&#35835;&#23384;&#21462;)&#19968;&#20010; &#27809;&#26377;&#20889;&#32773;&#30340;(&#23578;&#26080;)FIFO, &#25110;&#32773;&#23384;&#21462;&#19968;&#20010;&#30913;&#30424;&#25991;&#20214;&#20351;&#29992;&#19968;&#20010;&#24748;&#25346;&#38145;. &#24120;&#24120;&#22320;, &#25171;&#24320;&#19968;&#20010;&#35774;&#22791;&#25110;&#32773;&#25104;&#21151;&#25110;&#32773;&#22833;&#36133;, &#27809;&#26377;&#24517;&#35201;&#31561;&#24453;&#22806;&#37096;&#30340;&#20107;&#20214;. &#26377;&#26102;, &#20294;&#26159;, &#25171;&#24320;&#36825;&#20010;&#35774;&#22791;&#38656;&#35201;&#19968;&#20010;&#38271;&#30340;&#21021;&#22987;&#21270;, &#24182;&#19988;&#20320;&#21487;&#33021;&#36873;&#25321;&#22312;&#20320;&#30340; open&#26041;&#27861;&#20013;&#25903;&#25345; O_NONBLOCK , &#36890;&#36807;&#31435;&#21051;&#36820;&#22238; -EAGAIN,&#22914;&#26524;&#36825;&#20010;&#26631;&#24535;&#34987;&#35774;&#32622;. &#22312;&#24320;&#22987;&#36825;&#20010;&#35774;&#22791;&#30340;&#21021;&#22987;&#21270;&#36827;&#31243;&#20043;&#21518;. &#36825;&#20010;&#39537;&#21160;&#21487;&#33021;&#36824;&#23454;&#29616;&#19968;&#20010;&#38459;&#22622; open &#26469;&#25903;&#25345;&#23384;&#21462;&#31574;&#30053;, &#36890;&#36807;&#31867;&#20284;&#20110;&#25991;&#20214;&#38145;&#30340;&#26041;&#24335;. &#25105;&#20204;&#23558;&#35265;&#21040;&#36825;&#26679;&#19968;&#20010;&#23454;&#29616;&#22312;"&#38459;&#22622; open &#20316;&#20026;&#23545; EBUSY &#30340;&#26367;&#20195;"
</p>
</div>
<div class="sect3" title="21.5.3. poll&#21644;select"><div class="titlepage"><div><div><h4 class="title"><a name="idp81845604"></a>21.5.3. poll&#21644;select</h4></div></div></div>
&#38459;&#22622;&#30340;&#35835;&#20889;&#25805;&#20316;&#26159;&#24403;&#21069;&#36827;&#31243;&#19981;&#24471;&#19981;&#20572;&#19979;&#26469;&#65292;&#31561;&#24453;&#20107;&#20214;&#30340;&#35302;&#21457;&#65292;&#37027;&#20040;&#21482;&#35201;&#19968;&#20010;&#25551;&#36848;&#31526;&#36827;&#31243;&#23601;&#19981;&#24471;&#19981;&#20572;&#19979;&#26469;&#65292;&#36825;&#26159;&#38750;&#24120;&#31967;&#31957;&#30340;&#20107;&#24773;&#65281;&#20351;&#29992;&#38750;&#38459;&#22622;&#30340;I/O&#21487;&#20197;&#36890;&#36807;poll&#65292;select&#21644;epoll&#31995;&#32479;&#35843;&#29992;&#26469;&#21516;&#26102;&#30417;&#21548;&#22810;&#20010;&#25551;&#36848;&#31526;&#65292;&#20063;&#21363;&#25551;&#36848;&#31526;&#38598;&#12290;poll&#21644;select&#21151;&#33021;&#30456;&#21516;&#65292;&#30001;&#19981;&#21516;&#30340;&#24320;&#21457;&#29256;&#26412;&#24341;&#20837;&#65292;epoll&#22312;2.5.45&#20869;&#26680;&#29256;&#26412;&#20013;&#21152;&#20837;&#65292;&#23427;&#20351;&#34987;&#30417;&#21548;&#30340;&#25991;&#20214;&#25551;&#36848;&#31526;&#22810;&#36798;&#20960;&#21315;&#20010;&#12290;
<pre class="programlisting">
#include &lt;poll.h&gt;
int poll(struct pollfd *fds, nfds_t nfds, int timeout);

/* &#39537;&#21160;&#20013;&#30340;poll&#21407;&#22411; */
unsigned int (*poll) (struct file *, struct poll_table_struct *);
</pre>
&#39537;&#21160;&#30340;poll&#26041;&#27861;&#25552;&#20379;&#20102;&#29992;&#25143;&#31354;&#38388;&#30340;&#20390;&#21548;&#21160;&#20316;&#12290;&#23427;&#36127;&#36131;&#20004;&#26041;&#38754;&#65306;
<div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">&#22312;&#19968;&#20010;&#25110;&#22810;&#20010;&#21487;&#25351;&#31034;&#26597;&#35810;&#29366;&#24577;&#21464;&#21270;&#30340;&#31561;&#24453;&#38431;&#21015;&#19978;&#35843;&#29992; poll_wait&#12290;&#22914;&#26524;&#27809;&#26377;&#25991;&#20214;&#25551;&#36848;&#31526;&#21487;&#29992;&#20316; I/O, &#20869;&#26680;&#20351;&#36825;&#20010;&#36827;&#31243;&#22312;&#31561;&#24453;&#38431;&#21015;&#19978;&#31561;&#24453;&#25152;&#26377;&#30340;&#20256;&#36882;&#32473;&#31995;&#32479;&#35843;&#29992;&#30340;&#25991;&#20214;&#25551;&#36848;&#31526;.</li><li class="listitem">&#36820;&#22238;&#19968;&#20010;&#20301;&#25513;&#30721;, &#25551;&#36848;&#21487;&#33021;&#19981;&#24517;&#38459;&#22622;&#23601;&#31435;&#21051;&#36827;&#34892;&#30340;&#25805;&#20316;&#12290;</li></ul></div>
&#20026;&#20102;&#29702;&#28165;&#23454;&#29616;&#36807;&#31243;&#65292;&#20174;poll&#30340;&#31995;&#32479;&#35843;&#29992;&#24320;&#22987;&#36861;&#36394;&#65306;
<pre class="programlisting">
fs/select.c
SYSCALL_DEFINE3(poll, struct pollfd __user *, ufds, unsigned int, nfds,
		long, timeout_msecs)
{
	struct timespec end_time, *to = NULL;
	int ret;

	if (timeout_msecs &gt;= 0) {
		to = &amp;end_time;
		poll_select_set_timeout(to, timeout_msecs / MSEC_PER_SEC,
			NSEC_PER_MSEC * (timeout_msecs % MSEC_PER_SEC));
	}

	ret = do_sys_poll(ufds, nfds, to);

	if (ret == -EINTR) {
		struct restart_block *restart_block;
		......
		ret = -ERESTART_RESTARTBLOCK;
	}
	return ret;
}
</pre>
<div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">poll_select_set_timeout&#26681;&#25454;&#24403;&#21069;&#26102;&#38388;&#35745;&#31639;&#36229;&#26102;&#26102;&#38388;&#65292;&#23384;&#25918;&#20837;&#19968;&#20010;	struct timespec&#32467;&#26500;&#20307;&#23454;&#20363;to&#20013;&#12290;&#26174;&#28982;&#22914;&#26524;&#27809;&#26377;&#35774;&#32622;&#26102;&#38388;timeout_msecs&#65292;to&#25351;&#21521;NULL&#12290;</li><li class="listitem">do_sys_poll&#23454;&#29616;&#23454;&#38469;&#30340;&#26597;&#35810;&#21151;&#33021;&#12290;&#25509;&#19979;&#26469;&#23558;&#23545;&#23427;&#23637;&#24320;&#20998;&#26512;&#12290;</li><li class="listitem">&#22914;&#26524;do_sys_poll&#36820;&#22238;-EINTR&#65292;&#21017;&#24847;&#21619;&#30528;poll&#25805;&#20316;&#34987;&#20449;&#21495;&#25171;&#26029;&#65292;&#36820;&#22238;ERESTART_RESTARTBLOCK&#65292;&#30001;&#29992;&#25143;&#27880;&#20876;&#30340;&#20449;&#21495;&#22914;&#26524;&#35774;&#32622;&#20102;SA_RESTART&#65292;&#21017;&#21487;&#20197;&#22312;&#22788;&#29702;&#23436;&#29992;&#25143;&#27880;&#20876;&#30340;&#20449;&#21495;&#22788;&#29702;&#31243;&#24207;&#21518;&#65292;&#32487;&#32493;&#25191;&#34892;&#12290;</li></ul></div>
do_sys_poll&#20013;&#39318;&#20808;&#25226;&#29992;&#25143;&#31354;&#38388;&#30340;struct pollfd&#25335;&#36125;&#21040;&#29992;&#25143;&#31354;&#38388;&#30340;struct poll_list&#31867;&#22411;&#30340;&#38142;&#34920;&#20013;&#65292;&#36825;&#38142;&#34920;&#30340;&#22836;&#23450;&#20041;&#22312;&#26632;&#31354;&#38388;&#65292;&#32780;&#20854;&#20182;&#25104;&#21592;&#21017;&#36890;&#36807;kmalloc&#22312;&#20869;&#26680;&#31354;&#38388;&#21160;&#24577;&#20998;&#37197;&#65292;&#36825;&#21487;&#20197;&#25552;&#39640;&#23545;&#35813;&#34920;&#30340;&#35775;&#38382;&#25928;&#29575;&#12290;&#25509;&#30528;&#35813;&#20989;&#25968;&#25191;&#34892;&#22914;&#19979;&#20195;&#30721;&#65306;
<pre class="programlisting">
	poll_initwait(&amp;table);
	fdcount = do_poll(nfds, head, &amp;table, end_time);
	poll_freewait(&amp;table);
</pre>
&#27599;&#27425;&#38024;&#23545;poll&#30340;&#31995;&#32479;&#35843;&#29992;&#37117;&#20250;&#21021;&#22987;&#21270;&#19968;&#20010;&#31867;&#22411;&#20026;poll_wqueues&#30340;&#25361;&#36873;&#38431;&#21015;:
<pre class="programlisting">
linux/poll.h
struct poll_wqueues {
	poll_table pt;
	struct poll_table_page *table;
	struct task_struct *polling_task;
	int triggered;
	int error;
	int inline_index;
	struct poll_table_entry inline_entries[N_INLINE_POLL_ENTRIES];
};
</pre>
poll_initwait&#29992;&#20110;&#21021;&#22987;&#21270;&#35813;&#25361;&#36873;&#38431;&#21015;&#65292;&#20854;&#20013;&#30340;polling_task&#25104;&#21592;&#34987;&#36171;&#20540;&#20026;&#24403;&#21069;&#36827;&#31243;&#30340;task_struct&#12290;
<pre class="programlisting">
void poll_initwait(struct poll_wqueues *pwq)
{
	init_poll_funcptr(&amp;pwq-&gt;pt, __pollwait);
	pwq-&gt;polling_task = current;
	pwq-&gt;triggered = 0;
	pwq-&gt;error = 0;
	pwq-&gt;table = NULL;
	pwq-&gt;inline_index = 0;
}
</pre>
&#25509;&#30528;&#35843;&#29992;do_poll&#65292;&#20854;&#20013;&#21442;&#25968;nfds&#20026;&#29992;&#25143;&#20256;&#20837;&#30340;&#25972;&#25968;&#65292;&#20195;&#34920;&#20256;&#20837;&#30340;pollfd&#30340;&#25968;&#37327;&#65292;&#32780;head&#21363;&#20026;&#25335;&#36125;&#21518;&#30340;poll_list&#38142;&#34920;&#65292;table&#26159;&#25361;&#36873;&#38431;&#21015;&#65292;&#32780;end_time&#23601;&#26159;&#36229;&#26102;&#26102;&#38388;&#12290;do_poll&#23545;poll_list&#38142;&#34920;&#36827;&#34892;&#24490;&#29615;&#22788;&#29702;&#22788;&#29702;&#65292;&#23545;&#20110;&#21333;&#20010;fd&#65292;&#21017;&#35843;&#29992;do_pollfd&#36827;&#34892;&#22788;&#29702;&#12290;&#21478;&#22806;&#27880;&#24847;&#21040;&#22312;&#19968;&#27425;&#36941;&#21382;&#20043;&#21518;&#19968;&#26086;&#36820;&#29616;do_pollfd&#30340;&#36820;&#22238;&#20540;&#19981;&#20026;0&#65292;&#21017;&#35828;&#26126;&#35813;&#25551;&#36848;&#31526;&#21487;&#25805;&#20316;&#65292;&#35745;&#20837;count&#65292;&#22914;&#26524;count&#19981;&#20026;0&#25110;&#32773;&#36229;&#26102;&#21017;&#30452;&#25509;&#36339;&#20986;&#24490;&#29615;&#65292;&#24182;&#36820;&#22238;&#27963;&#36291;&#25551;&#36848;&#31526;&#30340;&#35745;&#25968;&#12290;
<pre class="programlisting">
		for (walk = list; walk != NULL; walk = walk-&gt;next) {
			struct pollfd * pfd, * pfd_end;

			pfd = walk-&gt;entries;
			pfd_end = pfd + walk-&gt;len;
			for (; pfd != pfd_end; pfd++) {				
				if (do_pollfd(pfd, pt)) {
					count++;
					pt = NULL;
				}
			}
		}
		......
		pt = NULL;
		if (!count) {
			count = wait-&gt;error;
			if (signal_pending(current))
				count = -EINTR;
		}
		if (count || timed_out)
			break;	
		......	
		if (!poll_schedule_timeout(wait, TASK_INTERRUPTIBLE, to, slack))
			timed_out = 1;		
</pre>
do_pollfd&#35843;&#29992;&#39537;&#21160;&#25552;&#20379;&#30340;poll&#20989;&#25968;&#65292;&#22914;&#26524;&#27809;&#26377;&#21017;&#27704;&#36828;&#36820;&#22238;0&#12290;poll &#36820;&#22238;&#20301;&#25513;&#30721;, &#23427;&#25551;&#36848;&#21738;&#20010;&#25805;&#20316;&#21487;&#39532;&#19978;&#34987;&#23454;&#29616;;&#20363;&#22914;, &#22914;&#26524;&#35774;
&#22791;&#26377;&#25968;&#25454;&#21487;&#29992;, &#19968;&#20010;&#35835;&#21487;&#33021;&#19981;&#24517;&#30561;&#30496;&#32780;&#23436;&#25104;; poll &#26041;&#27861;&#24212;&#24403;&#25351;&#31034;&#36825;&#20010;&#26102;&#38388;&#29366;&#24577;&#12290;
<pre class="programlisting">
static inline unsigned int do_pollfd(struct pollfd *pollfd, poll_table *pwait)
{
	unsigned int mask;
	int fd;

	mask = 0;
	fd = pollfd-&gt;fd;
	if (fd &gt;= 0) {
		int fput_needed;
		struct file * file;

		file = fget_light(fd, &amp;fput_needed);
		mask = POLLNVAL;
		if (file != NULL) {
			mask = DEFAULT_POLLMASK;
			if (file-&gt;f_op &amp;&amp; file-&gt;f_op-&gt;poll) {
				if (pwait)
					pwait-&gt;key = pollfd-&gt;events |
							POLLERR | POLLHUP;
				mask = file-&gt;f_op-&gt;poll(file, pwait);
			}
			/* Mask out unneeded events. */
			mask &amp;= pollfd-&gt;events | POLLERR | POLLHUP;
			fput_light(file, fput_needed);
		}
	}
	pollfd-&gt;revents = mask;

	return mask;
}
</pre>
&#21487;&#20197;&#24778;&#22855;&#30340;&#21457;&#29616;pwait&#21442;&#25968;&#23601;&#26159;&#25361;&#36873;&#38431;&#21015;&#20013;&#30340;pt&#25104;&#21592;&#30340;&#25351;&#38024;&#65292;&#25152;&#20197;&#39537;&#21160;&#30340;poll&#35201;&#23454;&#29616;&#21152;&#20837;&#35774;&#22791;&#31561;&#24453;&#38431;&#21015;&#30340;&#21151;&#33021;&#12290;poll_table&#32467;&#26500;, &#20316;&#20026;poll &#26041;&#27861;&#30340;&#31532;2&#20010;&#21442;&#25968;, &#26368;&#32456;&#22312;&#20869;&#26680;&#20013;&#29992;&#26469;&#23454;&#29616;poll, select, &#21644; epoll &#35843;&#29992;&#12290;&#39537;&#21160;&#32534;&#20889;&#32773;&#19981;&#24517;&#35201;&#30693;&#36947;&#25152;&#26377;&#23427;&#30340;&#20869;&#23481;&#24182;&#19988;&#24517;&#39035;&#20316;&#20026;&#19968;
&#20010;&#19981;&#36879;&#26126;&#30340;&#23545;&#35937;&#20351;&#29992;&#23427;; &#23427;&#34987;&#20256;&#36882;&#32473;&#39537;&#21160;&#26041;&#27861;&#20197;&#20415;&#39537;&#21160;&#21487;&#29992;&#27599;&#20010;&#33021;&#21796;&#37266;&#36827;&#31243;&#30340;&#31561;&#24453;&#38431;&#21015;&#26469;&#21152;&#36733;&#23427;&#65292;&#24182;&#19988;&#21487;&#25913;&#21464; poll &#25805;&#20316;&#29366;&#24577;&#12290;&#39537;&#21160;&#36890;&#36807;&#35843;&#29992;&#20989;&#25968; poll_wait&#22686;&#21152;&#19968;&#20010;&#31561;&#24453;&#38431;&#21015;&#21040; poll_table &#32467;&#26500;:
<pre class="programlisting">
poll_wait(filp, &amp;wtqueue, wait);
if (bool)
	return |= POLLIN | POLLRDNORM; /* readable */
</pre>
poll_wait&#23454;&#38469;&#19978;&#23601;&#26159;&#35843;&#29992;__pollwait&#28155;&#21152;poll_table&#25104;&#21592;&#21040;wtqueue&#12290;
<pre class="programlisting">
static inline void poll_wait(struct file * filp, wait_queue_head_t * wait_address, poll_table *p)
{
	if (p &amp;&amp; wait_address)
		p-&gt;qproc(filp, wait_address, p);
}

/* Add a new entry */
static void __pollwait(struct file *filp, wait_queue_head_t *wait_address,
				poll_table *p)
{
	struct poll_wqueues *pwq = container_of(p, struct poll_wqueues, pt);
	struct poll_table_entry *entry = poll_get_entry(pwq);
	if (!entry)
		return;
	get_file(filp);
	entry-&gt;filp = filp;
	entry-&gt;wait_address = wait_address;
	entry-&gt;key = p-&gt;key;
	init_waitqueue_func_entry(&amp;entry-&gt;wait, pollwake);
	entry-&gt;wait.private = pwq;
	add_wait_queue(wait_address, &amp;entry-&gt;wait);
}
</pre>
<div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">poll_get_entry&#29992;&#26469;&#20998;&#37197;struct poll_table_page&#32467;&#26500;&#65292;&#23427;&#30340;&#22823;&#23567;&#26159;&#19968;&#20010;&#39029;&#38754;&#65292;&#36825;&#34920;&#26126;&#23427;&#30340;&#23614;&#37096;&#21253;&#21547;&#22810;&#20010;struct poll_table_entry&#32467;&#26500;&#20307;&#12290;&#22914;&#26524;&#24050;&#32463;&#20998;&#37197;&#36807;&#65292;&#24182;&#19988;POLL_TABLE_FULL&#21028;&#26029;poll_table_entry&#32467;&#26500;&#20307;&#26410;&#23436;&#20840;&#20351;&#29992;&#65292;&#21017;&#30452;&#25509;&#36820;&#22238;&#35813;&#34920;&#20013;&#30340;&#19979;&#19968;&#20010;poll_table_entry&#32467;&#26500;&#20307;&#25351;&#38024;&#12290;</li><li class="listitem">&#25509;&#19979;&#26469;&#21021;&#22987;&#21270;&#19968;&#20010;poll_table_entry&#65292;&#20854;&#20013;&#30340;wait_address&#25104;&#21592;&#24635;&#26159;&#25351;&#21521;&#31561;&#24453;&#38431;&#21015;&#22836;&#12290;</li><li class="listitem">init_waitqueue_func_entry&#29992;&#26469;&#22635;&#20805;poll_table_entry&#20013;&#30340;&#31561;&#24453;&#38431;&#21015;&#25104;&#21592;&#65292;&#20854;&#20013;&#30340;&#21796;&#37266;&#20989;&#25968;&#34987;&#36171;&#20540;&#20026;pollwake&#65292;&#32780;&#31169;&#26377;&#25968;&#25454;&#36171;&#20540;&#20026;poll_wqueues&#65292;&#23427;&#26159;&#25361;&#36873;&#38431;&#21015;&#30340;&#22836;&#37096;&#22320;&#22336;&#12290;</li><li class="listitem">add_wait_queue&#23558;&#31561;&#24453;&#38431;&#21015;&#25104;&#21592;&#25918;&#20837;&#31561;&#24453;&#38431;&#21015;&#12290;</li></ul></div>
&#22312;&#32463;&#36807;__pollwait&#30340;&#19968;&#31995;&#21015;&#22788;&#29702;&#21518;&#65292;&#25972;&#20010;&#32467;&#26500;&#22270;&#30475;&#36215;&#26469;&#22914;&#19979;&#25152;&#31034;&#65306;
<div class="figure"><a name="idp81858548"></a><p class="title"><b>&#22270; 120. poll&#38431;&#21015;&#25299;&#25169;&#22270;</b></p><div class="figure-contents"><div><img src="images/device/poll.gif" alt="poll&#38431;&#21015;&#25299;&#25169;&#22270;"></div></div></div><br class="figure-break">
&#37027;&#20040;&#36827;&#31243;&#20309;&#26102;&#34987;&#20241;&#30496;&#21602;&#65311;&#27880;&#24847;do_poll&#20013;&#30340;poll_schedule_timeout&#20989;&#25968;&#65292;&#27880;&#24847;&#21040;&#23427;&#30340;&#31532;&#20108;&#20010;&#21442;&#25968;&#34987;&#35774;&#32622;&#20026;&#20102;TASK_INTERRUPTIBLE&#65292;&#23427;&#24635;&#26159;&#35753;&#36827;&#31243;&#20241;&#30496;&#21040;&#36229;&#26102;(&#22914;&#26524;&#35774;&#32622;&#20102;&#36229;&#26102;)&#20026;&#27490;&#65292;&#24182;&#21487;&#34987;&#20013;&#26029;&#65306;
<pre class="programlisting">
fs/select.c
int poll_schedule_timeout(struct poll_wqueues *pwq, int state,
			  ktime_t *expires, unsigned long slack)
{
	int rc = -EINTR;

	set_current_state(state);
	if (!pwq-&gt;triggered)
		rc = schedule_hrtimeout_range(expires, slack, HRTIMER_MODE_ABS);
	__set_current_state(TASK_RUNNING);

	set_mb(pwq-&gt;triggered, 0);

	return rc;
}
</pre>
&#35813;&#20989;&#25968;&#39318;&#20808;&#35774;&#32622;&#24403;&#21069;&#36827;&#31243;&#30340;&#29366;&#24577;&#20026;TASK_INTERRUPTIBLE&#65292;&#28982;&#21518;&#36890;&#36807;schedule_hrtimeout_range&#36827;&#37266;&#20241;&#30496;&#65292;&#30452;&#21040;&#34987;&#21796;&#37266;&#25110;&#32773;&#36229;&#26102;&#65292;&#23427;&#30340;&#29366;&#24577;&#20301;&#34987;&#25913;&#20026;TASK_RUNNING&#32487;&#32493;&#36816;&#34892;&#12290;
</div>
<div class="sect3" title="21.5.4. &#21047;&#20986;&#32531;&#20914;"><div class="titlepage"><div><div><h4 class="title"><a name="idp81845732"></a>21.5.4. &#21047;&#20986;&#32531;&#20914;</h4></div></div></div>
&#22914;&#26524;&#19968;&#20123;&#24212;&#29992;&#31243;&#24207;&#38656;&#35201;&#34987;&#30830;&#20445;&#25968;&#25454;&#34987;&#21457;&#36865;&#21040;&#35774;&#22791;, fsync &#26041;&#27861;&#24517;&#39035;&#34987;&#23454;&#29616;&#20026;&#19981;&#31649; O_NONBLOCK &#26159;&#21542;&#34987;&#35774;&#32622;&#12290; &#23545; fsync &#30340;&#35843;&#29992;&#24212;&#24403;&#21482;&#22312;&#35774;&#22791;&#34987;&#23436;&#20840;&#21047;&#26032;&#26102;&#36820;&#22238;&#12290;
<pre class="programlisting">
int (*fsync) (struct file *file, struct dentry *dentry, int datasync);
</pre>
</div>
</div>
<div class="sect2" title="21.6. &#24322;&#27493;&#36890;&#30693;"><div class="titlepage"><div><div><h3 class="title"><a name="idp81861668"></a>21.6. &#24322;&#27493;&#36890;&#30693;</h3></div></div></div>
</div>
<p>
</p>
</div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ar01s20.html">&#19978;&#19968;&#39029;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="ar01s22.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">20. &#20869;&#26680;&#21516;&#27493; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top"> 22. &#32593;&#32476;&#35774;&#22791;&#39537;&#21160;</td></tr></table></div></body></html>
