<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>23. Linux&#27169;&#24335;&#35774;&#35745;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL-NS Stylesheets V1.75.2"><link rel="home" href="index.html" title="Linux&#20869;&#26680;&#23398;&#20064;&#21644;&#30740;&#31350;&#21450;&#23884;&#20837;&#24335;(ARM)&#23398;&#20064;&#21644;&#30740;&#31350;&#30340;&#24320;&#25918;&#25991;&#26723;"><link rel="up" href="index.html" title="Linux&#20869;&#26680;&#23398;&#20064;&#21644;&#30740;&#31350;&#21450;&#23884;&#20837;&#24335;(ARM)&#23398;&#20064;&#21644;&#30740;&#31350;&#30340;&#24320;&#25918;&#25991;&#26723;"><link rel="prev" href="ar01s22.html" title="22. &#32593;&#32476;&#35774;&#22791;&#39537;&#21160;"><link rel="next" href="ar01s24.html" title="24. &#38468;&#24405;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">23. Linux&#27169;&#24335;&#35774;&#35745;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ar01s22.html">&#19978;&#19968;&#39029;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="ar01s24.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="sect1" title="23. Linux&#27169;&#24335;&#35774;&#35745;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="idp81926468"></a>23. Linux&#27169;&#24335;&#35774;&#35745;</h2></div></div></div>
<div class="sect2" title="23.1. &#25968;&#25454;&#22823;&#23567;"><div class="titlepage"><div><div><h3 class="title"><a name="idp81926812"></a>23.1. &#25968;&#25454;&#22823;&#23567;</h3></div></div></div>
&#20869;&#26680;&#20026;&#20102;&#20445;&#25345;&#26368;&#22823;&#30340;&#20860;&#23481;&#24615;&#21644;&#20195;&#30721;&#28789;&#27963;&#24615;&#65292;&#19981;&#21487;&#33021;&#30452;&#25509;&#23545;&#26576;&#20010;&#25968;&#25454;&#31867;&#22411;&#23450;&#20041;&#23427;&#30340;&#22823;&#23567;&#33539;&#22260;&#12290;&#20294;&#26159;&#24456;&#22810;&#26102;&#20505;&#21448;&#35201;&#29992;&#21040;&#36825;&#20123;&#26368;&#22823;&#20540;&#26368;&#23567;&#20540;&#25110;&#32773;&#35813;&#25968;&#25454;&#31867;&#22411;&#21487;&#20197;&#34920;&#31034;&#30340;&#25968;&#25454;&#33539;&#22260;&#65292;&#27604;&#22914;&#21021;&#22987;&#21270;&#19968;&#20010;&#20540;&#20026;&#26368;&#22823;/&#23567;&#20540;&#65292;&#25110;&#32773;&#26816;&#39564;&#25968;&#25454;&#26159;&#21542;&#20301;&#20110;&#26576;&#20010;&#31867;&#22411;&#30340;&#33539;&#22260;&#20869;&#12290;
<pre class="programlisting">
include/linux/kernel.h
#define USHORT_MAX      ((u16)(~0U))
#define SHORT_MAX       ((s16)(USHORT_MAX&gt;&gt;1))
#define SHORT_MIN       (-SHORT_MAX - 1)

#define INT_MAX         ((int)(~0U&gt;&gt;1))
#define INT_MIN         (-INT_MAX - 1)
#define UINT_MAX        (~0U)

#define LONG_MAX        ((long)(~0UL&gt;&gt;1))
#define LONG_MIN        (-LONG_MAX - 1)
#define ULONG_MAX       (~0UL)

#define LLONG_MAX       ((long long)(~0ULL&gt;&gt;1))
#define LLONG_MIN       (-LLONG_MAX - 1)
#define ULLONG_MAX      (~0ULL)
</pre>
&#20869;&#26680;&#36890;&#36807;C&#35821;&#35328;&#30340;&#24378;&#21046;&#36716;&#25442;&#26469;&#23454;&#29616;&#65292;&#39318;&#20808;&#23450;&#20041;&#26080;&#31526;&#21495;&#25968;&#30340;&#26368;&#22823;&#20540;&#65292;&#27604;&#22914;USHORT_MAX&#12290;&#28982;&#21518;&#21435;&#25481;&#31526;&#21495;&#20301;&#21487;&#20197;&#24471;&#21040;&#35813;&#31867;&#22411;&#26377;&#31526;&#21495;&#30340;&#26368;&#22823;&#20540;&#65292;&#32780;&#26368;&#23567;&#20540;&#30340;&#32477;&#23545;&#20540;&#21017;&#27604;&#26368;&#22823;&#20540;&#30340;&#22823;1&#65292;&#25152;&#20197;&#36890;&#36807;&#23545;&#26377;&#31526;&#21495;&#30340;&#26368;&#22823;&#20540;&#21462;&#21453;&#20943;1&#65292;&#23601;&#21487;&#20197;&#24471;&#21040;&#26377;&#31526;&#21495;&#30340;&#26368;&#23567;&#20540;&#12290;&#26681;&#25454;&#36825;&#19968;&#35268;&#21017;&#21487;&#20197;&#24456;&#23481;&#26131;&#20889;&#20986;char&#31867;&#22411;&#30340;&#30456;&#20851;&#25968;&#25454;&#22823;&#23567;&#12290;&#36716;&#25442;&#30340;&#21407;&#29702;&#20174;&#19979;&#22270;&#20013;&#21487;&#20197;&#26356;&#28165;&#26224;&#30340;&#30475;&#20986;&#26469;&#65306;
<div class="figure"><a name="idp81928756"></a><p class="title"><b>&#22270; 132. char&#22411;&#25968;&#25454;&#26377;&#26080;&#31526;&#21495;&#36716;&#25442;&#22270;</b></p><div class="figure-contents"><div><img src="images/mode_cov.gif" alt="char&#22411;&#25968;&#25454;&#26377;&#26080;&#31526;&#21495;&#36716;&#25442;&#22270;"></div></div></div><br class="figure-break">
&#26681;&#25454;Linux&#23545;short&#65292;int&#65292;long&#20197;&#21450;long long&#25968;&#25454;&#31867;&#22411;&#22823;&#23567;&#30340;&#23450;&#20041;&#65292;&#21487;&#20197;&#24456;&#23481;&#26131;&#23450;&#20041;&#20986;char&#22411;&#30340;&#25968;&#25454;&#22823;&#23567;&#65292;&#31034;&#20363;&#22914;&#19979;&#65306;
<pre class="programlisting">
#include &lt;stdio.h&gt;

#define UCHAR_MAX      ((unsigned char)(~0U))
#define CHAR_MAX       ((char)(UCHAR_MAX &gt;&gt; 1))
#define CHAR_MIN       (-CHAR_MAX - 1)

int main()
{
  printf("UCHAR_MAX:\t%u\n", UCHAR_MAX);
  printf("CHAR_MAX:\t%d\n", CHAR_MAX);
  printf("CHAR_MIN:\t%d\n", CHAR_MIN);

  return 0;
}
</pre>
&#24471;&#21040;&#22914;&#19979;&#32467;&#26524;&#65306;
<pre class="programlisting">
UCHAR_MAX:	255
CHAR_MAX:	127
CHAR_MIN:	-128
</pre>
&#23450;&#20041;&#25968;&#25454;&#22823;&#23567;&#30340;&#26041;&#27861;&#26377;&#24456;&#22810;&#31181;&#65292;&#27604;&#22914;&#36890;&#36807;&#25509;&#19979;&#26469;&#25968;&#25454;&#23545;&#40784;&#23567;&#33410;&#20013;&#30340;&#20559;&#31227;&#20301;&#26426;&#21046;&#65292;&#20294;&#26159;&#36825;&#20250;&#22312;&#29983;&#25104;&#31532;&#19968;&#20010;&#25968;&#20540;&#26102;&#20135;&#29983;&#31227;&#20301;&#36816;&#31639;&#65292;&#24182;&#19988;&#22312;&#29983;&#25104;&#23485;&#24230;&#22823;&#20110;32&#20301;&#30340;&#31867;&#22411;&#26102;&#35201;&#20998;&#21035;&#32771;&#34385;&#65292;&#27809;&#26377;&#19978;&#38754;&#26041;&#27861;&#30340;&#25928;&#29575;&#39640;&#12290;&#19968;&#20010;&#23436;&#25104;&#30456;&#21516;&#21151;&#33021;&#30340;&#31034;&#20363;&#22914;&#19979;&#65292;&#23427;&#30340;&#24605;&#24819;&#21442;&#32771;&#25968;&#25454;&#23545;&#40784;&#23567;&#33410;&#12290;
<pre class="programlisting">
#define CHAR_SHIFT      (sizeof(char) &lt;&lt; 3 + 1)
#define UUCHAR_MAX      ((unsigned char)((1 &lt;&lt; CHAR_SHIFT) - 1))
......
</pre>
</div>
<div class="sect2" title="23.2. &#25968;&#25454;&#27604;&#36739;"><div class="titlepage"><div><div><h3 class="title"><a name="idp81931468"></a>23.2. &#25968;&#25454;&#27604;&#36739;</h3></div></div></div>
&#30001;&#20110;Linux&#20195;&#30721;&#37319;&#29992;Gcc&#32534;&#35793;&#22120;&#32534;&#35793;&#65292;&#25152;&#20197;&#23427;&#21487;&#20197;&#37319;&#29992;Gcc&#23545;C&#35821;&#35328;&#30340;&#25193;&#23637;&#29305;&#24615;&#65292;&#20197;&#23454;&#29616;&#39640;&#25928;&#30340;&#20195;&#30721;&#12290;&#20854;&#20013;&#36816;&#29992;&#38750;&#24120;&#24191;&#27867;&#30340;&#25193;&#23637;&#23601;&#26159;&#22797;&#21512;&#35821;&#21477;&#12290;Gcc&#25226;&#21253;&#21547;&#22312;&#22278;&#25324;&#21495;&#21644;&#22823;&#25324;&#21495;&#21452;&#23618;&#25324;&#21495;&#20869;&#30340;&#22797;&#21512;&#35821;&#21477;&#30475;&#20316;&#26159;&#19968;&#20010;&#34920;&#36798;&#24335;&#65292;&#23427;&#21487;&#20197;&#20986;&#29616;&#22312;&#20219;&#20309;&#20801;&#35768;&#34920;&#36798;&#24335;&#30340;&#22320;&#26041;&#65292;&#32780;&#22797;&#21512;&#35821;&#21477;&#20013;&#21487;&#20197;&#22768;&#26126;&#23616;&#37096;&#21464;&#37327;&#65292;&#20197;&#21450;&#24490;&#29615;&#26465;&#20214;&#21028;&#26029;&#31561;&#22797;&#26434;&#22788;&#29702;&#12290;&#32780;&#34920;&#36798;&#24335;&#30340;&#26368;&#21518;&#19968;&#26465;&#35821;&#21477;&#24517;&#39035;&#26159;&#19968;&#20010;&#34920;&#36798;&#24335;&#65292;&#23427;&#30340;&#35745;&#31639;&#32467;&#26524;&#20316;&#20026;&#36820;&#22238;&#20540;&#12290;
<pre class="programlisting">
int a = ({typeof(a) _a = 0; ++_a;});
</pre>
&#19978;&#20363;&#20013;&#31526;&#21512;&#34920;&#36798;&#24335;&#20013;&#22768;&#26126;&#20102;&#23616;&#37096;&#21464;&#37327;_a&#65292;&#32780;&#36820;&#22238;&#20540;&#20026;++_a&#30340;&#32467;&#26524;&#65292;&#25152;&#20197;a&#30340;&#20540;&#20026;1&#12290;&#22522;&#20110;&#36825;&#31181;&#25193;&#23637;&#65292;&#20869;&#26680;&#21487;&#20197;&#36890;&#36807;&#22312;&#22797;&#21512;&#35821;&#21477;&#20013;&#23450;&#20041;&#23616;&#37096;&#21464;&#37327;&#32780;&#34920;&#38754;&#33258;&#21152;&#33258;&#20943;&#36816;&#31639;&#31526;&#30340;&#21103;&#20316;&#29992;&#38382;&#39064;&#12290;&#20869;&#26680;&#20013;&#30340;min_t&#21644;max_t&#23439;&#23601;&#26159;&#36825;&#26679;&#23454;&#29616;&#30340;&#12290;
<pre class="programlisting">
include/linux/kernel.h
#define min_t(type, x, y) ({			\
	type __min1 = (x);			\
	type __min2 = (y);			\
	__min1 &lt; __min2 ? __min1: __min2; })

#define max_t(type, x, y) ({			\
	type __max1 = (x);			\
	type __max2 = (y);			\
	__max1 &gt; __max2 ? __max1: __max2; })
</pre>
&#23613;&#31649;&#22810;&#25968;&#26102;&#20505;&#36890;&#36807;&#20351;&#29992;&#36825;&#31867;&#23439;&#65292;&#21487;&#20197;&#36991;&#20813;&#21442;&#25968;&#30340;&#21103;&#20316;&#29992;&#65292;&#20294;&#26159;&#36825;&#20250;&#22686;&#21152;&#20869;&#23384;&#30340;&#24320;&#38144;&#21644;&#25191;&#34892;&#25928;&#29575;&#65292;&#25152;&#20197;&#22914;&#26524;&#33021;&#22815;&#20445;&#35777;&#21442;&#25968;&#19981;&#23384;&#22312;&#21103;&#20316;&#29992;&#65292;&#37027;&#20040;&#20351;&#29992;&#36890;&#24120;&#30340;&#22914;&#19979;&#23450;&#20041;&#21363;&#21487;&#65306;
<pre class="programlisting">
#define min(a, b) ((a) &gt; (b)? (b) : (a))
#define max(a, b) ((a) &gt; (b)? (a) : (b))
</pre>
&#20197;&#19978;&#30340;min_t&#21644;max_t&#23439;&#36866;&#38656;&#35201;&#25552;&#20379;&#25968;&#25454;&#31867;&#22411;&#65292;typeof&#30340;&#20986;&#29616;&#20351;&#36825;&#19968;&#27493;&#20063;&#21487;&#34987;&#30465;&#30053;&#12290;
<pre class="programlisting">
include/linux/kernel.h
#define min(x, y) ({				\
	typeof(x) _min1 = (x);			\
	typeof(y) _min2 = (y);			\
	(void) (&amp;_min1 == &amp;_min2);		\
	_min1 &lt; _min2 ? _min1 : _min2; })

#define max(x, y) ({				\
	typeof(x) _max1 = (x);			\
	typeof(y) _max2 = (y);			\
	(void) (&amp;_max1 == &amp;_max2);		\
	_max1 &gt; _max2 ? _max1 : _max2; })
</pre>
&#35266;&#23519;min&#21644;max&#30340;&#23454;&#29616;&#65292;&#23427;&#20204;&#36890;&#36807;typeof&#33719;&#21462;x&#21644;y&#30340;&#31867;&#22411;&#65292;&#28982;&#21518;&#23450;&#20041;&#23616;&#37096;&#21464;&#37327;&#20197;&#28040;&#38500;&#21442;&#25968;&#21103;&#20316;&#29992;&#12290;&#27880;&#24847;&#21040;&#20013;&#38388;&#30340;&#27604;&#36739;&#36816;&#31639;&#65292;&#22914;&#26524;x&#21644;y&#30340;&#31867;&#22411;&#19981;&#21516;&#65292;&#37027;&#20040;&#32534;&#35793;&#22120;&#23558;&#25552;&#31034;&#22914;&#19979;&#35686;&#21578;&#20449;&#24687;&#65292;&#36825;&#23545;&#26816;&#26597;&#20195;&#30721;&#24456;&#26377;&#24110;&#21161;&#12290;
<pre class="programlisting">
xxx.c:35: warning: comparison of distinct pointer types lacks a cast
</pre>
</div>
<div class="sect2" title="23.3. &#25968;&#25454;&#22278;&#25972;"><div class="titlepage"><div><div><h3 class="title"><a name="idp81935748"></a>23.3. &#25968;&#25454;&#22278;&#25972;</h3></div></div></div>
&#22278;&#25972;&#36890;&#24120;&#34987;&#29702;&#35299;&#20026;&#20026;&#28385;&#36275;&#26576;&#31181;&#35201;&#27714;&#32780;&#36827;&#34892;&#30340;&#25968;&#25454;&#20462;&#27491;&#12290;&#25353;&#29031;&#20462;&#27491;&#21518;&#30340;&#25968;&#25454;&#22312;&#25968;&#20540;&#19978;&#26159;&#21542;&#27604;&#21407;&#25968;&#25454;&#22823;&#65292;&#21448;&#21487;&#20998;&#20026;&#21521;&#19978;&#22278;&#25972;&#21644;&#21521;&#19979;&#22278;&#25972;&#12290;&#23427;&#20204;&#24456;&#20687;&#23545;&#27169;&#25311;&#20449;&#21495;&#36827;&#34892;&#37319;&#26679;&#65292;&#23545;&#19968;&#23450;&#33539;&#22260;&#30340;&#25968;&#25454;&#21521;&#19968;&#20010;&#22266;&#23450;&#30340;&#25968;&#25454;&#38752;&#25314;&#12290;Linux&#20869;&#26680;&#20013;&#23450;&#20041;&#20102;&#38754;&#21521;&#25972;&#38500;&#30340;&#22278;&#25972;&#35745;&#31639;&#23439;&#12290;&#31532;&#19968;&#20010;&#21483;&#20570;roundup&#12290;
<pre class="programlisting">
#define roundup(x, y) ((((x) + ((y) - 1)) / (y)) * (y))
</pre>
roundup&#31867;&#20284;&#20110;&#19968;&#20010;&#25968;&#23398;&#20989;&#25968;&#65292;&#23427;&#24635;&#26159;&#23581;&#35797;&#25214;&#21040;&#22823;&#20110;x&#24182;&#25509;&#36817;x&#30340;&#21487;&#20197;&#25972;&#38500;y&#30340;&#37027;&#20010;&#25968;&#65292;&#20063;&#21363;&#21521;&#19978;&#22278;&#25972;&#12290;&#37027;&#20040;&#20026;&#20309;&#20869;&#26680;&#19981;&#21516;&#26159;&#25552;&#20379;roundown&#23439;&#23450;&#20041;&#21602;&#65311;&#36825;&#26159;&#30001;&#20110;&#23545;&#20110;&#25972;&#22411;&#30456;&#38500;&#32780;&#35328;&#65292;&#25152;&#24471;&#30340;&#32467;&#26524;&#26412;&#36523;&#23601;&#26159;&#21521;&#19979;&#22278;&#25972;&#30340;&#20102;&#12290;&#25152;&#20197;roundown&#21487;&#20197;&#24456;&#23481;&#26131;&#23450;&#20041;&#65306;
<pre class="programlisting">
#define roundown(x, y) (((x) / (y)) * (y))
</pre>
&#37027;&#20040;&#22914;&#20309;&#29702;&#35299;roundup&#30340;&#23450;&#20041;&#21602;&#65311;&#30475;&#36215;&#26469;&#26159;&#23581;&#35797;&#23558;(x) + ((y) - 1)&#30340;&#32467;&#26524;&#23545;y&#20570;&#21521;&#19979;&#21462;&#25972;&#65292;&#20026;&#20309;&#36825;&#26679;&#23601;&#21487;&#20197;&#23454;&#29616;x&#23545;y&#30340;&#21521;&#19978;&#21462;&#25972;&#21602;&#65311;&#38500;&#27861;&#30340;&#26412;&#36136;&#22312;&#20110;&#23545;&#37327;&#30340;&#22343;&#20998;&#65292;&#37027;&#20040;&#35266;&#23519;&#19979;&#22270;&#65306;
<div class="figure"><a name="idp81937812"></a><p class="title"><b>&#22270; 133. &#21521;&#19978;&#22278;&#25972;&#31639;&#27861;&#35777;&#26126;</b></p><div class="figure-contents"><div><img src="images/mode_round.gif" alt="&#21521;&#19978;&#22278;&#25972;&#31639;&#27861;&#35777;&#26126;"></div></div></div><br class="figure-break">
<p>&#23545;&#20110;x = &#946;y + &#948;&#26469;&#35828;&#65292;&#946;&gt;=0&#65292;y&gt;0&#65292;&#24182;&#19988;0&lt;=&#948;&lt;y&#12290;&#22240;&#20026;y&gt;0&#19988;&#20026;&#25972;&#25968;&#65292;&#37027;&#20040;0&lt;=&#948;&lt;y&#31561;&#20215;&#20110;0&lt;=&#948;&lt;=y-1&#12290;&#23545;&#20110;&#22278;&#25972;&#36816;&#31639;&#26469;&#35828;&#65292;&#21487;&#20197;&#23558;x&#20013;&#21487;&#20197;&#25972;&#38500;y&#30340;&#37096;&#20998;&#946;y&#25552;&#21462;&#20986;&#26469;&#65292;&#21482;&#23545;&#21097;&#19979;&#30340;&#948;&#37096;&#20998;&#20570;&#22278;&#25972;&#36816;&#31639;&#28982;&#21518;&#21152;&#19978;&#946;y&#12290;&#21516;&#29702;&#36825;&#37324;&#23545;&#948;+y-1&#37096;&#20998;&#36827;&#34892;&#22278;&#25972;&#65292;&#30001;&#20110;0&lt;=&#948;&lt;=y-1&#65292;&#24471;&#21040;y-1 &lt;= &#948; + y-1 &lt;= 2y-2&#12290;&#32771;&#34385;&#20004;&#31181;&#24773;&#20917;&#65306;
&#24403;&#21487;&#20197;&#25972;&#38500;&#26102;&#65292;&#948;=0&#65292;&#20063;&#21363;&#21462;y-1&#65292;&#26174;&#28982;&#22278;&#25972;&#20540;&#20026;0&#65292;&#20063;&#21363;&#19981;&#29992;&#21521;&#19978;&#22278;&#25972;&#65307;&#32780;&#19981;&#21487;&#25972;&#38500;&#26102;&#65292;&#948;&gt;0&#65292;&#25152;&#20197;y-1 &lt; &#948; + y-1 &lt;= 2y-2&#65292;&#21448;&#22240;&#20026;y&#20026;&#25972;&#25968;&#65292;&#25152;&#20197;y &lt;= &#948; + y-1 &lt;= 2y-2&#25104;&#31435;&#65292;&#30001;&#20110;y=1&#26102;&#31526;&#21512;&#31532;&#19968;&#31181;&#24773;&#20917;&#65292;&#25152;&#20197;&#21482;&#38656;&#32771;&#34385;y&gt;=2&#30340;&#24773;&#20917;&#12290;y==y&#24182;&#19988;2y-2&#22312;y&gt;=2&#26102;&gt;=y&#19988;&lt;2y&#65292;&#25152;&#20197;&#20445;&#35777;&#948; + y-1&#30340;&#22278;&#25972;&#20540;&#20026;1&#65292;&#20063;&#21363;&#19981;&#25972;&#38500;&#21017;&#35201;&#22987;&#32456;&#21521;&#19978;&#22278;&#25972;&#12290;
</p>
&#19968;&#31181;&#26356;&#26131;&#34987;&#20154;&#29702;&#35299;&#30340;&#23450;&#20041;&#26041;&#24335;&#22914;&#19979;&#65292;&#23427;&#26681;&#25454;&#21462;&#20313;&#30340;&#32467;&#26524;&#35745;&#31639;&#22278;&#25972;&#65292;&#30001;&#20110;&#25972;&#38500;&#30340;&#27010;&#29575;&#24456;&#20302;&#65292;&#25152;&#20197;&#36825;&#31181;&#31639;&#27861;&#27599;&#27425;&#37117;&#35201;&#22810;&#35745;&#31639;&#19968;&#27425;&#21462;&#20313;&#65292;&#32780;&#19981;&#33021;&#23436;&#20840;&#36991;&#20813;&#23545;&#38500;&#27861;&#30340;&#36816;&#31639;&#20197;&#28040;&#20943;&#21462;&#20313;&#31639;&#27861;&#30340;&#24433;&#21709;&#65292;&#23427;&#30340;&#25928;&#29575;&#35201;&#20302;&#12290;
<pre class="programlisting">
#define roundup(x, y) ((x)%(y) ? ((x)/(y) + 1) * (y) : x)
</pre>
&#19968;&#27573;&#22914;&#19979;&#30340;&#27979;&#35797;&#31243;&#24207;&#21487;&#20197;&#30475;&#21040;&#23427;&#30340;&#20316;&#29992;&#65306;
<pre class="programlisting">
  int divisor = 0;
  printf("divisor\troundup\trounddown\n");
  for(; divisor &lt; 5; divisor++)
	  printf("%d:\t%d\t%d\n", divisor, roundup(divisor, 2), roundown(divisor, 2));
</pre>
&#36755;&#20986;&#32467;&#26524;&#22914;&#19979;&#65306;
<pre class="programlisting">
divisor	roundup	rounddown
0:	0	0
1:	2	0
2:	2	2
3:	4	2
4:	4	4
</pre>
&#20869;&#26680;&#25552;&#20379;&#30340;&#21478;&#19968;&#20010;&#23439;DIV_ROUND_UP&#29992;&#26469;&#23545;&#38500;&#27861;&#30340;&#32467;&#26524;&#36827;&#34892;&#22278;&#25972;&#65292;&#20063;&#21363;&#24635;&#26159;&#21462;&#22823;&#20110;n&#24182;&#25509;&#36817;n&#30340;&#37027;&#20010;&#25968;&#25972;&#38500;d&#21518;&#30340;&#32467;&#26524;&#12290;DIV_ROUND_UP&#31867;&#20284;&#20110;roundup&#65292;&#21482;&#26159;&#23569;&#20102;&#20056;&#30340;&#21160;&#20316;&#65292;&#21407;&#29702;&#20063;&#26159;&#30456;&#21516;&#30340;&#12290;
<pre class="programlisting">
#define DIV_ROUND_UP(n,d) (((n) + (d) - 1) / (d))
</pre>
DIV_ROUND_UP&#30340;&#22788;&#29702;&#32467;&#26524;&#22914;&#19979;&#65306;
<pre class="programlisting">
0, 0
1, 1
2, 1
3, 2
4, 2
</pre>
&#22278;&#25972;&#21487;&#20197;&#36890;&#36807;&#38500;&#27861;&#23454;&#29616;&#65292;&#21478;&#19968;&#31181;&#23454;&#29616;&#26041;&#24335;&#26159;&#36890;&#36807;&#23545;&#20302;&#27604;&#29305;&#20301;&#36827;&#34892;&#28165;0&#25805;&#20316;&#65292;&#20294;&#26159;&#23427;&#20204;&#21482;&#36866;&#21512;&#23545;&#23545;&#40784;&#21040;2&#30340;&#24130;&#25351;&#25968;&#30340;&#25805;&#20316;&#26377;&#25928;&#12290;
</div>
<div class="sect2" title="23.4. &#25968;&#25454;&#23545;&#40784;"><div class="titlepage"><div><div><h3 class="title"><a name="idp81942148"></a>23.4. &#25968;&#25454;&#23545;&#40784;</h3></div></div></div>
<p>
&#20869;&#26680;&#22312;&#26576;&#20123;&#24212;&#29992;&#20013;&#65292;&#20026;&#20102;&#23454;&#29616;&#26576;&#31181;&#26426;&#21046;&#65292;&#27604;&#22914;&#20998;&#39029;&#65292;&#25110;&#32773;&#25552;&#39640;&#35775;&#38382;&#25928;&#29575;&#38656;&#35201;&#20445;&#35777;&#25968;&#25454;&#25110;&#32773;&#25351;&#38024;&#22320;&#22336;&#23545;&#40784;&#21040;&#26576;&#20010;&#29305;&#23450;&#30340;&#25972;&#25968;&#20540;&#65292;&#27604;&#22914;&#36830;&#25509;&#20195;&#30721;&#33050;&#26412;&#12290;&#36825;&#20010;&#20540;&#24517;&#39035;&#26159;2<sup>N</sup>&#12290;&#25968;&#25454;&#23545;&#40784;&#65292;&#21487;&#20197;&#30475;&#20570;&#21521;&#19978;&#22278;&#25972;&#30340;&#19968;&#31181;&#36816;&#31639;&#12290;
</p><pre class="programlisting">
include/linux/kernel.h
#define ALIGN(x, a)              __ALIGN_MASK(x, (typeof(x))(a) - 1)
#define __ALIGN_MASK(x, mask)    (((x) + (mask))&amp;~(mask))
#define PTR_ALIGN(p, a)         ((typeof(p))ALIGN((unsigned long)(p), (a)))
#define IS_ALIGNED(x, a)        (((x) &amp; ((typeof(x))(a) - 1)) == 0)
</pre><p>
&#20869;&#26680;&#25552;&#20379;&#20102;&#20004;&#20010;&#29992;&#26469;&#23545;&#40784;&#30340;&#23439;ALIGN&#21644;PTR_ALIGN&#65292;&#19968;&#20010;&#23454;&#29616;&#25968;&#25454;&#23545;&#40784;&#65292;&#32780;&#21478;&#19968;&#20010;&#23454;&#29616;&#25351;&#38024;&#30340;&#23545;&#40784;&#12290;&#23427;&#20204;&#23454;&#29616;&#30340;&#26680;&#24515;&#37117;&#26159;__ALIGN_MASK&#65292;&#20854;&#20013;mask&#21442;&#25968;&#20026;&#20302;N&#20301;&#20840;&#20026;1&#65292;&#20854;&#20313;&#20301;&#20840;&#20026;0&#30340;&#25513;&#30721;&#65292;&#23427;&#20174;&#22278;&#25972;&#30446;&#26631;&#20540;2<sup>N</sup> - 1&#24471;&#21040;&#12290;__ALIGN_MASK&#24471;&#21040;&#23545;&#40784;&#20540;&#65292;&#23545;&#20110;&#25968;&#25454;&#26469;&#35828;&#30452;&#25509;&#36820;&#22238;&#21363;&#21487;&#65292;&#32780;&#23545;&#20110;&#25351;&#38024;&#21017;&#38656;&#35201;&#36827;&#34892;&#24378;&#21046;&#36716;&#25442;&#12290;IS_ALIGNED&#23439;&#29992;&#26469;&#21028;&#26029;&#24403;&#21069;&#20540;&#26159;&#21542;&#23545;&#40784;&#19982;&#25351;&#23450;&#30340;&#20540;&#12290;&#20869;&#26680;&#20013;&#30340;&#20998;&#39029;&#23545;&#40784;&#23439;&#23450;&#20041;&#22914;&#19979;&#65306;
</p><pre class="programlisting">
arch/arm/include/asm/page.h
/* PAGE_SHIFT determines the page size */
#define PAGE_SHIFT              12
#define PAGE_SIZE               (1UL &lt;&lt; PAGE_SHIFT)

include/linux/mm.h
/* to align the pointer to the (next) page boundary */
#define PAGE_ALIGN(addr) ALIGN(addr, PAGE_SIZE)
</pre><p>
PAGE_SIZE&#23450;&#20041;&#22312;&#20307;&#31995;&#26550;&#26500;&#30456;&#20851;&#30340;&#20195;&#30721;&#20013;&#65292;&#36890;&#24120;&#20026;4K&#12290;&#20869;&#26680;&#20013;&#25552;&#20379;&#30340;&#29305;&#24615;&#21151;&#33021;&#30340;&#23545;&#40784;&#23439;&#22343;&#26159;&#23545;ALIGN&#30340;&#25193;&#23637;&#12290;&#19979;&#38754;&#25552;&#20379;&#19968;&#20010;&#20195;&#30721;&#31034;&#20363;&#65292;&#24182;&#32473;&#20986;&#32467;&#26524;&#65306;
</p><pre class="programlisting">
#include &lt;stdio.h&gt;
......
int main()
{
  int a = 0 ,i = 0;
  int *p = &amp;a;

  for(; i &lt; 6; i++)
	  printf("ALIGN(%d, 4): %x\n", i, ALIGN(i, 4));
	
  printf("p:%p, PTR_ALIGN(p, 8): %p\n", p, PTR_ALIGN(p, 8));
  printf("IS_ALIGNED(7, 8): %d, IS_ALIGNED(16, 8): %d\n", IS_ALIGNED(7, 8), IS_ALIGNED(16, 8));
	
  return 0;
}
</pre><p>
&#23545;&#40784;&#23439;&#27979;&#35797;&#32467;&#26524;&#65306;
</p><pre class="programlisting">
ALIGN(0, 4): 0
ALIGN(1, 4): 4
......
ALIGN(4, 4): 4
ALIGN(5, 4): 8
p:0xbf96c01c, PTR_ALIGN(p, 8): 0xbf96c020
IS_ALIGNED(7, 8): 0, IS_ALIGNED(16, 8): 1
</pre><p>
</p><div class="figure"><a name="idp81946796"></a><p class="title"><b>&#22270; 134. &#25968;&#25454;&#23545;&#40784;&#22270;</b></p><div class="figure-contents"><div><img src="images/mode_align.gif" alt="&#25968;&#25454;&#23545;&#40784;&#22270;"></div></div></div><p><br class="figure-break">
	</p>
</div>
<div class="sect2" title="23.5. &#20301;&#22270;&#25805;&#20316;"><div class="titlepage"><div><div><h3 class="title"><a name="idp81947580"></a>23.5. &#20301;&#22270;&#25805;&#20316;</h3></div></div></div>
&#36890;&#36807;&#20301;&#22270;&#25552;&#20379;&#30340;&#20004;&#31181;&#29366;&#24577;&#21487;&#20197;&#22312;&#38750;&#24120;&#33410;&#32422;&#20869;&#23384;&#30340;&#24773;&#20917;&#19979;&#34920;&#31034;&#24320;&#20851;&#21464;&#37327;&#65292;&#24182;&#19988;&#21516;&#31867;&#36825;&#31867;&#21464;&#37327;&#21487;&#20197;&#32039;&#20945;&#32780;&#39640;&#25928;&#30340;&#32479;&#19968;&#36827;&#34892;&#22788;&#29702;&#12290;&#26377;&#24456;&#22810;&#20869;&#26680;&#23376;&#31995;&#32479;&#37117;&#38656;&#35201;&#20301;&#22270;&#30340;&#25903;&#25345;&#65292;&#20294;&#26159;&#19981;&#21516;&#30340;&#24773;&#20917;&#21448;&#38656;&#35201;&#19981;&#21516;&#30340;&#20301;&#22270;&#20010;&#25968;&#65292;&#27604;&#22914;SMP&#31995;&#32479;&#19978;&#30340;CPU&#20301;&#22270;cpumask&#30340;&#20301;&#25968;&#20301;NR_CPUS&#65292;&#32780;&#20869;&#23384;&#31649;&#29702;&#21306;&#30340;&#20301;&#22270;&#25968;&#20026;MAX_ZONES_PER_ZONELIST&#12290;&#20294;&#26159;&#25152;&#26377;&#30340;&#20301;&#22270;&#37117;&#35201;&#36716;&#25442;&#20026;&#22522;&#26412;&#30340;&#25968;&#25454;&#31867;&#22411;&#65292;&#27604;&#22914;int&#65292;short&#31561;&#65292;Linux&#23558;&#23450;&#20041;&#20301;&#22270;&#30340;&#21151;&#33021;&#38598;&#20013;&#21040;&#19968;&#20010;&#21517;&#20026;DECLARE_BITMAP&#30340;&#23439;&#12290;
<pre class="programlisting">
include/linux/types.h
#define DECLARE_BITMAP(name,bits) \
	unsigned long name[BITS_TO_LONGS(bits)]
</pre>
&#36825;&#37324;&#21487;&#20197;&#30475;&#21040;DECLARE_BITMAP&#30340;&#20316;&#29992;&#26159;&#23581;&#35797;&#23450;&#20041;&#19968;&#20010;&#31867;&#22411;&#20026;unsigned long&#65292;&#21517;&#23383;&#20026;name&#30340;&#25968;&#32452;&#12290;&#32780;&#25968;&#32452;&#30340;&#32500;&#24230;&#30001;&#20301;&#22270;&#20013;&#30340;&#20301;&#25968;&#36890;&#36807;BITS_TO_LONGS&#35745;&#31639;&#32780;&#24471;&#12290;
<pre class="programlisting">
include/linux/bitops.h
#define BITS_PER_BYTE		8
#define BITS_TO_LONGS(nr)	DIV_ROUND_UP(nr, BITS_PER_BYTE * sizeof(long))
</pre>
<p>BITS_TO_LONGS&#36890;&#36807;DIV_ROUND_UP&#23439;&#23436;&#25104;&#12290;DIV_ROUND_UP&#26681;&#25454;nr&#21442;&#25968;&#35745;&#31639;&#33267;&#23569;&#38656;&#35201;&#20960;&#20010;long&#22411;&#25165;&#33021;&#28385;&#36275;&#24403;&#21069;&#20301;&#22270;&#30340;&#38656;&#27714;&#12290;&#19981;&#30693;&#36947;&#20026;&#20160;&#20040;Linux&#19981;&#20351;&#29992;char&#22411;&#65292;&#36825;&#26679;&#19981;&#26159;&#26356;&#33410;&#32422;&#20869;&#23384;&#21527;&#65311;&#26174;&#28982;DECLARE_BITMAP&#30340;&#24341;&#20837;&#30340;&#26681;&#26412;&#30446;&#30340;&#24182;&#19981;&#26159;&#29992;&#26469;&#33410;&#32422;&#20869;&#23384;&#65292;&#32780;&#26159;&#26041;&#20415;&#23545;&#38271;&#20301;&#22270;&#30340;&#25805;&#20316;&#65292;&#32780;&#36890;&#24120;8&#20301;&#20301;&#22270;&#30340;&#23450;&#20041;&#24182;&#19981;&#36890;&#36807;&#23427;&#26469;&#23450;&#20041;&#65292;&#32780;&#26159;&#30452;&#25509;&#23450;&#20041;&#20301;&#25513;&#30721;&#65292;&#27604;&#22914;&#23545;&#25991;&#20214;&#26435;&#38480;&#30340;&#23450;&#20041;&#12290;</p>
<div class="figure"><a name="idp81950172"></a><p class="title"><b>&#22270; 135. &#22522;&#20110;&#26080;&#31526;&#21495;&#38271;&#25972;&#22411;&#30340;&#20301;&#22270;&#34920;&#31034;</b></p><div class="figure-contents"><div><img src="images/mode_bitmap.gif" alt="&#22522;&#20110;&#26080;&#31526;&#21495;&#38271;&#25972;&#22411;&#30340;&#20301;&#22270;&#34920;&#31034;"></div></div></div><br class="figure-break">
<p>&#20869;&#26680;&#23450;&#20041;&#20102;&#19968;&#31995;&#21015;&#30340;&#23439;&#21644;&#20989;&#25968;&#26469;&#23545;DECLARE_BITMAP&#23450;&#20041;&#30340;&#20301;&#22270;&#36827;&#34892;&#25805;&#20316;&#65292;&#23427;&#20204;&#20998;&#21035;&#20301;&#20110;bitmap.h&#21644;bitmap.c&#20013;&#12290;&#36825;&#20123;&#23439;&#21644;&#20989;&#25968;&#30340;&#25805;&#20316;&#24605;&#24819;&#26159;&#19968;&#33268;&#30340;&#12290;
</p><pre class="programlisting">
/arch/arm/include/asm/types.h
#define BITS_PER_LONG 32

include/linux/bitmap.h
static inline void bitmap_zero(unsigned long *dst, int nbits)
{
	if (nbits &lt;= BITS_PER_LONG)
		*dst = 0UL;
	else {
		int len = BITS_TO_LONGS(nbits) * sizeof(unsigned long);
		memset(dst, 0, len);
	}
}
</pre><p>
&#23613;&#31649;&#22312;&#29305;&#23450;&#20307;&#31995;&#30340;&#20195;&#30721;&#20013;BITS_PER_LONG&#34987;&#23450;&#20041;&#20026;32&#20197;&#22686;&#21152;&#36816;&#31639;&#36895;&#24230;&#65292;&#20294;&#26159;&#23427;&#26356;&#24212;&#35813;&#36890;&#36807;sizeof(long) * BITS_PER_BYTE&#26469;&#23450;&#20041;&#12290;bitmap_zero&#29992;&#26469;&#28165;&#31354;&#25152;&#26377;&#30340;&#20301;&#22270;&#12290;&#20998;&#26512;&#23427;&#21457;&#29616;&#65292;&#23427;&#39318;&#20808;&#21028;&#26029;&#26159;&#21542;&#36229;&#36807;&#19968;&#20010;long&#22411;&#65292;&#22914;&#26524;&#27809;&#26377;&#37027;&#20040;&#30452;&#25509;&#23545;&#23427;&#36171;&#20540;0UL&#21363;&#21487;&#12290;&#21542;&#21017;&#23601;&#35201;&#36890;&#36807;memset&#23545;&#25972;&#20010;&#25968;&#32452;&#36827;&#34892;&#25805;&#20316;&#12290;&#20854;&#20182;&#20989;&#25968;&#20134;&#21516;&#12290;&#19968;&#20123;&#24120;&#29992;&#30340;&#20301;&#22270;&#25805;&#20316;&#20989;&#25968;&#22914;&#19979;&#25152;&#31034;&#65306;
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">bitmap_zero &#28165;&#25152;&#26377;&#27604;&#29305;&#20301;&#20026;0&#65292;&#34987;&#29992;&#26469;&#21021;&#22987;&#21270;&#20301;&#22270;&#12290;&#22278;&#25972;&#21040;unsigned long&#12290;</li><li class="listitem">bitmap_fill &#32622;nbits&#25351;&#23450;&#20010;&#25968;&#30340;&#27604;&#29305;&#20301;&#20026;1&#12290;&#31934;&#30830;&#21040;&#20301;&#12290;</li><li class="listitem">bitmap_copy &#20174;src&#22797;&#21046;&#25152;&#26377;&#27604;&#29305;&#20301;&#21040;dst&#12290;&#22278;&#25972;&#21040;unsigned long&#12290;</li><li class="listitem">bitmap_and &#23558;nbits&#25351;&#23450;&#30340;&#20301;&#25968;&#25353;&#20301;&#19982;&#32467;&#26524;&#23384;&#25918;&#21040;dst&#12290;&#22278;&#25972;&#21040;unsigned long&#12290;</li><li class="listitem">bitmap_or &#23558;nbits&#25351;&#23450;&#30340;&#20301;&#25968;&#25353;&#20301;&#25110;&#32467;&#26524;&#23384;&#25918;&#21040;dst&#12290;&#22278;&#25972;&#21040;unsigned long&#12290;</li><li class="listitem">bitmap_xor &#23558;nbits&#25351;&#23450;&#30340;&#20301;&#25968;&#25353;&#20301;&#24322;&#25110;&#32467;&#26524;&#23384;&#25918;&#21040;dst&#12290;&#22278;&#25972;&#21040;unsigned long&#12290;</li><li class="listitem">bitmap_andnot &#26681;&#25454;nbits&#25351;&#23450;&#30340;&#20301;&#25968;, &#23558;src1&#25353;&#20301;&#19982;&#19978;src2&#30340;&#25353;&#20301;&#38750;&#65292;&#32467;&#26524;&#23384;&#25918;&#21040;dst&#12290;&#22278;&#25972;&#21040;unsigned long&#12290;</li><li class="listitem">bitmap_complement &#26681;&#25454;nbits&#25351;&#23450;&#30340;&#20301;&#25968;, &#25353;&#20301;&#21462;&#21453;&#21518;&#23384;&#25918;&#21040;dst&#12290;&#31934;&#30830;&#21040;&#20301;&#12290;</li><li class="listitem">bitmap_equal &#27604;&#36739;nbits&#25351;&#23450;&#30340;&#20301;&#25968;&#65292;&#22914;&#26524;&#36825;&#20123;&#20026;&#20840;&#37096;&#30456;&#21516;&#36820;&#22238;1&#65292;&#21542;&#21017;&#36820;&#22238;0&#12290;&#31934;&#30830;&#21040;&#20301;&#12290;</li><li class="listitem">bitmap_intersects &#27604;&#36739;nbits&#25351;&#23450;&#30340;&#20301;&#25968;&#20013;&#26159;&#21542;&#26377;&#37325;&#21512;(&#30456;&#20132;Overlap)&#30340;1&#27604;&#29305;&#20301;&#65292;&#20063;&#21363;src1&#21644;src2&#20013;&#26377;&#20849;&#21516;&#35774;&#32622;&#20026;1&#30340;&#26631;&#24535;&#20301;&#12290;&#26377;&#21017;&#36820;&#22238;1&#65292;&#21542;&#21017;&#36820;&#22238;0&#12290;&#31934;&#30830;&#21040;&#20301;&#12290;</li><li class="listitem">bitmap_subset src1&#30340;nbits&#25351;&#23450;&#20301;&#25968;&#20013;&#35774;&#32622;1&#30340;&#27604;&#29305;&#20301;&#26159;src2&#20013;nbits&#25351;&#23450;&#20301;&#25968;&#20013;&#35774;&#32622;1&#30340;&#27604;&#29305;&#30340;&#23376;&#38598;&#65292;&#21017;&#36820;&#22238;1&#65292;&#21542;&#21017;&#36820;&#22238;0&#12290;&#31934;&#30830;&#21040;&#20301;&#12290;</li><li class="listitem">bitmap_empty &#27979;&#35797;src&#20013;&#30340;&#20302;nbits&#20301;&#26159;&#21542;&#20840;&#20026;0&#65292;&#26159;&#21017;&#36820;&#22238;1&#65292;&#21542;&#21017;&#36820;&#22238;0&#12290;&#31934;&#30830;&#21040;&#20301;&#12290;</li><li class="listitem">bitmap_full &#27979;&#35797;src&#20013;&#30340;&#20302;nbits&#20301;&#26159;&#21542;&#20840;&#20026;1&#65292;&#26159;&#21017;&#36820;&#22238;1&#65292;&#21542;&#21017;&#36820;&#22238;0&#12290;&#31934;&#30830;&#21040;&#20301;&#12290;</li><li class="listitem">bitmap_weight &#36820;&#22238;&#20302;nbits&#20301;&#30340;&#27721;&#26126;&#37325;&#37327;(Hamming Weight)&#12290;</li><li class="listitem">bitmap_shift_right &#36923;&#36753;&#21491;&#31227;n&#20301;&#65292;&#24038;&#36793;&#34917;0&#12290;n&#21487;&#20197;&#22823;&#20110;nbits&#25968;&#12290;&#22278;&#25972;&#21040;unsigned long&#12290;</li><li class="listitem">bitmap_shift_left &#36923;&#36753;&#24038;&#31227;n&#20301;&#65292;&#21491;&#36793;&#34917;0&#12290;n&#21487;&#20197;&#22823;&#20110;nbits&#25968;&#12290;&#22278;&#25972;&#21040;unsigned long&#12290;</li></ul></div><p>
</p>
</div>
<div class="sect2" title="23.6. &#32467;&#26500;&#20307;&#25104;&#21592;&#20114;&#35775;"><div class="titlepage"><div><div><h3 class="title"><a name="idp81957740"></a>23.6. &#32467;&#26500;&#20307;&#25104;&#21592;&#20114;&#35775;</h3></div></div></div>
<p>
&#30001;&#20110;&#20869;&#26680;&#20013;&#23450;&#20041;&#20102;&#24456;&#22810;&#22797;&#26434;&#30340;&#25968;&#25454;&#32467;&#26500;&#65292;&#32780;&#23427;&#20204;&#30340;&#23454;&#20363;&#20013;&#30340;&#25104;&#21592;&#22312;&#20316;&#20026;&#20989;&#25968;&#21442;&#25968;&#20256;&#36882;&#30340;&#26102;&#65292;&#20989;&#25968;&#20013;&#21487;&#33021;&#38656;&#35201;&#23545;&#23427;&#30340;&#21253;&#21547;&#32773;&#20013;&#30340;&#20854;&#20182;&#30340;&#20804;&#24351;&#25104;&#21592;&#36827;&#34892;&#22788;&#29702;&#65292;&#36825;&#23601;&#38656;&#35201;&#21482;&#26681;&#25454;&#25104;&#21592;&#22320;&#22336;&#23601;&#21487;&#20197;&#33719;&#21462;&#25972;&#20010;&#32467;&#26500;&#20307;&#21464;&#37327;&#30340;&#22320;&#22336;&#30340;&#25805;&#20316;&#12290;container_of&#25552;&#20379;&#20102;&#36825;&#26679;&#30340;&#25805;&#20316;&#65306;
</p><pre class="programlisting">
include/linux/kernel.h
/**
 * container_of - cast a member of a structure out to the containing structure
 * @ptr:        the pointer to the member.
 * @type:       the type of the container struct this is embedded in.
 * @member:     the name of the member within the struct.
 *
 */
#define container_of(ptr, type, member) ({                      \
        const typeof( ((type *)0)-&gt;member ) *__mptr = (ptr);    \
        (type *)( (char *)__mptr - offsetof(type,member) );})
</pre><p>
&#24039;&#22919;&#38590;&#20026;&#26080;&#31859;&#20043;&#28810;&#65292;&#26080;&#35770;&#22914;&#20309;&#65292;&#37117;&#38656;&#35201;&#21578;&#30693;container_of&#35813;&#25972;&#20307;&#32467;&#26500;&#20307;&#21464;&#37327;&#30340;&#31867;&#22411;&#20197;&#21450;&#24403;&#21069;&#25104;&#21592;&#30340;&#25351;&#38024;&#21644;&#25104;&#21592;&#21517;&#12290;typeof&#29992;&#26469;&#33719;&#21462;&#25104;&#21592;&#30340;&#31867;&#22411;&#24182;&#23450;&#20041;&#19968;&#20010;&#20020;&#26102;&#21464;&#37327;__mptr&#26469;&#23384;&#20648;&#24403;&#21069;&#25104;&#21592;&#30340;&#22320;&#22336;&#12290;offsetof&#29992;&#26469;&#33719;&#21462;&#24403;&#21069;&#25104;&#21592;&#30456;&#23545;&#20110;&#25972;&#20307;&#32467;&#26500;&#20307;&#22320;&#22336;&#30340;&#20559;&#31227;&#12290;&#23427;&#23450;&#20041;&#20026;&#65306;
</p><pre class="programlisting">
include/linux/compiler-gcc4.h
#define __compiler_offsetof(a,b) __builtin_offsetof(a,b)

include/linux/stddef.h
#ifdef __compiler_offsetof
#define offsetof(TYPE,MEMBER) __compiler_offsetof(TYPE,MEMBER)
#else
#define offsetof(TYPE, MEMBER) ((size_t) &amp;((TYPE *)0)-&gt;MEMBER)
#endif
</pre><p>
&#22914;&#26524;&#23450;&#20041;&#20102;__compiler_offsetof&#65292;&#21017;&#20351;&#29992;Gcc&#32534;&#35793;&#22120;&#20869;&#24314;&#30340;offsetof&#23439;&#65292;&#23427;&#30340;&#20316;&#29992;&#21644;&#27492;&#22788;&#23450;&#20041;&#30340;offsetof&#30456;&#21516;&#12290;&#23427;&#23558;0&#22320;&#22336;&#20316;&#20026;&#24403;&#21069;&#32467;&#26500;&#30340;&#39318;&#22320;&#22336;&#65292;&#20174;&#32780;&#30452;&#25509;&#36890;&#36807;&#25351;&#38024;&#35775;&#38382;&#25104;&#21592;&#24471;&#21040;&#30340;&#22320;&#22336;&#21363;&#20026;&#20559;&#31227;&#12290;&#23558;&#23454;&#38469;&#20351;&#29992;&#30340;&#32467;&#26500;&#20307;&#20013;&#30340;&#25104;&#21592;&#25351;&#38024;__mptr&#20943;&#21435;offsetof&#65292;&#23601;&#24471;&#21040;&#20102;&#32467;&#26500;&#20307;&#30340;&#22320;&#22336;&#12290;
</p><pre class="programlisting">
#include &lt;stdio.h&gt;
......
typedef struct man
{
	char name[32];
	unsigned int id;	
	unsigned char age;
	char address[64];
}man_t;

int main()
{
	man_t tom = {"Tom", 0, 24, "ShangHai China"};
	man_t *man = NULL;
	
	printf("tom:%p, tom.age:%p, offsetof(man_t, age): %d\n", 
					&amp;tom, &amp;tom.age, offsetof(man_t, age));
					
	man = container_of(&amp;tom.age, man_t, age);
	printf("tom.name:%s, tom.id:%d, tom.age:%u, tom.address:%s\n", 
					man-&gt;name, man-&gt;id, man-&gt;age, man-&gt;address);
	
	return 0;
}
</pre><p>
&#27979;&#35797;&#32467;&#26524;&#22914;&#19979;&#65306;
</p><pre class="programlisting">
tom:0xbf85cda4, tom.age:0xbf85cdc8, offsetof(man_t, age): 36
tom.name:Tom, tom.id:0, tom.age:24, tom.address:ShangHai China
</pre><p>
</p>
</div>
<div class="sect2" title="23.7. &#32467;&#26500;&#20307;&#22823;&#23567;&#36816;&#31639;"><div class="titlepage"><div><div><h3 class="title"><a name="idp81962156"></a>23.7. &#32467;&#26500;&#20307;&#22823;&#23567;&#36816;&#31639;</h3></div></div></div>
<div class="sect3" title="23.7.1. FIELD_SIZEOF&#33719;&#21462;&#25104;&#21592;&#22823;&#23567;"><div class="titlepage"><div><div><h4 class="title"><a name="idp81962444"></a>23.7.1. FIELD_SIZEOF&#33719;&#21462;&#25104;&#21592;&#22823;&#23567;</h4></div></div></div>
FIELD_SIZEOF&#29992;&#26469;&#33719;&#21462;&#25104;&#21592;&#22823;&#23567;&#12290;&#23427;&#38656;&#35201;&#20004;&#20010;&#21442;&#25968;&#65292;&#31532;&#19968;&#20010;&#25351;&#23450;&#32467;&#26500;&#20307;&#30340;&#31867;&#22411;&#65292;&#31532;&#20108;&#20010;&#21017;&#25351;&#26126;&#25104;&#21592;&#30340;&#21517;&#23383;&#12290;
<pre class="programlisting">
include/linux/kernel.h
#define FIELD_SIZEOF(t, f) (sizeof(((t*)0)-&gt;f))
</pre>
&#23427;&#36890;&#36807;&#23545;0&#25351;&#38024;&#28789;&#27963;&#36816;&#29992;&#65292;&#26159;&#23545;sizeof&#30340;&#19968;&#31181;&#21464;&#30456;&#25193;&#23637;&#12290;
</div>
<div class="sect3" title="23.7.2. ARRAY_SIZE&#33719;&#21462;&#25968;&#32452;&#32500;&#25968;"><div class="titlepage"><div><div><h4 class="title"><a name="idp81963468"></a>23.7.2. ARRAY_SIZE&#33719;&#21462;&#25968;&#32452;&#32500;&#25968;</h4></div></div></div>
ARRAY_SIZE&#29992;&#26469;&#33719;&#21462;&#19968;&#32500;&#25110;&#32773;&#22810;&#32500;&#25968;&#32452;&#30340;&#31532;&#19968;&#32500;&#22823;&#23567;&#65292;&#24182;&#23545;&#38750;&#25968;&#32452;&#25351;&#38024;&#36827;&#34892;&#21512;&#27861;&#24615;&#26816;&#26597;&#12290;
<pre class="programlisting">
include/linux/kernel.h
#define ARRAY_SIZE(arr) (sizeof(arr) / sizeof((arr)[0]) + __must_be_array(arr))
</pre>
&#23427;&#30340;&#24605;&#24819;&#24456;&#31616;&#21333;&#65292;&#23601;&#26159;&#36890;&#36807;sizeof&#33719;&#21462;&#25972;&#20010;&#25968;&#32452;&#22823;&#22823;&#23567;&#65292;&#28982;&#21518;&#38500;&#20197;&#21333;&#20010;&#25968;&#32452;&#20803;&#32032;&#30340;&#22823;&#23567;&#12290;__must_be_array&#29992;&#26469;&#26816;&#26597;arr&#21442;&#25968;&#26159;&#21542;&#20026;&#25968;&#32452;&#25351;&#38024;&#12290;&#22312;gcc&#20013;&#23427;&#34987;&#25903;&#25345;&#65292;&#20854;&#20182;&#32534;&#35793;&#22120;&#21487;&#33021;&#23558;&#23427;&#30452;&#25509;&#23450;&#20041;&#20026;0&#65306;
<pre class="programlisting">
include/linux/kernel.h
#define BUILD_BUG_ON_ZERO(e) (sizeof(char[1 - 2 * !!(e)]) - 1)

include/linux/compiler-gcc.h
#define __must_be_array(a) \
  BUILD_BUG_ON_ZERO(__builtin_types_compatible_p(typeof(a), typeof(&amp;a[0])))
</pre>
__builtin_types_compatible_p&#26159;gcc&#32534;&#35793;&#22120;&#30340;&#20869;&#23884;&#20989;&#25968;&#65292;&#23427;&#29992;&#20110;&#21028;&#26029;&#19968;&#20010;&#21464;&#37327;&#30340;&#31867;&#22411;&#26159;&#21542;&#20026;&#26576;&#25351;&#23450;&#30340;&#31867;&#22411;&#65292;&#20551;&#22914;&#26159;&#23601;&#36820;&#22238;1&#65292;&#21542;&#21017;&#36820;&#22238;0&#12290;&#36825;&#37324;&#36890;&#36807;&#21028;&#26029;&#25351;&#38024;&#21644;&#25351;&#38024;&#25351;&#21521;&#30340;&#31532;&#19968;&#20010;&#20803;&#32032;&#30340;&#25351;&#38024;&#26159;&#21542;&#26159;&#30456;&#21516;&#31867;&#22411;&#26469;&#21028;&#26029;&#26159;&#21542;&#20026;&#25968;&#32452;&#12290;BUILD_BUG_ON_ZERO&#30340;&#20316;&#29992;&#22312;&#20110;&#23558;&#36820;&#22238;&#20540;&#36716;&#21270;&#20026;&#32534;&#35793;&#38169;&#35823;&#20449;&#24687;&#12290;&#26174;&#28982;&#24403;&#20869;&#23884;&#20989;&#25968;&#36820;&#22238;&#20540;&#20026;0&#26102;&#65292;&#20063;&#21363;&#31867;&#22411;&#30456;&#21516;&#26102;&#65292;&#30001;&#20110;BUILD_BUG_ON_ZERO&#21442;&#25968;&#20026;&#38750;0&#32780;&#23548;&#33268;char[-1]&#32780;&#21457;&#20986;&#32534;&#35793;&#22120;&#35686;&#21578;&#12290;&#32463;&#36807;&#20197;&#19978;&#20998;&#26512;&#20063;&#24456;&#23481;&#26131;&#20889;&#20986;&#21028;&#26029;&#25968;&#32452;&#25351;&#38024;&#30340;&#23439;&#65292;&#22914;&#26524;&#26159;&#36820;&#22238;1&#65292;&#21542;&#21017;&#36820;&#22238;0&#12290;
<pre class="programlisting">
#define IS_ARRAY_PTR(p)	(!__builtin_types_compatible_p(typeof(p), typeof(&amp;p[0])))
</pre>
&#26080;&#35770;&#26159;ARRAY_SIZE&#36824;&#26159;&#25193;&#23637;&#30340;IS_ARRAY_PTR&#23439;&#65292;&#23427;&#20204;&#21482;&#25509;&#21463;&#26126;&#30830;&#30340;&#25351;&#38024;&#21442;&#25968;&#21517;&#65292;&#32780;&#26080;&#27861;&#25509;&#21463;&amp;a&#36825;&#26679;&#30340;&#21442;&#25968;&#65292;&#36825;&#26159;&#30001;&#20110;&#23439;&#30340;&#25193;&#23637;&#24341;&#36215;&#30340;&#65292;&#25253;&#38169;&#20449;&#24687;&#22914;&#19979;&#65306;
<pre class="programlisting">
xxx.c:17: error: subscripted value is neither array nor pointer
</pre>
</div>
</div>
<div class="sect2" title="23.8. &#32534;&#35793;&#22120;&#26816;&#26597;"><div class="titlepage"><div><div><h3 class="title"><a name="idp81967020"></a>23.8. &#32534;&#35793;&#22120;&#26816;&#26597;</h3></div></div></div>
&#23613;&#31649;&#22312;&#22823;&#22810;&#25968;&#26102;&#20505;&#21482;&#38656;&#20851;&#24515;&#20195;&#30721;&#36816;&#34892;&#30340;&#27491;&#30830;&#24615;&#65292;&#20294;&#26159;&#24456;&#22810;&#26102;&#20505;&#38656;&#35201;&#22312;&#32534;&#35793;&#26399;&#38388;&#23601;&#21457;&#29616;&#36825;&#20123;&#28508;&#22312;&#30340;&#33268;&#21629;&#38169;&#35823;&#12290;&#20869;&#26680;&#25552;&#20379;&#20102;&#20004;&#20010;&#26377;&#21147;&#30340;&#23439;&#23450;&#20041;&#65306;
<pre class="programlisting">
include/linux/kernel.h
/* Force a compilation error if condition is true */
#define BUILD_BUG_ON(condition) ((void)sizeof(char[1 - 2*!!(condition)]))

/* Force a compilation error if condition is true, but also produce a
   result (of value 0 and type size_t), so the expression can be used
   e.g. in a structure initializer (or where-ever else comma expressions
   aren't permitted). */
#define BUILD_BUG_ON_ZERO(e) (sizeof(char[1 - 2 * !!(e)]) - 1)
</pre>
<p>&#27880;&#24847;&#26680;&#24515;&#34920;&#36798;&#24335;sizeof(char[1 - 2*!!(condition)])&#30340;&#20316;&#29992;&#65292;&#39318;&#20808;&#23545;&#26465;&#20214;&#34920;&#36798;&#24335;&#36827;&#34892;&#20004;&#27425;&#21462;&#21453;&#65292;&#36825;&#21487;&#20197;&#20445;&#35777;&#36827;&#34892;1 - 2*!!(condition)&#30340;&#32467;&#26524;&#21482;&#26377;&#20004;&#31181;&#20540;&#65306;&#26465;&#20214;&#20026;0&#26102;&#32467;&#26524;&#20026;1&#25110;&#32773;&#19981;&#20026;0&#21017;&#32467;&#26524;&#20026;-1&#65292;&#26174;&#28982;char[-1]&#23558;&#20250;&#23548;&#33268;&#32534;&#35793;&#22120;&#25253;&#38169;&#12290;</p>
<div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">BUILD_BUG_ON&#65306;&#21482;&#26377;&#26465;&#20214;condition&#20026;0&#26102;&#21487;&#32534;&#35793;&#65292;&#20294;&#19981;&#36820;&#22238;&#20540;&#65292;&#21542;&#21017;&#32534;&#35793;&#22120;&#25253;&#38169;&#12290;</li><li class="listitem">BUILD_BUG_ON_ZERO&#65306;&#21482;&#26377;&#26465;&#20214;e&#20026;0&#26102;&#36820;&#22238;0&#65292;&#21542;&#21017;&#32534;&#35793;&#22120;&#25253;&#38169;&#12290;</li></ul></div>
&#24635;&#32467;&#65306;BUILD_BUG_ON&#21644;BUILD_BUG_ON_ZERO&#20316;&#29992;&#31867;&#20284;&#65292;&#37117;&#26159;&#22312;&#21442;&#25968;&#20026;&#38750;0&#26102;&#32534;&#35793;&#25253;&#38169;&#65292;&#20294;&#26159;BUILD_BUG_ON_ZERO&#21487;&#20197;&#36820;&#22238;0&#20540;&#65292;BUILD_BUG_ON&#19981;&#21487;&#12290;&#32534;&#35793;&#22120;&#35686;&#21578;&#30340;&#26684;&#24335;&#22914;&#19979;&#65292;&#36825;&#19982;char[-1]&#30340;&#38169;&#35823;&#23450;&#20041;&#30456;&#19968;&#33268;&#12290;&#22914;&#26524;&#19981;&#29087;&#24713;&#23427;&#65292;&#37027;&#20040;&#23558;&#24456;&#38590;&#26681;&#25454;&#35686;&#21578;&#25214;&#21040;&#20986;&#38169;&#30340;&#30495;&#27491;&#20301;&#32622;&#65306;
<pre class="programlisting">
xxx.c:42: error: size of array &#8216;type name&#8217; is negative
</pre>
&#30446;&#21069;&#20869;&#26680;&#23545;BUILD_BUG_ON_ZERO&#30340;&#20351;&#29992;&#26377;&#20004;&#22788;&#65306;&#19968;&#20010;&#26159;&#22312;&#25968;&#32452;&#22823;&#23567;&#35745;&#31639;&#20013;&#29992;&#26469;&#21028;&#23450;&#25351;&#38024;&#21512;&#27861;&#34892;&#30340;__must_be_array&#23439;&#12290;&#21478;&#19968;&#20010;&#26159;&#23545;&#27169;&#22359;&#21442;&#25968;&#36827;&#34892;&#26435;&#38480;&#26816;&#26597;&#26102;&#30340;__module_param_call&#23439;&#12290;<br>&#20869;&#26680;&#23545;BUILD_BUG_ON&#30340;&#20351;&#29992;&#21017;&#35201;&#26222;&#36941;&#30340;&#22810;&#65292;&#23427;&#34987;&#29992;&#26469;&#20570;&#32534;&#35793;&#26399;&#38388;&#30340;&#21442;&#25968;&#26816;&#26597;&#65292;&#24191;&#27867;&#23384;&#22312;&#20110;&#20869;&#26680;&#30340;&#28304;&#30721;&#25991;&#20214;&#20013;&#12290;&#26576;&#20123;&#24773;&#20917;&#19979;&#38656;&#35201;&#19968;&#20010;&#25968;&#25454;&#32467;&#26500;&#28385;&#36275;&#29305;&#23450;&#30340;&#22823;&#23567;&#65292;&#27604;&#22914;jffs2&#25991;&#20214;&#31995;&#32479;&#20013;&#30340;jffs2_raw_inode&#32467;&#26500;&#30340;&#22823;&#23567;&#24517;&#39035;&#20026;68&#12290;&#21478;&#22806;&#21487;&#33021;&#38656;&#35201;&#20026;&#20102;&#20860;&#23481;&#24615;&#32771;&#34385;&#65292;&#21487;&#33021;&#38656;&#35201;&#23450;&#20041;&#19968;&#20123;&#21035;&#21517;&#65292;&#27604;&#22914;&#65306;
<pre class="programlisting">
include/linux/net.h
#define SOCK_CLOEXEC    O_CLOEXEC
</pre>
&#21017;&#21487;&#20197;&#22312;&#32534;&#30721;&#26102;&#26816;&#27979;&#26159;&#21542;&#23450;&#20041;&#27491;&#30830;&#65306;
<pre class="programlisting">
net/socket.c
BUILD_BUG_ON(SOCK_CLOEXEC != O_CLOEXEC);
</pre>
&#22823;&#22810;&#25968;&#24773;&#20917;&#19979;&#65292;&#23427;&#20204;&#23646;&#20110;&#35843;&#35797;&#20449;&#24687;&#65292;&#22312;&#35843;&#35797;&#23436;&#27605;&#21518;&#38656;&#35201;&#31227;&#38500;&#65292;&#38500;&#38750;&#23427;&#20204;&#21487;&#20197;&#25351;&#31034;&#19968;&#20123;&#29305;&#23450;&#30340;&#20449;&#24687;&#65292;&#27604;&#22914;&#31532;&#19968;&#31181;&#24773;&#20917;&#29992;&#26469;&#24378;&#35843;&#25968;&#25454;&#32467;&#26500;&#30340;&#22823;&#23567;&#20026;&#22266;&#23450;&#20540;&#12290;&#19968;&#20010;&#35814;&#32454;&#30340;&#31034;&#20363;&#22914;&#19979;&#65292;&#22914;&#26524;struct map&#32467;&#26500;&#20307;&#30340;&#22823;&#23567;&#19981;&#20026;32&#65292;&#21017;&#32534;&#35793;&#26102;&#25253;&#38169;&#12290;
<pre class="programlisting">
struct map
{
  int used[2];		/* 8 */
  int empty[5];		/* 20 */	
	
  char pad[32 - 28];
} men = {{1, 2}, {0, 3, 4, 5, 6}};

int main()
{
  BUILD_BUG_ON(sizeof(men) != 32);
  printf("BUILD_BUG_ON_ZERO(0):%d, %d\n", BUILD_BUG_ON_ZERO(0), sizeof(men));
	
  return 0;
}
</pre>
</div>
</div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ar01s22.html">&#19978;&#19968;&#39029;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="ar01s24.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">22. &#32593;&#32476;&#35774;&#22791;&#39537;&#21160; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top"> 24. &#38468;&#24405;</td></tr></table></div></body></html>
