<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>20. &#20869;&#26680;&#21516;&#27493;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL-NS Stylesheets V1.75.2"><link rel="home" href="index.html" title="Linux&#20869;&#26680;&#23398;&#20064;&#21644;&#30740;&#31350;&#21450;&#23884;&#20837;&#24335;(ARM)&#23398;&#20064;&#21644;&#30740;&#31350;&#30340;&#24320;&#25918;&#25991;&#26723;"><link rel="up" href="index.html" title="Linux&#20869;&#26680;&#23398;&#20064;&#21644;&#30740;&#31350;&#21450;&#23884;&#20837;&#24335;(ARM)&#23398;&#20064;&#21644;&#30740;&#31350;&#30340;&#24320;&#25918;&#25991;&#26723;"><link rel="prev" href="ar01s19.html" title="19. &#20869;&#26680;&#36890;&#30693;&#38142;"><link rel="next" href="ar01s21.html" title="21. Linux&#35774;&#22791;&#27169;&#22411;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">20. &#20869;&#26680;&#21516;&#27493;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ar01s19.html">&#19978;&#19968;&#39029;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="ar01s21.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="sect1" title="20. &#20869;&#26680;&#21516;&#27493;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="idp81612500"></a>20. &#20869;&#26680;&#21516;&#27493;</h2></div></div></div>
<p>
&#30001;&#20110;&#23545;&#21516;&#19968;&#36164;&#28304;&#30340;&#35775;&#38382;&#20195;&#30721;&#21487;&#33021;&#20174;&#22810;&#20010;&#36335;&#24452;&#35302;&#21457;&#24182;&#24471;&#21040;&#25191;&#34892;(&#27604;&#22914;&#65306;SMP&#65292;&#20869;&#26680;&#32447;&#31243;&#65292;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#65292;&#36719;&#20013;&#26029;&#22788;&#29702;&#20989;&#25968;&#65292;&#31995;&#32479;&#35843;&#29992;&#20195;&#34920;&#30340;&#29992;&#25143;&#31243;&#24207;&#22312;&#35843;&#24230;&#20013;&#20307;&#29616;&#20986;&#30340;&#24182;&#21457;&#35775;&#38382;&#31561;)&#65292;&#32780;&#22312;&#35775;&#38382;&#35813;&#36164;&#28304;&#30340;&#20195;&#30721;&#25191;&#34892;&#36807;&#31243;&#20013;&#34987;&#25171;&#26029;&#65292;&#24182;&#22312;&#25171;&#26029;&#21644;&#37325;&#26032;&#25191;&#34892;&#26399;&#38388;&#65292;&#25191;&#34892;&#20102;&#20854;&#20182;&#36335;&#24452;&#24341;&#21457;&#30340;&#21516;&#19968;&#36164;&#28304;&#35775;&#38382;&#30340;&#20195;&#30721;&#65292;&#23558;&#36896;&#25104;&#24847;&#26009;&#20043;&#22806;&#30340;&#32467;&#26524;&#12290;
</p>
<p>
&#20026;&#20102;&#26356;&#22909;&#22320;&#29702;&#35299;&#20869;&#26680;&#20195;&#30721;&#26159;&#22914;&#20309;&#25191;&#34892;&#30340;&#65292;&#25105;&#20204;&#25226;&#20869;&#26680;&#30475;&#20570;&#24517;&#39035;&#28385;&#36275;&#20197;&#19979;&#20960;&#31181;&#35831;&#27714;&#30340;&#20365;&#32773;&#65306;&#19968;&#31181;&#35831;&#27714;&#26469;&#33258;&#26222;&#36890;&#30340;&#39038;&#23458;&#65292;&#21478;&#19968;&#31181;&#35831;&#27714;&#26469;&#33258;&#25968;&#37327;&#26377;&#38480;&#20294;&#26159;&#25317;&#26377;VIP&#31561;&#32423;&#36164;&#26684;&#30340;&#39038;&#23458;&#65292;&#36824;&#26377;&#19968;&#31181;&#35831;&#27714;&#26469;&#33258;&#24215;&#32769;&#26495;&#12290;&#23545;&#19981;&#21516;&#30340;&#35831;&#27714;&#65292;&#20365;&#32773;&#37319;&#29992;&#22914;&#19979;&#30340;&#31574;&#30053;&#65306;
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">&#20365;&#32773;&#20026;&#26222;&#36890;&#39038;&#23458;&#20381;&#27425;&#26381;&#21153;&#65292;&#25110;&#32773;&#31354;&#38386;&#12290;</li><li class="listitem">VIP&#39038;&#23458;&#25552;&#20986;&#35831;&#27714;&#26102;&#65292;&#22914;&#26524;&#20365;&#32773;&#27491;&#31354;&#38386;&#65292;&#21017;&#20365;&#32773;&#24320;&#22987;&#20026;&#20854;&#26381;&#21153;&#12290;&#22914;&#26524;&#27491;&#22312;&#20026;&#26222;&#36890;&#39038;&#23458;&#26381;&#21153;&#65292;&#37027;&#20040;&#20365;&#32773;&#20572;&#27490;&#26381;&#21153;&#65292;&#24320;&#22987;&#20026;VIP&#39038;&#23458;&#26381;&#21153;&#12290;</li><li class="listitem">&#22914;&#26524;&#20365;&#32773;&#27491;&#22312;&#20026;VIP&#39038;&#23458;&#26381;&#21153;&#65292;&#21478;&#19968;&#20010;&#26356;&#39640;&#32423;&#19968;&#32423;&#30340;VIP&#23458;&#25143;&#21457;&#20986;&#35831;&#27714;&#65292;&#37027;&#20040;&#20013;&#26029;VIP&#39038;&#23458;&#30340;&#26381;&#21153;&#65292;&#28982;&#21518;&#20026;&#39640;&#32423;VIP&#23458;&#25143;&#26381;&#21153;&#65292;&#26381;&#21153;&#23436;&#27605;&#21518;&#20877;&#20026;&#21407;VIP&#39038;&#23458;&#26381;&#21153;&#12290;</li><li class="listitem">&#22914;&#26524;&#20365;&#32773;&#27491;&#22312;&#20026;&#39038;&#23458;&#26381;&#21153;&#65292;&#24182;&#19988;&#19981;&#31649;&#26159;&#26222;&#36890;&#39038;&#23458;&#65292;&#36824;&#26159;VIP&#32423;&#24456;&#39640;&#30340;&#23458;&#25143;&#65292;&#24403;&#32769;&#26495;&#21629;&#20196;&#20365;&#32773;&#20572;&#27490;&#23427;&#30340;&#26381;&#21153;&#65292;&#32780;&#25191;&#34892;&#26032;&#30340;&#26381;&#21153;&#20219;&#21153;&#65292;&#20365;&#32773;&#27492;&#26102;&#22312;&#23436;&#25104;&#32769;&#26495;&#30340;&#20219;&#21153;&#21518;&#65292;&#21487;&#33021;&#26242;&#26102;&#24182;&#19981;&#29702;&#20250;&#21407;&#26469;&#30340;&#39038;&#23458;&#32780;&#21435;&#20026;&#26032;&#36873;&#20013;&#30340;&#39038;&#23458;&#26381;&#21153;&#12290;</li></ul></div><p>
&#20365;&#32773;&#25552;&#20379;&#30340;&#26381;&#21153;&#23545;&#24212;&#20110;CPU&#22788;&#20110;&#20869;&#26680;&#24577;&#26102;&#25152;&#25191;&#34892;&#30340;&#20195;&#30721;&#12290;&#22914;&#26524;CPU&#22312;&#29992;&#25143;&#24577;&#25191;&#34892;&#65292;&#21017;&#35748;&#20026;&#20365;&#32773;&#22788;&#20110;&#31354;&#38386;&#29366;&#24577;&#12290;
</p>
<p>
&#26222;&#36890;&#39038;&#23458;&#30340;&#35831;&#27714;&#21017;&#30456;&#24403;&#20110;&#29992;&#25143;&#24577;&#36827;&#31243;&#21457;&#20986;&#30340;&#31995;&#32479;&#35843;&#29992;&#25110;&#24322;&#24120;&#12290;VIP&#39038;&#23458;&#30340;&#35831;&#27714;&#30456;&#24403;&#20110;&#20013;&#26029;&#65292;&#19981;&#21516;&#31561;&#32423;&#30340;VIP&#39038;&#23458;&#30456;&#24403;&#20110;&#19981;&#21516;&#20248;&#20808;&#32423;&#30340;&#20013;&#26029;&#12290;&#32769;&#26495;&#30340;&#35831;&#27714;&#21017;&#30456;&#24403;&#20110;&#20869;&#26680;&#25250;&#21344;&#12290;
</p>
<div class="sect2" title="20.1. &#20869;&#26680;&#25250;&#21344;"><div class="titlepage"><div><div><h3 class="title"><a name="idp81616380"></a>20.1. &#20869;&#26680;&#25250;&#21344;</h3></div></div></div>
<p>&#20869;&#26680;&#25250;&#21344;&#21644;&#20869;&#26680;&#30340;&#35843;&#24230;&#31574;&#30053;&#30456;&#20851;&#12290;&#36827;&#31243;&#26159;&#20855;&#26377;&#20248;&#20808;&#32423;&#30340;&#65292;&#36825;&#36319;&#35843;&#24230;&#31574;&#30053;&#26377;&#20851;&#65306;Linux&#20013;&#36827;&#31243;&#30340;&#20248;&#20808;&#32423;&#26159;&#21160;&#24577;&#30340;&#65292;&#35843;&#24230;&#31243;&#24207;&#26356;&#24635;&#36827;&#31243;&#30340;&#34892;&#20026;&#65292;&#24182;&#21608;&#26399;&#24615;&#30340;&#35843;&#25972;&#23427;&#20204;&#30340;&#20248;&#20808;&#32423;&#12290;&#36890;&#24120;&#36827;&#31243;&#21487;&#20197;&#20998;&#20026;&#19977;&#31867;:
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">&#20132;&#20114;&#24335;&#36827;&#31243;&#65306;&#29992;&#25143;&#30340;&#24605;&#32771;&#26102;&#38388;&#35201;&#38271;&#20110;&#25805;&#20316;&#30340;&#38388;&#38548;&#26102;&#38388;&#65292;&#20294;&#26159;&#19968;&#26086;&#25805;&#20316;&#23601;&#24517;&#39035;&#31435;&#21363;&#30456;&#24212;&#65292;&#27604;&#22914;Shell&#65292;&#32534;&#36753;&#31243;&#24207;&#65292;&#22810;&#23186;&#20307;&#24212;&#29992;&#31561;&#12290;</li><li class="listitem">&#25209;&#22788;&#29702;&#36827;&#31243;&#65306;&#36825;&#20123;&#36827;&#31243;&#20960;&#20046;&#19981;&#19982;&#29992;&#25143;&#20132;&#20114;&#65292;&#32463;&#24120;&#22312;&#21518;&#21488;&#36816;&#34892;&#12290;&#22240;&#27492;&#35813;&#36827;&#31243;&#19981;&#24517;&#24456;&#24555;&#30340;&#30456;&#24212;&#65292;&#22240;&#27492;&#21463;&#21040;&#35843;&#24230;&#31243;&#24207;&#30340;&#24930;&#24453;&#12290;&#27604;&#22914;&#65306;&#32534;&#35793;&#31243;&#24207;&#65292;&#25968;&#25454;&#24211;&#24341;&#25806;&#21644;&#31185;&#23398;&#35745;&#31639;&#12290;</li><li class="listitem">&#23454;&#26102;&#36827;&#31243;&#65306;&#36825;&#31867;&#36827;&#31243;&#26377;&#24456;&#24378;&#30340;&#35843;&#24230;&#38656;&#27714;&#65292;&#19981;&#21487;&#34987;&#20302;&#20248;&#20808;&#32423;&#30340;&#36827;&#31243;&#38459;&#22622;&#65292;&#21709;&#24212;&#26102;&#38388;&#24517;&#39035;&#24456;&#30701;&#24182;&#19988;&#31283;&#23450;&#22312;&#19968;&#20010;&#23567;&#30340;&#33539;&#22260;&#20869;&#12290;&#36825;&#31867;&#31243;&#24207;&#26377;&#38899;&#35270;&#39057;&#24212;&#29992;&#65292;&#26426;&#22120;&#20154;&#25511;&#21046;&#21644;&#20256;&#24863;&#22120;&#30340;&#20449;&#24687;&#25910;&#38598;&#31243;&#24207;&#31561;&#12290;</li></ul></div><p>
Linux2.6&#20869;&#26680;&#24320;&#22987;&#25903;&#25345;&#20869;&#26680;&#25250;&#21344;&#65292;&#36825;&#22522;&#20110;&#20197;&#19979;&#30340;&#32771;&#34385;&#65306;&#20551;&#35774;&#24403;&#21069;&#26377;&#20004;&#20010;&#36827;&#31243;&#22312;&#36816;&#34892;&#65306;&#19968;&#20010;&#25991;&#26412;&#32534;&#36753;&#31243;&#24207;&#21644;&#19968;&#20010;&#32534;&#35793;&#31243;&#24207;&#8212;&#8212;&#27491;&#22312;&#21344;&#29992;CPU&#12290;&#29992;&#25143;&#20572;&#30041;&#22312;&#25991;&#20214;&#32534;&#36753;&#31243;&#24207;&#30340;&#29366;&#24577;&#65292;&#24403;&#20854;&#25353;&#21160;&#38190;&#30424;&#30340;&#19968;&#30636;&#38388;&#23558;&#35302;&#21457;&#20013;&#26029;&#65292;&#20869;&#26680;&#24517;&#39035;&#39532;&#19978;&#21796;&#37266;&#25991;&#26412;&#32534;&#36753;&#36827;&#31243;&#65292;&#21542;&#21017;&#29992;&#25143;&#23558;&#35748;&#20026;&#31995;&#32479;&#30340;&#29366;&#24577;&#19981;&#31283;&#23450;&#12290;
</p>
<p>
&#22914;&#26524;&#36827;&#31243;&#36827;&#20837;TASK_RUNNING&#29366;&#24577;&#65292;&#20869;&#26680;&#26816;&#26597;&#23427;&#30340;&#21160;&#24577;&#20248;&#20808;&#32423;&#26159;&#21542;&#22823;&#20110;&#24403;&#21069;&#27491;&#22312;&#36816;&#34892;&#30340;&#36827;&#31243;&#30340;&#20248;&#20808;&#32423;&#12290;&#22914;&#26524;&#26159;&#65292;current&#30340;&#25191;&#34892;&#34987;&#20013;&#26029;&#65292;&#24182;&#35843;&#29992;&#35843;&#24230;&#31243;&#24207;&#36873;&#25321;&#21478;&#19968;&#20010;&#36827;&#31243;&#36816;&#34892;(&#36890;&#24120;&#26159;&#21018;&#21018;&#36827;&#20837;TASK_RUNNING&#29366;&#24577;&#30340;&#36827;&#31243;)&#12290;&#21478;&#19968;&#31181;&#24773;&#20917;&#26159;&#24403;&#21069;&#36827;&#31243;&#30340;&#26102;&#38388;&#29255;&#21040;&#26399;&#65292;&#24182;&#19988;&#23427;&#33258;&#35748;&#20026;&#33258;&#24049;&#24050;&#32463;&#22788;&#29702;&#23436;&#33258;&#24049;&#38656;&#35201;&#22788;&#29702;&#30340;&#20219;&#21153;&#65292;&#26080;&#38656;&#32487;&#32493;&#21344;&#29992;CPU&#20102;&#65292;&#27492;&#26102;&#24403;&#21069;&#36827;&#31243;thread_info&#32467;&#26500;&#20307;&#20013;&#30340;TIF_NEED_RESCHED&#26631;&#35760;&#34987;&#35774;&#32622;&#65292;&#20197;&#20415;&#22312;&#19979;&#19968;&#27425;&#20013;&#26029;(&#24456;&#22823;&#27010;&#29575;&#26159;&#31995;&#32479;&#26102;&#38047;&#20013;&#26029;)ISR&#22788;&#29702;&#32467;&#26463;&#26102;&#34987;&#35843;&#24230;&#31243;&#24207;&#35843;&#29992;&#12290;
</p>
<p>
&#32487;&#32493;&#22238;&#21040;&#19978;&#38754;&#30340;&#20363;&#23376;&#65292;&#20869;&#26680;&#36319;&#36394;&#25991;&#26412;&#32534;&#36753;&#22120;&#30340;&#34892;&#20026;&#65292;&#24182;&#30830;&#35748;&#23427;&#26159;&#19968;&#20010;&#20132;&#20114;&#36827;&#31243;&#65292;&#27492;&#26102;&#23427;&#30340;&#20248;&#20808;&#32423;&#23558;&#39640;&#20110;&#24403;&#21069;&#30340;&#32534;&#35793;&#22120;&#36827;&#31243;&#20248;&#20808;&#32423;&#65292;&#22240;&#27492;&#65292;&#32534;&#36753;&#36827;&#31243;&#30340;TIF_NEED_RESCHED&#26631;&#24535;&#23558;&#34987;&#35774;&#32622;&#65292;&#22914;&#27492;&#24378;&#36843;&#20869;&#26680;&#22788;&#29702;&#23436;&#20013;&#26029;&#26102;&#28608;&#27963;&#35843;&#24230;&#31243;&#24207;&#65292;&#23427;&#23558;&#36873;&#25321;&#32534;&#36753;&#36827;&#31243;&#24182;&#25191;&#34892;&#36827;&#31243;&#20999;&#25442;&#12290;&#22240;&#27492;&#65292;&#32534;&#36753;&#36827;&#31243;&#21487;&#20197;&#24456;&#24555;&#30456;&#24212;&#29992;&#25143;&#30340;&#25805;&#20316;&#65292;&#24182;&#19988;&#30001;&#20110;&#34987;&#35774;&#32622;&#20102;TIF_NEED_RESCHED&#26631;&#24535;&#65292;&#21487;&#20197;&#22312;&#21709;&#24212;&#23436;&#27605;&#21518;&#39532;&#19978;&#34987;&#32534;&#35793;&#36827;&#31243;&#25250;&#21344;&#12290;
</p>
<p>
TIF_NEED_RESCHED&#26631;&#24535;&#20316;&#29992;&#24847;&#21619;&#30528;&#24403;&#21069;&#36827;&#31243;&#33258;&#24895;&#25918;&#24323;CPU&#65292;&#36825;&#21644;&#20869;&#26680;&#26159;&#21542;&#25903;&#25345;&#25250;&#21344;&#26080;&#20851;&#65307;&#21478;&#19968;&#31181;&#24773;&#20917;&#26159;&#24403;&#21069;&#36827;&#31243;&#24182;&#19981;&#25171;&#31639;&#22312;&#26102;&#38388;&#29255;&#21040;&#26399;&#21069;&#25918;&#24323;CPU&#65292;&#32780;&#26356;&#39640;&#20248;&#20808;&#32423;&#30340;&#36827;&#31243;&#30001;&#20110;&#26576;&#20123;&#21407;&#22240;&#34987;&#21796;&#37266;&#65292;&#27604;&#22914;&#20013;&#26029;&#12290;&#22914;&#26524;&#20869;&#26680;&#26159;&#25250;&#21344;&#24335;&#30340;&#65292;&#39640;&#20248;&#20808;&#32423;&#36827;&#31243;&#23558;&#26367;&#25442;&#21407;&#36827;&#31243;&#12290;&#22914;&#26524;&#20869;&#26680;&#19981;&#26159;&#25250;&#21344;&#24335;&#30340;&#65292;&#37027;&#20040;&#38500;&#38750;&#24403;&#21069;&#36827;&#31243;&#25191;&#34892;&#23436;&#31995;&#32479;&#35843;&#29992;&#25110;&#24322;&#24120;&#22788;&#29702;&#24182;&#22312;&#24674;&#22797;&#21040;&#29992;&#25143;&#24577;&#26102;&#25165;&#26377;&#21487;&#33021;&#22240;&#35302;&#21457;&#35843;&#24230;&#31243;&#24207;&#32780;&#34987;&#26032;&#36827;&#31243;&#25250;&#21344;&#65292;&#21542;&#21017;&#36827;&#31243;&#20999;&#25442;&#19981;&#20250;&#21457;&#29983;(&#21363;&#20415;&#21457;&#29983;&#20102;&#20013;&#26029;&#65292;&#24182;&#22312;ISR&#22788;&#29702;&#32467;&#26463;&#26102;&#35302;&#21457;&#20102;&#35843;&#24230;&#31243;&#24207;&#65292;&#20063;&#19981;&#20250;&#22240;&#20026;&#20248;&#20808;&#32423;&#39640;&#32780;&#25250;&#21344;&#24403;&#21069;&#36824;&#26410;&#28040;&#32791;&#23436;&#20854;&#26102;&#38388;&#29255;&#30340;&#36827;&#31243;)&#12290;
</p>
<p>
&#20351;&#33021;&#20869;&#26680;&#25250;&#21344;&#30340;&#30446;&#30340;&#26159;&#20026;&#20102;&#20943;&#23569;&#29992;&#25143;&#24577;&#36827;&#31243;&#30340;&#20998;&#27966;&#24310;&#36831;(Dispatch latency)&#65292;&#21363;&#20174;&#36827;&#31243;&#21464;&#20026;&#21487;&#25191;&#34892;&#29366;&#24577;&#21040;&#23427;&#23454;&#38469;&#24320;&#22987;&#36816;&#34892;&#20043;&#38388;&#30340;&#26102;&#38388;&#38388;&#38548;&#12290;
</p>
<p>
&#24403;&#28982;&#24182;&#19981;&#26159;&#20302;&#20248;&#20808;&#32423;&#30340;&#36827;&#31243;&#22312;&#20219;&#20309;&#26102;&#20505;&#37117;&#26159;&#21487;&#34987;&#25250;&#21344;&#30340;&#65306;
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">&#20869;&#26680;&#27491;&#22312;&#25191;&#34892;&#20013;&#26029;&#26381;&#21153;&#20363;&#31243;&#12290;</li><li class="listitem">&#21487;&#24310;&#36831;&#20989;&#25968;&#34987;&#31105;&#27490;(&#24403;&#20869;&#26680;&#27491;&#22312;&#25191;&#34892;&#36719;&#20013;&#26029;&#25110;tasklet&#26102;&#32463;&#24120;&#22914;&#27492;)&#12290;</li><li class="listitem">&#36890;&#36807;&#25250;&#21344;&#35745;&#25968;&#22120;&#35774;&#32622;&#20026;&#27491;&#25968;&#32780;&#26174;&#31034;&#22320;&#31105;&#29992;&#20869;&#26680;&#25250;&#21344;&#12290;</li></ul></div><p>
</p>
<p>
&#24403;&#34987;current_thread_info&#23439;&#24341;&#29992;&#30340;thread_info&#25551;&#36848;&#31526;&#20013;&#30340;preempt_count&#25104;&#21592;&#22823;&#20110;0&#26159;&#65292;&#24403;&#21069;&#36827;&#31243;&#23601;&#31105;&#27490;&#20102;&#20869;&#26680;&#25250;&#21344;&#12290;&#35813;&#25104;&#21592;&#26159;&#19968;&#20010;32&#20301;&#30340;int&#31867;&#22411;&#65292;&#20294;&#26159;&#21516;&#26102;&#34920;&#36798;&#20102;&#19977;&#20010;&#19981;&#21516;&#30340;&#35745;&#25968;&#22120;&#65306;
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">b[7:0] &#25250;&#21344;&#35745;&#25968;&#22120;&#12290;&#35760;&#24405;&#26174;&#24335;&#31105;&#29992;&#26412;&#22320;CPU&#20869;&#26680;&#25250;&#21344;&#30340;&#27425;&#25968;&#65292;&#20540;&#31561;&#20110;0&#34920;&#31034;&#20801;&#35768;&#20869;&#26680;&#25250;&#21344;&#12290;&#33539;&#22260;&#20026;0~255&#12290;</li><li class="listitem">b[15:8] &#36719;&#20013;&#26029;&#35745;&#25968;&#22120;&#65306;&#34920;&#31034;&#21487;&#24310;&#36831;&#20989;&#25968;&#34987;&#31105;&#29992;&#30340;&#31243;&#24230;&#65292;&#33539;&#22260;&#20026;0~255&#12290;</li><li class="listitem">b[27:16] &#30828;&#20013;&#26029;&#35745;&#25968;&#22120;&#65306;&#34920;&#31034;&#22312;&#26412;&#22320;CPU&#19978;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#30340;&#23884;&#22871;&#25968;(irq_enter&#21644;irq_exit&#20998;&#21035;&#23545;&#23427;&#36827;&#34892;&#36882;&#21152;&#21644;&#36882;&#20943;)&#12290;</li><li class="listitem">b[28] PREEMPT_ACTIVE&#26631;&#24535;&#12290;&#23427;&#21644;&#35843;&#24230;&#26377;&#20851;&#12290;</li></ul></div><p>
&#38024;&#23545;&#36825;&#20960;&#20010;&#23383;&#27573;&#65292;&#20869;&#26680;&#25552;&#20379;&#20102;&#20197;&#19979;&#30340;&#23439;&#26041;&#20415;&#23545;&#23427;&#20204;&#30340;&#33719;&#21462;&#25805;&#20316;&#65306;
</p><pre class="programlisting">
include/linux/hardirq.h
#define hardirq_count()	(preempt_count() &amp; HARDIRQ_MASK)
#define softirq_count()	(preempt_count() &amp; SOFTIRQ_MASK)
#define irq_count()	(preempt_count() &amp; (HARDIRQ_MASK | SOFTIRQ_MASK))
</pre><p>
&#20197;&#19979;&#30340;&#23439;&#29992;&#20110;&#21028;&#26029;&#26159;&#21542;&#20301;&#20110;&#30828;&#20013;&#26029;&#65292;&#36719;&#20013;&#26029;&#25110;&#32773;&#20004;&#32773;&#20043;&#20013;&#12290;
</p><pre class="programlisting">
#define in_irq()		(hardirq_count())
#define in_softirq()		(softirq_count())
#define in_interrupt()		(irq_count())
</pre><p>
&#32508;&#19978;&#25152;&#36848;&#65292;&#21482;&#26377;&#24403;&#20869;&#26680;&#27491;&#22312;&#25191;&#34892;&#31995;&#32479;&#35843;&#29992;&#21644;&#24322;&#24120;&#22788;&#29702;&#65292;&#19988;&#20869;&#26680;&#25250;&#21344;&#27809;&#26377;&#34987;&#26174;&#31034;&#22320;&#31105;&#29992;&#26102;&#65292;&#25165;&#21487;&#33021;&#25250;&#21344;&#20869;&#26680;&#12290;
</p>
<p>
&#20869;&#26680;&#23450;&#20041;&#20102;&#19968;&#31995;&#21015;&#23439;&#26469;&#22788;&#29702;preempt_count&#23383;&#27573;&#30340;&#25250;&#21344;&#35745;&#25968;&#22120;b[7:0]&#12290;
</p><div class="table"><a name="idp81626812"></a><p class="title"><b>&#34920; 29. &#22788;&#29702;&#22120;&#25250;&#21344;&#35745;&#25968;&#22120;&#23383;&#27573;&#23439;</b></p><div class="table-contents">
<table summary="&#22788;&#29702;&#22120;&#25250;&#21344;&#35745;&#25968;&#22120;&#23383;&#27573;&#23439;" border="1"><colgroup><col><col></colgroup><thead><tr><th>&#23439;</th><th>&#35828;&#26126;</th></tr></thead><tbody><tr><td>preempt_count</td><td>&#22312;thread_info&#20013;&#36873;&#25321;preempt_count&#25104;&#21592;</td></tr><tr><td>preempt_disable</td><td>&#20351;&#25250;&#21344;&#35745;&#25968;&#22120;&#30340;&#20540;&#21152;1&#12290;</td></tr><tr><td>preempt_enable</td><td>&#20351;&#25250;&#21344;&#35745;&#25968;&#22120;&#30340;&#20540;&#20943;1&#12290;</td></tr><tr><td>preempt_enable_no_resched</td><td>&#20351;&#25250;&#21344;&#35745;&#25968;&#22120;&#30340;&#20540;&#20943;1&#12290;</td></tr><tr><td>preempt_enable</td><td>&#20351;&#25250;&#21344;&#35745;&#25968;&#22120;&#30340;&#20540;&#20943;1&#65292;&#24182;&#22312;thead_info&#25551;&#36848;&#31526;&#30340;TIF_NEED_RESCHED&#26631;&#24535;<br>&#34987;&#32622;1&#30340;&#24773;&#20917;&#19979;&#65292;&#35843;&#29992;preempt_schedule&#12290;</td></tr><tr><td>get_cpu</td><td>&#19982;preempt_disable&#30456;&#20284;&#65292;&#20294;&#35201;&#36820;&#22238;&#26412;&#22320;CPU&#30340;&#25968;&#37327;&#12290;</td></tr><tr><td>put_cpu</td><td>&#19982;preempt_enable&#30456;&#21516;&#12290;</td></tr><tr><td>put_cpu_no_resched</td><td>&#19982;preempt_enable_no_resched&#30456;&#21516;&#12290;</td></tr></tbody></table>
</div></div><p><br class="table-break">
&#20869;&#26680;&#24517;&#39035;&#37197;&#32622;CONFIG_PREEMPT&#65292;&#25165;&#21551;&#29992;&#20869;&#26680;&#25250;&#21344;&#12290;&#21542;&#21017;&#19978;&#38754;&#30340;&#23439;&#22343;&#34987;&#23450;&#20041;&#20026;&#31354;&#12290;
</p><pre class="programlisting">
include/linux/preempt.h
#define add_preempt_count(val)	do { preempt_count() += (val); } while (0)
#define sub_preempt_count(val)	do { preempt_count() -= (val); } while (0)

#define inc_preempt_count() add_preempt_count(1)
#define dec_preempt_count() sub_preempt_count(1)

#define preempt_count()	(current_thread_info()-&gt;preempt_count)
</pre><p>
preempt_count&#23545;preempt_count&#25104;&#21592;&#36827;&#34892;&#24341;&#29992;&#65292;&#32780;inc_preempt_count&#21644;dec_preempt_count&#20998;&#21035;&#23545;&#20854;&#36882;&#22686;&#21644;&#36882;&#20943;&#12290;
</p><pre class="programlisting">
#define preempt_disable() \
do { \
	inc_preempt_count(); \
	barrier(); \
} while (0)

#define preempt_enable_no_resched() \
do { \
	barrier(); \
	dec_preempt_count(); \
} while (0)
</pre><p>
preempt_disable&#36890;&#36807;inc_preempt_count&#23454;&#29616;&#36882;&#22686;preempt_count&#65292;preempt_enable_no_resched&#36890;&#36807;dec_preempt_count&#36882;&#20943;&#65292;&#26174;&#28982;&#36825;&#37324;&#30340;&#37325;&#28857;&#22312;&#20110;barrier&#23439;&#65292;&#23427;&#21578;&#35785;&#32534;&#35793;&#22120;&#19981;&#35201;&#25913;&#21464;C&#35821;&#35328;&#23545;&#24212;&#30340;&#27719;&#32534;&#35821;&#35328;&#30340;&#39034;&#24207;&#65292;&#25152;&#20197;CPU&#19981;&#20250;&#20081;&#24207;&#25191;&#34892;&#65292;&#36825;&#20445;&#35777;&#20102;&#23545;preempt_count&#30340;&#25805;&#20316;&#19981;&#20250;&#22240;&#20026;&#32534;&#35793;&#22120;&#20248;&#21270;&#32780;&#21457;&#29983;&#25552;&#21069;&#25110;&#32773;&#24310;&#21518;&#65292;&#20063;&#21363;&#35843;&#29992;preempt_disable&#20043;&#21518;&#30340;&#20195;&#30721;&#19968;&#23450;&#26159;&#22312;preempt_count&#22686;&#21152;1&#21518;&#25191;&#34892;&#65292;&#21453;&#20043;&#20134;&#28982;&#12290;
</p><pre class="programlisting">
#define preempt_enable() \
do { \
	preempt_enable_no_resched(); \
	barrier(); \
	preempt_check_resched(); \
} while (0)
</pre><p>
preempt_enable&#26159;&#23545;preempt_enable_no_resched&#21644;preempt_check_resched&#30340;&#23553;&#35013;&#65292;&#20013;&#38388;&#25554;&#20837;&#20102;&#20869;&#23384;&#23631;&#38556;&#12290;
</p><pre class="programlisting">
kernel/sched.c
asmlinkage void __sched preempt_schedule(void)
{
	struct thread_info *ti = current_thread_info();

	if (likely(ti-&gt;preempt_count || irqs_disabled()))
		return;

	do {
		add_preempt_count(PREEMPT_ACTIVE);
		schedule();
		sub_preempt_count(PREEMPT_ACTIVE);

		barrier();
	} while (unlikely(test_thread_flag(TIF_NEED_RESCHED)));
}

#define preempt_check_resched() \
do { \
	if (unlikely(test_thread_flag(TIF_NEED_RESCHED))) \
		preempt_schedule(); \
} while (0)

</pre><p>
preempt_schedule&#29992;&#20110;&#25250;&#21344;&#35843;&#24230;&#65292;&#24403;&#21069;&#23427;&#21482;&#34987;preempt_check_resched&#35843;&#29992;&#12290;&#23545;&#20110;preempt_schedule&#30340;&#35843;&#29992;&#65292;&#24212;&#35813;&#22987;&#32456;&#36890;&#36807;preempt_check_resched&#65292;&#32780;&#38750;&#20854;&#33258;&#36523;&#12290;&#21478;&#22806;&#24212;&#35813;&#20445;&#25345;&#36825;&#37096;&#20998;&#20195;&#30721;&#34987;&#32422;&#26463;&#22312;&#21487;&#25511;&#30340;&#33539;&#22260;&#65292;&#32780;&#36991;&#20813;&#19981;&#24517;&#35201;&#30340;&#25193;&#25955;&#12290;
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">preempt_schedule&#39318;&#20808;&#21028;&#26029;&#24403;&#21069;&#36827;&#31243;preempt_count&#20540;&#26159;&#21542;&#20026;&#27491;&#20540;&#65292;&#22914;&#26524;&#26159;&#65292;&#21017;&#35828;&#26126;&#35813;&#36827;&#31243;&#24403;&#21069;&#31105;&#27490;&#25250;&#21344;&#65292;&#19981;&#21487;&#34987;&#35843;&#24230;&#12290;</li><li class="listitem">&#28982;&#21518;&#36890;&#36807;irqs_disabled&#21028;&#26029;&#24403;&#21069;&#26159;&#21542;&#22788;&#20110;&#20013;&#26029;&#22788;&#29702;&#20013;&#65292;&#22914;&#26524;&#26159;&#21017;&#19981;&#21487;&#34987;&#25250;&#21344;&#12290;</li><li class="listitem">&#32622;PREEMPT_ACTIVE&#26631;&#35760;&#65292;&#35843;&#29992;schedule&#23454;&#26045;&#35843;&#24230;&#12290;</li><li class="listitem">&#22914;&#26524;&#35843;&#24230;&#22833;&#36133;&#65292;&#19988;&#36827;&#31243;&#21547;&#26377;TIF_NEED_RESCHED&#26631;&#35760;&#65292;&#21017;&#25345;&#32493;&#35843;&#24230;&#65292;&#30452;&#33267;&#25104;&#21151;&#12290;</li></ul></div><p>
&#19968;&#20123;&#39069;&#22806;&#30340;&#23439;&#24182;&#29992;&#22312;SMP&#31995;&#32479;&#22788;&#29702;&#20013;&#12290;
</p><pre class="programlisting">
#define get_cpu()		({ preempt_disable(); smp_processor_id(); })
#define put_cpu()		preempt_enable()
#define put_cpu_no_resched()	preempt_enable_no_resched()
</pre><p>
</p>
</div>
<div class="sect2" title="20.2. &#20869;&#23384;&#23631;&#38556;"><div class="titlepage"><div><div><h3 class="title"><a name="idp81637884"></a>20.2. &#20869;&#23384;&#23631;&#38556;</h3></div></div></div>
<p>
&#20869;&#23384;&#23631;&#38556;&#20445;&#35777;&#39640;&#32423;&#35821;&#35328;&#65292;&#27604;&#22914;C&#35821;&#35328;&#30340;&#32534;&#35793;&#22120;&#22312;&#20248;&#21270;&#29983;&#25104;&#30340;&#20195;&#30721;&#26102;&#33021;&#22815;&#20445;&#35777;&#20869;&#23384;&#23631;&#38556;&#21069;&#21518;&#30340;&#20195;&#30721;&#19981;&#20250;&#20081;&#24207;&#65292;&#32780;&#23548;&#33268;&#36829;&#32972;&#26412;&#26469;&#30340;&#31243;&#24207;&#24847;&#22270;&#12290;&#20869;&#23384;&#23631;&#38556;&#30001;&#19968;&#20010;&#21517;&#20026;barrier()&#30340;&#23439;&#23450;&#20041;&#65306;
</p><pre class="programlisting">
include/linux/compiler-gcc.h
#define barrier() __asm__ __volatile__("": : :"memory")
</pre><p>	
&#35201;&#24443;&#24213;&#29702;&#35299;barrier()&#30340;&#20316;&#29992;&#65292;&#38656;&#35201;&#39318;&#20808;&#29702;&#35299;&#20869;&#23884;&#27719;&#32534;&#12290;&#23383;&#31526;&#20018;"memory"&#21521;GCC&#22768;&#26126;&#65306;&#22312;&#27492;&#20043;&#21069;&#30340;C&#35821;&#35328;&#23545;&#24212;&#30340;&#27719;&#32534;&#35821;&#35328;&#21644;&#27492;&#20043;&#21518;&#30340;&#27719;&#32534;&#35821;&#35328;&#22312;&#20248;&#21270;&#26102;&#19981;&#35201;&#25918;&#22312;&#19968;&#36215;&#32771;&#34385;&#12290;&#19968;&#20010;&#23454;&#38469;&#30340;&#20363;&#23376;&#22914;&#19979;&#25152;&#31034;&#65306;
</p><pre class="programlisting">
#define barrier() __asm__ __volatile__("": : :"memory")
int g_test = 0;
int main()
{
        int *tmp = &amp;g_test;
        *tmp = 100;
     // barrier();
        if(*tmp == 100)
                return 0;

        return 1;
}
</pre><p>
&#32534;&#35793;&#21629;&#20196;&#22914;&#19979;&#65292;&#20026;&#20102;&#24471;&#21040;&#38388;&#25509;&#30340;&#20195;&#30721;&#65292;&#21442;&#25968;&#20013;&#21152;&#19978;&#20102;-O2&#20248;&#21270;&#36873;&#39033;&#12290;
</p><pre class="programlisting">
arm-linux-gcc test.c -o test -O2
</pre><p>	
&#39318;&#20808;&#32534;&#35793;&#27809;&#26377;&#20869;&#23384;&#23631;&#38556;&#23439;&#30340;&#20195;&#30721;&#65292;&#24182;&#21453;&#27719;&#32534;&#24471;&#21040;main&#20989;&#25968;&#23545;&#24212;&#30340;&#27719;&#32534;&#25351;&#20196;&#65306;
</p><pre class="programlisting">
00008334 &lt;main&gt;:
    8334:       e59f300c        ldr     r3, [pc, #12]   ; 8348 &lt;main+0x14&gt;
    8338:       e3a02064        mov     r2, #100        ; 0x64
    833c:       e3a00000        mov     r0, #0  ; 0x0
    8340:       e5832000        str     r2, [r3]
    8344:       e12fff1e        bx      lr
    8348:       000104fc        .word   0x000104fc
</pre><p>
&#36825;&#37324;&#25214;&#19981;&#21040;*tmp == 100&#23545;&#24212;&#30340;&#27719;&#32534;&#25351;&#20196;&#65292;&#26174;&#28982;&#32534;&#35793;&#22120;&#35748;&#20026;&#36825;&#21477;&#35805;&#26159;&#22810;&#20313;&#30340;&#65292;&#22240;&#20026;&#20174;*tmp = 100&#36825;&#21477;&#35805;&#24320;&#22987;&#65292;*tmp&#30340;&#20540;&#27809;&#26377;&#34987;&#20219;&#20309;&#35821;&#21477;&#25913;&#21464;&#36807;&#65292;&#25152;&#20197;&#23427;&#23581;&#35797;&#20102;&#20248;&#21270;&#12290;&#25509;&#19979;&#26469;&#25171;&#24320;barrier()&#12290;
</p><pre class="programlisting">
00008334 &lt;main&gt;:
    8334:       e59f3014        ldr     r3, [pc, #20]   ; 8350 &lt;main+0x1c&gt;
    8338:       e3a02064        mov     r2, #100        ; 0x64
    833c:       e5832000        str     r2, [r3]
    8340:       e5930000        ldr     r0, [r3]
    8344:       e0500002        subs    r0, r0, r2
    8348:       13a00001        movne   r0, #1  ; 0x1
    834c:       e12fff1e        bx      lr
    8350:       00010504        .word   0x00010504
</pre><p>
&#21487;&#20197;&#30475;&#21040;subs&#21644;movne&#25351;&#20196;&#65292;&#25152;&#20197;&#30830;&#23454;&#25191;&#34892;&#20102;&#27604;&#36739;&#25805;&#20316;&#12290;&#32771;&#34385;&#20309;&#26102;&#38656;&#35201;&#36825;&#31181;&#38656;&#27714;&#21602;&#65311;&#19968;&#20010;&#20856;&#22411;&#30340;&#31034;&#20363;&#23601;&#26159;&#20869;&#26680;&#25250;&#21344;&#65292;&#22312;&#21487;&#34987;&#25250;&#21344;&#21069;&#21518;&#30340;&#20195;&#30721;&#26159;&#24517;&#39035;&#20005;&#26684;&#39034;&#24207;&#25191;&#34892;&#30340;&#65292;&#19981;&#28982;&#31105;&#27490;&#25250;&#21344;&#25152;&#20445;&#25252;&#30340;&#25805;&#20316;&#23558;&#20007;&#22833;&#26412;&#26469;&#30340;&#24847;&#20041;&#12290;
</p>
</div>
<div class="sect2" title="20.3. &#20020;&#30028;&#21306;&#25511;&#21046;"><div class="titlepage"><div><div><h3 class="title"><a name="idp81642548"></a>20.3. &#20020;&#30028;&#21306;&#25511;&#21046;</h3></div></div></div>
<p>&#20020;&#30028;&#21306;&#26159;&#19968;&#27573;&#20195;&#30721;&#65292;&#22312;&#20219;&#20309;&#20869;&#26680;&#25511;&#21046;&#36335;&#24452;&#36827;&#20837;&#20020;&#30028;&#21306;&#21518;&#24517;&#39035;&#20840;&#37096;&#25191;&#34892;&#23436;&#36825;&#27573;&#20195;&#30721;&#65292;&#32780;&#19981;&#34987;&#25171;&#26029;&#12290;&#22914;&#20309;&#30830;&#23450;&#31995;&#32479;&#35843;&#29992;&#65292;&#24322;&#24120;&#22788;&#29702;&#31243;&#24207;&#65292;&#21487;&#24310;&#36831;&#20989;&#25968;&#21644;&#20869;&#26680;&#32447;&#31243;&#20013;&#30340;&#20020;&#30028;&#21306;&#26159;&#26159;&#39318;&#35201;&#20219;&#21153;&#12290;&#19968;&#26086;&#20020;&#30028;&#21306;&#34987;&#30830;&#23450;&#65292;&#23601;&#24517;&#39035;&#23545;&#20854;&#37319;&#29992;&#36866;&#24403;&#30340;&#20445;&#25252;&#25514;&#26045;&#65292;&#20197;&#30830;&#20445;&#22312;&#20219;&#20309;&#26102;&#21051;&#21482;&#26377;&#19968;&#20010;&#20869;&#26680;&#25511;&#21046;&#36335;&#24452;&#22788;&#20110;&#20020;&#30028;&#21306;&#12290;</p>
<p>
&#20363;&#22914;&#65292;&#20551;&#35774;&#20004;&#20010;&#19981;&#21516;&#30340;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#35201;&#35775;&#38382;&#21516;&#19968;&#20010;&#21253;&#21547;&#20102;&#20960;&#20010;&#30456;&#20851;&#21464;&#37327;&#30340;&#25968;&#25454;&#32467;&#26500;&#65292;&#27604;&#22914;&#19968;&#20010;&#32531;&#20914;&#21306;&#21644;&#19968;&#20010;&#34920;&#31034;&#32531;&#20914;&#21306;&#22823;&#23567;&#30340;&#31867;&#22411;&#21464;&#37327;&#12290;&#25152;&#26377;&#24433;&#21709;&#35813;&#25968;&#25454;&#32467;&#26500;&#30340;&#35821;&#21477;&#37117;&#24517;&#39035;&#25918;&#20837;&#19968;&#20010;&#21333;&#29420;&#30340;&#20020;&#30028;&#21306;&#12290;&#22914;&#26524;&#26159;&#21333;CPU&#31995;&#32479;&#65292;&#21487;&#20197;&#37319;&#21462;&#35775;&#38382;&#20849;&#20139;&#25968;&#25454;&#32467;&#26500;&#26102;&#20851;&#38381;&#20013;&#26029;&#30340;&#26041;&#24335;&#26469;&#23454;&#29616;&#20020;&#30028;&#21306;&#65292;&#22240;&#20026;&#21482;&#26377;&#22312;&#24320;&#20013;&#26029;&#30340;&#24773;&#20917;&#19979;&#65292;&#25165;&#21487;&#33021;&#21457;&#29983;&#20869;&#26680;&#25511;&#21046;&#36335;&#24452;&#30340;&#23884;&#22871;&#12290;
</p>
<p>
&#21478;&#22806;&#65292;&#22914;&#26524;&#30456;&#21516;&#30340;&#25968;&#25454;&#32467;&#26500;&#20165;&#34987;&#31995;&#32479;&#35843;&#29992;&#26381;&#21153;&#20363;&#31243;&#25152;&#35775;&#38382;&#65292;&#32780;&#19988;&#31995;&#32479;&#20013;&#21482;&#26377;&#19968;&#20010;CPU&#65292;&#23601;&#21487;&#20197;&#38750;&#24120;&#31616;&#21333;&#22320;&#36890;&#36807;&#22312;&#35775;&#38382;&#20849;&#20139;&#25968;&#25454;&#32467;&#26500;&#26102;&#31105;&#29992;&#20869;&#26680;&#25250;&#21344;&#21151;&#33021;&#26469;&#23454;&#29616;&#20020;&#30028;&#21306;&#12290;
</p>
<p>
</p>
&#20294;&#26159;&#22914;&#26524;&#35813;&#20849;&#20139;&#25968;&#25454;&#21363;&#21487;&#33021;&#34987;&#26576;&#19968;&#20013;&#26029;ISR&#35775;&#38382;&#65292;&#21448;&#21487;&#33021;&#34987;&#31995;&#32479;&#35843;&#29992;&#35775;&#38382;&#21602;&#65311;&#20107;&#23454;&#19978;&#20869;&#26680;&#32422;&#26463;&#20102;&#36825;&#31181;&#24773;&#20917;&#30340;&#20135;&#29983;&#65292;&#23427;&#20204;&#19981;&#20250;&#25805;&#20316;&#21516;&#19968;&#25968;&#25454;&#32467;&#26500;&#65292;&#32780;&#35201;&#20040;&#26159;&#21407;&#25968;&#25454;&#32467;&#26500;&#65292;&#35201;&#20040;&#26159;&#21103;&#26412;&#12290;
<p>
&#22312;SMP&#31995;&#32479;&#20013;&#65292;&#24773;&#20917;&#35201;&#22797;&#26434;&#24471;&#22810;&#65292;&#30001;&#20110;&#22810;&#20010;CPU&#21487;&#33021;&#21516;&#26102;&#25191;&#34892;&#20869;&#26680;&#36335;&#24452;&#65292;&#22240;&#27492;&#20869;&#26680;&#24320;&#21457;&#32773;&#19981;&#33021;&#20551;&#35774;&#21482;&#35201;&#31105;&#29992;&#20869;&#26680;&#25250;&#21344;&#21151;&#33021;&#65292;&#32780;&#19988;&#20013;&#26029;&#65292;&#24322;&#24120;&#21644;&#36719;&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#37117;&#27809;&#26377;&#35775;&#38382;&#36807;&#35813;&#25968;&#25454;&#32467;&#26500;&#65292;&#25165;&#33021;&#20445;&#35777;&#36825;&#20010;&#25968;&#25454;&#32467;&#26500;&#33021;&#22815;&#23433;&#20840;&#22320;&#34987;&#35775;&#38382;&#12290;&#20869;&#26680;&#25552;&#20379;&#20102;&#21508;&#31181;&#19981;&#21516;&#30340;&#21516;&#27493;&#25216;&#26415;&#12290;
</p>
<p>
&#20160;&#20040;&#26102;&#20505;&#21516;&#27493;&#26159;&#19981;&#24517;&#35201;&#30340;&#65311;&#22522;&#20110;&#20197;&#19979;&#20869;&#26680;&#32422;&#26463;&#65292;&#23427;&#20351;&#24471;&#20869;&#26680;&#21516;&#27493;&#30456;&#23545;&#31616;&#21333;&#20102;&#65306;
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">&#25805;&#20316;&#21482;&#23384;&#22312;&#20110;&#21516;&#19968;&#20013;&#26029;ISR&#20013;&#65292;&#37027;&#20040;&#31105;&#20013;&#26029;&#21363;&#21487;&#12290;</li><li class="listitem">&#20013;&#26029;ISR&#65292;&#36719;&#20013;&#26029;&#21644;tasklet&#26082;&#19981;&#21487;&#20197;&#34987;&#25250;&#21344;&#20063;&#19981;&#33021;&#34987;&#38459;&#22622;&#65292;&#25152;&#20197;&#23427;&#20204;&#19981;&#21487;&#33021;&#38271;&#26102;&#38388;&#22788;&#20110;&#25346;&#36215;&#29366;&#24577;&#12290;&#22312;&#26368;&#22351;&#24773;&#20917;&#19979;&#65292;&#23427;&#20204;&#30340;&#25191;&#34892;&#23558;&#26377;&#36731;&#24494;&#30340;&#24310;&#36831;&#65292;&#22240;&#20026;&#22312;&#20854;&#25191;&#34892;&#30340;&#36807;&#31243;&#20013;&#21487;&#33021;&#21457;&#29983;&#20854;&#20182;&#30340;&#20013;&#26029;(&#20869;&#26680;&#25511;&#21046;&#36335;&#24452;&#30340;&#23884;&#22871;&#25191;&#34892;)&#12290;</li><li class="listitem">&#25191;&#34892;&#20013;&#26029;&#22788;&#29702;&#30340;&#20869;&#26680;&#25511;&#21046;&#36335;&#24452;&#19981;&#33021;&#34987;&#25191;&#34892;&#21487;&#24310;&#36831;&#20989;&#25968;&#25110;&#31995;&#32479;&#35843;&#29992;&#26381;&#21153;&#20363;&#31243;&#30340;&#20869;&#26680;&#25511;&#21046;&#36335;&#24452;&#20013;&#26029;&#12290;</li><li class="listitem">&#36719;&#20013;&#26029;&#21644;tasklet&#19981;&#33021;&#22312;&#19968;&#20010;&#32473;&#23450;&#30340;CPU&#19978;&#20132;&#38169;&#25191;&#34892;&#12290;</li><li class="listitem">&#21516;&#19968;&#20010;tasklet&#19981;&#21487;&#33021;&#21516;&#26102;&#22312;&#20960;&#20010;CPU&#19978;&#25191;&#34892;&#12290;</li><li class="listitem"></ul></div><p>
&#22522;&#20110;&#20197;&#19978;&#36825;&#20123;&#20869;&#26680;&#32534;&#30721;&#30340;&#32422;&#26463;&#38480;&#21046;&#65292;&#20869;&#26680;&#21516;&#27493;&#22312;&#22810;&#25968;&#26102;&#20505;&#19981;&#37027;&#20040;&#32039;&#36843;&#65306;
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">ISR&#21644;tasklet&#19981;&#24517;&#32534;&#20889;&#25104;&#21487;&#37325;&#20837;&#30340;&#20989;&#25968;&#12290;</li><li class="listitem">&#20165;&#34987;&#36719;&#20013;&#26029;&#21644;tasklet&#35775;&#38382;&#30340;&#27599;CPU&#21464;&#37327;&#19981;&#38656;&#35201;&#21516;&#27493;&#12290;</li><li class="listitem">&#20165;&#34987;&#19968;&#31181;tasklet&#35775;&#38382;&#30340;&#25968;&#25454;&#32467;&#26500;&#19981;&#38656;&#35201;&#21516;&#27493;&#12290;</li></ul></div><p>
</p>
</div>
<div class="sect2" title="20.4. &#21516;&#27493;&#25216;&#26415;"><div class="titlepage"><div><div><h3 class="title"><a name="idp81648780"></a>20.4. &#21516;&#27493;&#25216;&#26415;</h3></div></div></div>
"&#36866;&#29992;&#33539;&#22260;"&#19968;&#26639;&#34920;&#31034;&#35813;&#21516;&#27493;&#25216;&#26415;&#26159;&#36866;&#29992;&#20110;&#31995;&#32479;&#20013;&#30340;&#25152;&#26377;CPU&#36824;&#26159;&#21333;&#20010;CPU&#12290;&#20363;&#22914;&#65292;&#26412;&#22320;&#20013;&#26029;&#30340;&#31105;&#27490;&#21482;&#36866;&#29992;&#20110;&#19968;&#20010;CPU(&#31995;&#32479;&#20013;&#30340;&#20854;&#20182;CPU&#19981;&#21463;&#24433;&#21709;)&#65307;&#30456;&#21453;&#65292;&#21407;&#23376;&#25805;&#20316;&#24433;&#21709;&#31995;&#32479;&#20013;&#30340;&#25152;&#26377;CPU(&#24403; &#35775;&#38382;&#21516;&#19968;&#20010;&#25968;&#25454;&#32467;&#26500;&#26102;&#65292;&#20960;&#20010;CPU&#19978;&#30340;&#21407;&#23376;&#25805;&#20316;&#19981;&#33021;&#20132;&#38169;)&#12290;
<div class="table"><a name="idp81649860"></a><p class="title"><b>&#34920; 30. &#20869;&#26680;&#20351;&#29992;&#30340;&#21516;&#27493;&#25216;&#26415;</b></p><div class="table-contents">
<table summary="&#20869;&#26680;&#20351;&#29992;&#30340;&#21516;&#27493;&#25216;&#26415;" border="1"><colgroup><col><col><col></colgroup><thead><tr><th>&#25216;&#26415;</th><th>&#35828;&#26126;</th><th>&#20351;&#29992;&#33539;&#22260;</th></tr></thead><tbody><tr><td>&#27599;CPU&#21464;&#37327;</td><td>&#22312;CPU&#25351;&#23574;&#36171;&#20540;&#25968;&#25454;&#32467;&#26500;</td><td>&#25152;&#26377;CPU</td></tr><tr><td>&#21407;&#23376;&#25805;&#20316;</td><td>&#23545;&#19968;&#20010;&#35745;&#25968;&#22120;&#21407;&#23376;&#22320;"&#35835;-&#20462;&#25913;-&#20889;"&#30340;&#25351;&#20196;</td><td>&#25152;&#26377;CPU</td></tr><tr><td>&#20869;&#23384;&#23631;&#38556;</td><td>&#36991;&#20813;&#25351;&#20196;&#37325;&#26032;&#25490;&#24207;</td><td>&#26412;&#22320;CPU&#25110;&#25152;&#26377;CPU</td></tr><tr><td>&#33258;&#26059;&#38145;</td><td>&#21152;&#38145;&#26102;&#24537;&#31561;</td><td>&#25152;&#26377;CPU</td></tr><tr><td>&#20449;&#21495;&#37327;</td><td>&#21152;&#38145;&#26102;&#38459;&#22622;&#31561;&#24453;(&#30561;&#30496;)</td><td>&#25152;&#26377;CPU</td></tr><tr><td>&#39034;&#24207;&#38145;</td><td>&#22522;&#20110;&#35775;&#38382;&#35745;&#25968;&#22120;&#30340;&#38145;</td><td>&#25152;&#26377;CPU</td></tr><tr><td>&#26412;&#22320;&#20013;&#26029;&#30340;&#31105;&#27490;</td><td>&#31105;&#27490;&#21333;&#20010;CPU&#19978;&#30340;&#20013;&#26029;&#22788;&#29702;</td><td>&#26412;&#22320;CPU</td></tr><tr><td>&#26412;&#22320;&#36719;&#20013;&#26029;&#30340;&#31105;&#27490;</td><td>&#31105;&#27490;&#21333;&#20010;CPU&#19978;&#30340;&#21487;&#24310;&#36831;&#20989;&#25968;&#22788;&#29702;</td><td>&#26412;&#22320;CPU</td></tr><tr><td>RCU</td><td>&#36890;&#36807;&#25351;&#38024;&#32780;&#19981;&#26159;&#38145;&#26469;&#35775;&#38382;&#20849;&#20139;&#25968;&#25454;&#32467;&#26500;</td><td>&#25152;&#26377;CPU</td></tr></tbody></table>
</div></div><br class="table-break">
<div class="sect3" title="20.4.1. &#27599;CPU&#21464;&#37327;"><div class="titlepage"><div><div><h4 class="title"><a name="idp81657020"></a>20.4.1. &#27599;CPU&#21464;&#37327;</h4></div></div></div>
<p>&#26368;&#22909;&#30340;&#21516;&#27493;&#25216;&#26415;&#23601;&#26159;&#25226;&#35774;&#35745;&#26080;&#38656;&#21516;&#27493;&#30340;&#20869;&#26680;&#25918;&#22312;&#39318;&#20301;&#12290;&#20107;&#23454;&#19978;&#27599;&#31181;&#26174;&#24335;&#30340;&#21516;&#27493;&#25216;&#26415;&#37117;&#26377;&#19981;&#23481;&#24573;&#35270;&#30340;&#24615;&#33021;&#24320;&#38144;&#12290;</p>
<p>
&#26368;&#31616;&#21333;&#20063;&#26159;&#26368;&#37325;&#35201;&#30340;&#21516;&#27493;&#25216;&#26415;&#21253;&#25324;&#25226;&#20869;&#26680;&#21464;&#37327;&#22768;&#26126;&#20026;&#27599;CPU&#21464;&#37327;(per-cpu variable)&#12290;&#27599;CPU&#21464;&#37327;&#20027;&#35201;&#26159;&#25968;&#25454;&#32467;&#26500;&#30340;&#25968;&#32452;&#65292;&#31995;&#32479;&#30340;&#27599;&#20010;CPU&#23545;&#24212;&#25968;&#32452;&#30340;&#19968;&#20010;&#20803;&#32032;&#12290;
</p>
<p>
&#19968;&#20010;CPU&#19981;&#24212;&#35813;&#35775;&#38382;&#20854;&#20182;CPU&#23545;&#24212;&#30340;&#25968;&#25454;&#20803;&#32032;&#65292;&#21478;&#22806;&#23427;&#21487;&#20197;&#38543;&#24847;&#24230;&#25110;&#32773;&#20462;&#25913;&#23427;&#33258;&#24049;&#30340;&#20803;&#32032;&#32780;&#19981;&#29992;&#25285;&#24515;&#20986;&#29616;&#31454;&#20105;&#26465;&#20214;&#65292;&#22240;&#20026;&#23427;&#26159;&#21807;&#19968;&#26377;&#36164;&#26684;&#36825;&#20040;&#20570;&#30340;CPU&#12290;&#20294;&#26159;&#65292;&#20063;&#24847;&#21619;&#30528;&#27599;CPU&#21464;&#37327;&#22522;&#26412;&#19978;&#21482;&#33021;&#22312;&#29305;&#27530;&#24773;&#20917;&#19979;&#20351;&#29992;&#65292;&#20063;&#23601;&#26159;&#24403;&#23427;&#30830;&#23450;&#22312;&#31995;&#32479;&#30340;CPU&#19978;&#30340;&#25968;&#25454;&#22312;&#36923;&#36753;&#19978;&#26159;&#29420;&#31435;&#30340;&#26102;&#20505;&#12290;
</p>
<p>
&#27599;CPU&#30340;&#25968;&#32452;&#20803;&#32032;&#22312;&#27880;&#20876;&#20013;&#34987;&#25490;&#21015;&#20197;&#20351;&#27599;&#20010;&#25968;&#25454;&#32467;&#26500;&#23384;&#25918;&#22312;&#30828;&#20214;&#21578;&#35785;&#32531;&#23384;&#30340;&#19981;&#21516;&#34892;&#65292;&#22240;&#27492;&#65292;&#23545;&#27599;CPU&#25968;&#25454;&#30340;&#24182;&#21457;&#19981;&#20250;&#23548;&#33268;&#21578;&#35785;&#32531;&#23384;&#34892;&#30340;&#31363;&#29992;&#21644;&#22833;&#25928;&#12290;
</p>
<p>
&#34429;&#28982;&#27599;CPU&#21464;&#37327;&#20026;&#26469;&#33258;&#19981;&#21516;CPU&#30340;&#24182;&#21457;&#35775;&#38382;&#25552;&#20379;&#20445;&#25252;&#65292;&#20294;&#23545;&#26469;&#33258;&#24322;&#27493;&#20989;&#25968;(&#20013;&#26029;&#22788;&#29702;&#31243;&#24207;&#21644;&#21487;&#24310;&#36831;&#20989;&#25968;)&#30340;&#35775;&#38382;&#19981;&#25552;&#20379;&#20445;&#25252;&#65292;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#38656;&#35201;&#21478;&#22806;&#30340;&#21516;&#27493;&#25216;&#26415;&#12290;
</p>
<p>
&#26080;&#35770;&#26159;&#22312;&#21333;&#22788;&#29702;&#22120;&#36824;&#26159;SMP&#31995;&#32479;&#20013;&#65292;&#20869;&#26680;&#25250;&#21344;&#37117;&#21487;&#33021;&#20351;&#27599;CPU&#21464;&#37327;&#20135;&#29983;&#31454;&#20105;&#26465;&#20214;&#12290;&#24635;&#30340;&#21407;&#21017;&#26159;&#20869;&#26680;&#25511;&#21046;&#36335;&#24452;&#24212;&#35813;&#22312;&#31105;&#29992;&#25250;&#21344;&#30340;&#24773;&#20917;&#19979;&#35775;&#38382;&#27599;CPU&#21464;&#37327;&#12290;
</p><pre class="programlisting">
#ifdef CONFIG_SMP
#define DEFINE_PER_CPU(type, name)                                      \
        __attribute__((__section__(".data.percpu")))                    \
        PER_CPU_ATTRIBUTES __typeof__(type) per_cpu__##name
#else
#define DEFINE_PER_CPU(type, name)   \
        PER_CPU_ATTRIBUTES __typeof__(type) per_cpu__##name
......        
</pre><p>
&#20174;DEFINE_PER_CPU&#23545;&#27599;CPU&#21464;&#37327;&#36827;&#34892;&#23450;&#20041;&#65292;&#23545;&#20110;&#21333;CPU&#31995;&#32479;&#26469;&#35828;&#65292;&#23601;&#26159;&#31616;&#21333;&#30340;&#19968;&#20010;&#21464;&#37327;per_cpu__##name&#65292;&#20294;&#26159;&#23545;&#20110;SMP&#31995;&#32479;&#26469;&#35828;&#65292;&#21364;&#38656;&#35201;&#38142;&#25509;&#33050;&#26412;&#30340;&#24110;&#21161;&#65306;&#23427;&#22312;&#32534;&#35793;&#26399;&#34987;&#25918;&#22312;.data.percpu&#27573;&#20013;&#12290;
</p><pre class="programlisting">
arch/arm/kernel/vmlinux.lds.S
.init : {
......
    . = ALIGN(4096);
    __per_cpu_start = .;
            *(.data.percpu)
            *(.data.percpu.shared_aligned)
    __per_cpu_end = .;
......
}
</pre><p>
&#36825;&#35828;&#26126;__per_cpu_start&#21644;__per_cpu_end&#26631;&#35782;.data.percpu&#27573;&#30340;&#24320;&#22836;&#21644;&#32467;&#23614;&#12290;&#24182;&#19988;&#65292;&#25972;&#20010;.data.percpu&#36825;&#20010;section&#37117;&#22312;__init_begin&#21644;__init_end&#20043;&#38388;&#65292;&#20063;&#23601;&#26159;&#35828;&#65292;&#35813;section&#25152;&#21344;&#20869;&#23384;&#20250;&#22312;&#31995;&#32479;&#21551;&#21160;&#21518;&#37322;&#25918;&#25481;&#65292;&#37027;&#20040;&#31995;&#32479;&#22914;&#20309;&#20026;&#27599;&#20010;CPU&#20445;&#30041;&#36825;&#20123;&#31169;&#26377;&#25968;&#25454;&#30340;&#65311;
</p>
<p>
&#22312;start_kernel&#20013;&#35843;&#29992;setup_per_cpu_areas&#12290;&#26412;&#36136;&#19978;&#21482;&#26377;&#23450;&#20041;&#20102;CONFIG_SMP&#65292;&#24182;&#19988;&#27809;&#26377;&#23450;&#20041;CONFIG_HAVE_SETUP_PER_CPU_AREA&#25165;&#20250;&#20351;&#29992;&#20869;&#26680;&#23383;&#33410;&#23450;&#20041;&#30340;&#27599;CPU&#21464;&#37327;&#21021;&#22987;&#21270;&#20989;&#25968;&#12290;&#22914;&#26524;&#23450;&#20041;&#20102;CONFIG_SMP&#65292;&#19988;&#23450;&#20041;&#20102;CONFIG_HAVE_SETUP_PER_CPU_AREA&#65292;&#37027;&#20040;&#35813;&#20989;&#25968;&#24517;&#39035;&#22312;&#23545;&#24212;&#26550;&#26500;&#30340;&#20195;&#30721;&#20013;&#23450;&#20041;&#65292;&#27604;&#22914;x86&#12290;
</p><pre class="programlisting">
#ifndef CONFIG_HAVE_SETUP_PER_CPU_AREA
unsigned long __per_cpu_offset[NR_CPUS] __read_mostly;

EXPORT_SYMBOL(__per_cpu_offset);

static void __init setup_per_cpu_areas(void)
{
    unsigned long size, i;
    char *ptr;
    unsigned long nr_possible_cpus = num_possible_cpus();

    /* Copy section for each CPU (we discard the original) */
    size = ALIGN(PERCPU_ENOUGH_ROOM, PAGE_SIZE);
    ptr = alloc_bootmem_pages(size * nr_possible_cpus);

    for_each_possible_cpu(i) {
            __per_cpu_offset[i] = ptr - __per_cpu_start;
            memcpy(ptr, __per_cpu_start, __per_cpu_end - __per_cpu_start);
            ptr += size;
    }
}
#endif /* CONFIG_HAVE_SETUP_PER_CPU_AREA */
</pre><p>
&#22312;&#35813;&#20989;&#25968;&#20013;&#65292;&#20026;&#27599;&#20010;CPU&#20998;&#37197;&#19968;&#27573;&#20869;&#23384;&#65292;&#24182;&#23558;.data.percpu&#20013;&#30340;&#25968;&#25454;&#25335;&#36125;&#21040;&#20854;&#20013;&#65292;&#27599;&#20010;CPU&#21508;&#26377;&#19968;&#20221;&#65292;&#20854;&#20013;CPU n&#23545;&#24212;&#30340;&#19987;&#26377;&#25968;&#25454;&#21306;&#30340;&#39318;&#22320;&#22336;&#20026;__per_cpu_offset[n]&#12290;&#36825;&#26679;&#65292;&#21069;&#36848;&#30456;&#24212;&#20110;__per_cpu_start&#30340;&#20559;&#31227;&#37327;per_cpu__runqueues&#23601;&#21464;&#25104;&#20102;&#30456;&#24212;&#20110;
__per_cpu_offset[n]&#30340;&#20559;&#31227;&#37327;&#65292;&#36825;&#26679;.data.percpu&#36825;&#20010;&#27573;&#22312;&#31995;&#32479;&#21021;&#22987;&#21270;&#21518;&#23601;&#21487;&#20197;&#37322;&#25918;&#20102;&#12290;
</p>
<p>
&#20026;&#27599;CPU&#21464;&#37327;&#25552;&#20379;&#30340;&#20989;&#25968;&#21644;&#23439;&#65306;
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">DEFINE_PER_CPU(type, name) &#38745;&#24577;&#20998;&#37197;&#19968;&#20010;&#27599;CPU&#25968;&#32452;&#65292;&#25968;&#32452;&#21517;&#20026;name&#65292;&#32467;&#26500;&#31867;&#22411;&#20026;type&#12290;&#22312;&#21333;CPU&#31995;&#32479;&#19978;&#65292;&#23601;&#26159;per_cpu__##name&#21464;&#37327;&#65292;&#32780;&#23545;&#20110;SMP&#26469;&#35828;&#23427;&#26159;&#19968;&#20010;&#32500;&#25968;&#20026;CPU&#20010;&#25968;&#30340;&#25968;&#32452;&#65292;&#20195;&#34920;&#35813;&#25968;&#32452;&#30340;&#36215;&#22987;&#22320;&#22336;&#12290;</li><li class="listitem">per_cpu(name, cpu) &#20026;CPU&#36873;&#25321;&#19968;&#20010;&#27599;CPU&#25968;&#32452;&#20803;&#32032;&#65292;CPU&#30001;&#21442;&#25968;cpu&#25351;&#23450;&#65292;&#25968;&#32452;&#21517;&#20026;name&#12290;</li><li class="listitem">__get_cpu_var(name) &#36873;&#25321;&#27599;CPU&#25968;&#32452;name&#30340;&#26412;&#22320;CPU&#20803;&#32032;</li><li class="listitem">get_cpu_var(name) &#20808;&#31105;&#29992;&#20869;&#26680;&#25250;&#21344;&#65292;&#28982;&#21518;&#22312;&#27599;CPU&#25968;&#32452;name&#20013;&#65292;&#20026;&#26412;&#22320;CPU&#36873;&#25321;&#20803;&#32032;&#12290;</li><li class="listitem">put_cpu_var(name) &#21551;&#29992;&#20869;&#26680;&#25250;&#21344;(&#19981;&#20351;&#29992;name)&#12290;</li><li class="listitem">alloc_percpu(type) &#21160;&#24577;&#20998;&#37197;type&#31867;&#22411;&#25968;&#25454;&#32467;&#26500;&#30340;&#27599;CPU&#25968;&#32452;&#65292;&#24182;&#36820;&#22238;&#23427;&#30340;&#22320;&#22336;&#12290;</li><li class="listitem">free_percpu(pointer) &#37322;&#25918;&#34987;&#21160;&#24577;&#20998;&#37197;&#30340;&#27599;CPU&#25968;&#32452;&#65292;pointer&#25351;&#31034;&#20854;&#22320;&#22336;&#12290;</li><li class="listitem">per_cpu_ptr(pointer, cpu) &#36820;&#22238;&#27599;CPU&#25968;&#32452;&#20013;&#19982;&#21442;&#25968;cpu&#23545;&#24212;&#30340;CPU&#20803;&#32032;&#22320;&#22336;&#65292;&#21442;&#25968;pointer&#32473;&#20986;&#25968;&#32452;&#22320;&#22336;&#12290;</li></ul></div><p>
</p><pre class="programlisting">
#define per_cpu_var(var) per_cpu__##var
</pre><p>
&#20197;&#19978;&#30340;&#22823;&#22810;&#25968;&#23439;&#37117;&#26159;&#22522;&#20110;per_cpu_var&#23439;&#30340;&#25193;&#23637;&#65292;&#20197;&#19979;&#20195;&#30721;&#23545;&#24212;SMP&#31995;&#32479;&#26102;&#30340;&#23450;&#20041;&#65306;
</p><pre class="programlisting">
#ifndef SHIFT_PERCPU_PTR
#define SHIFT_PERCPU_PTR(__p, __offset)	RELOC_HIDE((__p), (__offset))
#endif

#ifndef __per_cpu_offset
extern unsigned long __per_cpu_offset[NR_CPUS];
#define per_cpu_offset(x) (__per_cpu_offset[x])
#endif

#define per_cpu(var, cpu) \
	(*SHIFT_PERCPU_PTR(&amp;per_cpu_var(var), per_cpu_offset(cpu)))
#define __get_cpu_var(var) \
	(*SHIFT_PERCPU_PTR(&amp;per_cpu_var(var), my_cpu_offset))
#define __raw_get_cpu_var(var) \
	(*SHIFT_PERCPU_PTR(&amp;per_cpu_var(var), __my_cpu_offset))
</pre><p>
SHIFT_PERCPU_PTR&#35843;&#29992;&#32534;&#35793;&#22120;&#25552;&#20379;&#30340;&#20559;&#31227;&#23439;RELOC_HIDE&#23454;&#29616;&#20174;&#25968;&#32452;&#36215;&#22987;&#22320;&#22336;&#21040;&#24403;&#21069;CPU&#23545;&#24212;&#30340;&#20803;&#32032;&#30340;&#20559;&#31227;&#65292;per_cpu_offset&#21017;&#24341;&#29992;&#35843;&#25972;&#21518;&#30340;&#20559;&#31227;&#25968;&#32452;&#12290;&#23545;&#24212;&#21160;&#24577;&#20998;&#37197;&#30340;&#27599;CPU&#21464;&#37327;&#26469;&#35828;&#65292;SMP&#31995;&#32479;&#19978;&#20998;&#37197;&#26102;&#65292;&#20250;&#23558;size&#20056;&#20197;CPU&#30340;&#20010;&#25968;&#65292;&#24182;&#23558;&#22823;&#23567;&#22278;&#25972;&#21040;cache_line_size&#12290;
</p>
<p>
&#27599;CPU&#21464;&#37327;&#23545;SMP&#31995;&#32479;&#33267;&#20851;&#37325;&#35201;&#65292;&#23427;&#20445;&#35777;&#20102;CPU&#38388;&#30340;&#25968;&#25454;&#35775;&#38382;&#30340;&#38548;&#31163;&#65292;&#22312;&#21333;CPU&#31995;&#32479;&#19978;&#65292;&#23427;&#24635;&#26159;&#20197;&#21333;&#20010;&#29420;&#31435;&#30340;&#21464;&#37327;&#23384;&#22312;&#30340;&#12290;
</p>
</div>
<div class="sect3" title="20.4.2. &#21407;&#23376;&#25805;&#20316;"><div class="titlepage"><div><div><h4 class="title"><a name="idp81667508"></a>20.4.2. &#21407;&#23376;&#25805;&#20316;</h4></div></div></div>
&#33509;&#24178;&#27719;&#32534;&#35821;&#35328;&#25351;&#20196;&#24207;&#21015;&#20855;&#26377;"&#35835;&#8212;&#8212;&#20462;&#25913;&#8212;&#8212;&#20889;"&#30340;&#29305;&#24615;&#65292;&#23427;&#20204;&#35775;&#38382;&#23384;&#20648;&#22120;&#21333;&#20803;&#20004;&#27425;&#65292;&#31532;&#19968;&#27425;&#35835;&#21407;&#20540;&#65292;&#31532;&#20108;&#27425;&#20889;&#26032;&#20540;&#12290;&#20551;&#35774;&#36816;&#34892;&#22312;&#20004;&#20010;CPU&#19978;&#30340;&#37324;&#37027;&#20010;&#20010;&#20869;&#26680;&#25511;&#21046;&#36335;&#24452;&#35797;&#22270;&#36890;&#36807;&#25191;&#34892;&#38750;&#21407;&#23376;&#25805;&#20316;&#26469;&#21516;&#26102;"&#35835;&#8212;&#8212;&#20462;&#25913;&#8212;&#8212;&#20889;"&#21516;&#19968;&#23384;&#20648;&#21333;&#20803;&#12290;&#39318;&#20808;&#65292;&#20004;&#20010;CPU&#37117;&#35797;&#22270;&#35835;&#21516;&#19968;&#21333;&#20803;&#65292;&#20294;&#26159;&#23384;&#20648;&#22120;&#20210;&#35009;&#22120;&#65288;&#23545;&#35775;&#38382;RAM&#33455;&#29255;&#30340;&#25805;&#20316;&#36827;&#34892;&#20018;&#34892;&#21270;&#30340;&#30828;&#20214;&#30005;&#36335;&#65289;&#25554;&#25163;&#65292;&#21482;&#20801;&#35768;&#20854;&#20013;&#30340;&#19968;&#20010;&#35775;&#38382;&#32780;&#35753;&#21478;&#19968;&#20010;&#24310;&#36831;&#12290;&#28982;&#32780;&#65292;&#24403;&#31532;&#19968;&#20010;&#35835;&#25805;&#20316;&#23436;&#25104;&#21518;&#65292;&#24310;&#36831;&#30340;CPU&#20174;&#37027;&#20010;&#23384;&#20648;&#22120;&#21333;&#20803;&#27491;&#22909;&#35835;&#21040;&#21516;&#19968;&#20010;(&#26087;)&#20540;&#12290;&#28982;&#21518;&#65292;&#20004;&#20010;CPU&#37117;&#35797;&#22270;&#21521;&#37027;&#20010;&#23384;&#20648;&#22120;&#21333;&#20803;&#20889;&#19968;&#26032;&#20540;&#65292;&#24635;&#32447;&#23384;&#20648;&#22120;&#35775;&#38382;&#22312;&#19968;&#27425;&#34987;&#23384;&#20648;&#22120;&#20210;&#35009;&#22120;&#20018;&#34892;&#21270;&#65292;&#26368;&#21518;&#65292;&#20004;&#20010;&#20889;&#25805;&#20316;&#37117;&#25104;&#21151;&#12290;&#20294;&#26159;&#65292;&#20840;&#23616;&#30340;&#32467;&#26524;&#26159;&#19981;&#23545;&#30340;&#65292;&#22240;&#20026;&#20004;&#20010;CPU&#20889;&#20837;&#20102;&#21516;&#19968;(&#26032;)&#20540;&#12290;&#22240;&#27492;&#65292;&#20004;&#20010;&#20132;&#38169;&#30340;"&#35835;&#8212;&#8212;&#20462;&#25913;&#8212;&#8212;&#20889;"&#25805;&#20316;&#25104;&#20102;&#19968;&#20010;&#21333;&#29420;&#30340;&#25805;&#20316;&#12290;
<p>&#36991;&#20813;"&#35835;&#8212;&#8212;&#20462;&#25913;&#8212;&#8212;&#20889;"&#25351;&#20196;&#24341;&#36215;&#30340;&#31454;&#20105;&#26465;&#20214;&#30340;&#26368;&#23481;&#26131;&#30340;&#21150;&#27861;&#65292;&#23601;&#26159;&#30830;&#20445;&#36825;&#26679;&#30340;&#25805;&#20316;&#22312;&#33455;&#29255;&#32423;&#26159;&#21407;&#23376;&#30340;&#12290;&#20219;&#20309;&#19968;&#20010;&#36825;&#26679;&#30340;&#25805;&#20316;&#37117;&#24517;&#39035;&#20197;&#21333;&#20010;&#25351;&#20196;&#25191;&#34892;&#65292;&#20013;&#38388;&#19981;&#33021;&#20013;&#26029;&#65292;&#19988;&#36991;&#20813;&#20854;&#23427;&#30340;CPU&#35775;&#38382;&#21516;&#19968;&#23384;&#20648;&#22120;&#21333;&#20803;&#12290;&#36825;&#20123;&#24456;&#23567;&#30340;&#21407;&#23376;&#25805;&#20316;(atomic operations)&#21487;&#20197;&#24314;&#31435;&#22312;&#20854;&#20182;&#26356;&#28789;&#27963;&#26426;&#21046;&#30340;&#22522;&#30784;&#20043;&#19978;&#20197;&#21019;&#24314;&#20020;&#30028;&#21306;&#12290;
</p>
<p>
&#22238;&#39038;&#19968;&#19979;80x86&#30340;&#25351;&#20196;&#65306;
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">&#36827;&#34892;&#38646;&#27425;&#25110;&#19968;&#27425;&#23545;&#40784;&#20869;&#23384;&#35775;&#38382;&#30340;&#27719;&#32534;&#25351;&#20196;&#26159;&#21407;&#23376;&#30340;&#65292;&#20294;&#26159;&#23545;&#38750;&#23545;&#40784;&#20869;&#23384;&#30340;&#35775;&#38382;&#36890;&#24120;&#19981;&#26159;&#21407;&#23376;&#30340;&#12290;</li><li class="listitem">&#22914;&#26524;&#22312;&#35835;&#25805;&#20316;&#20043;&#21518;&#65292;&#20889;&#25805;&#20316;&#20043;&#21069;&#27809;&#26377;&#20854;&#20182;&#22788;&#29702;&#22120;&#21344;&#29992;&#20869;&#23384;&#24635;&#32447;&#65292;&#37027;&#20040;&#20174;&#20869;&#23384;&#20013;&#35835;&#21462;&#25968;&#25454;&#65292;&#26356;&#26032;&#25968;&#25454;&#24182;&#25226;&#26356;&#26032;&#21518;&#30340;&#25968;&#25454;&#20889;&#22238;&#20869;&#23384;&#20013;&#30340;&#36825;&#20123;"&#35835;&#8212;&#8212;&#20462;&#25913;&#8212;&#8212;&#20889;"&#27719;&#32534;&#35821;&#35328;&#25351;&#20196;(&#22914;inc&#25110;dec)&#26159;&#21407;&#23376;&#30340;&#12290;&#24403;&#28982;&#65292;&#22312;&#21333;&#22788;&#29702;&#22120;&#31995;&#32479;&#20013;&#65292;&#27704;&#36828;&#19981;&#20250;&#21457;&#29983;&#20869;&#23384;&#24635;&#32447;&#31363;&#29992;&#30340;&#24773;&#20917;&#12290;</li><li class="listitem">&#25805;&#20316;&#30721;&#21069;&#32512;&#26159;lock&#23383;&#33410;(0xf0)&#30340;"&#35835;&#8212;&#8212;&#20462;&#25913;&#8212;&#8212;&#20889;"&#27719;&#32534;&#35821;&#35328;&#25351;&#20196;&#21363;&#20351;&#22312;&#22810;&#22788;&#29702;&#22120;&#31995;&#32479;&#20013;&#20063;&#26159;&#21407;&#23376;&#30340;&#12290;&#23545;&#20110;ARM&#26469;&#35828;&#65292;&#36825;&#20123;&#25351;&#20196;&#24102;&#26377;ex&#21518;&#32512;&#65292;&#23427;&#20204;&#21482;&#22312;ARMv6&#21644;&#26356;&#39640;&#29256;&#26412;&#30340;&#25351;&#20196;&#38598;&#20013;&#25165;&#34987;&#25552;&#20379;&#65292;&#25152;&#20197;ARMv6&#20043;&#21069;&#30340;&#25351;&#20196;&#38598;&#26159;&#19981;&#25903;&#25345;SMP&#30340;&#12290;&#24403;&#25511;&#21046;&#21333;&#20803;&#26816;&#27979;&#21040;&#36825;&#20123;&#25351;&#20196;&#20013;&#30340;&#38145;&#23450;&#23383;&#27573;&#26102;&#65292;&#23601;"&#38145;&#23450;"&#20869;&#23384;&#24635;&#32447;&#65292;&#30452;&#21040;&#36825;&#26465;&#25351;&#20196;&#25191;&#34892;&#23436;&#25104;&#20026;&#27490;&#12290;&#22240;&#27492;&#65292;&#24403;&#21152;&#38145;&#30340;&#25351;&#20196;&#25191;&#34892;&#26102;&#65292;&#20854;&#20182;CPU&#19981;&#33021;&#35775;&#38382;&#36825;&#20010;&#20869;&#23384;&#21333;&#20803;&#12290;</li><li class="listitem">&#25805;&#20316;&#30721;&#21069;&#32512;&#26159;&#19968;&#20010;rep&#23383;&#33410;&#30340;&#27719;&#32534;&#25351;&#20196;&#19981;&#26159;&#21407;&#23376;&#30340;&#65292;&#36825;&#26465;&#25351;&#20196;&#24378;&#34892;&#35753;&#25511;&#21046;&#21333;&#20803;&#22810;&#27425;&#37325;&#22797;&#25191;&#34892;&#30456;&#21516;&#30340;&#25351;&#20196;&#12290;&#25511;&#21046;&#21333;&#20803;&#22312;&#25191;&#34892;&#26032;&#30340;&#24490;&#29615;&#20043;&#21069;&#35201;&#26816;&#26597;&#25346;&#36215;&#30340;&#20013;&#26029;&#12290;</li></ul></div><p>
&#22312;&#32534;&#20889;C&#20195;&#30721;&#31243;&#24207;&#26159;&#65292;&#19981;&#33021;&#20445;&#35777;&#32534;&#35793;&#22120;&#20250;&#20026;a = a + 1&#25110;&#32773;a++&#36825;&#26679;&#30340;&#25805;&#20316;&#20351;&#29992;&#19968;&#20010;&#21407;&#23376;&#25351;&#20196;&#12290;&#22240;&#27492;&#65292;Linux&#20869;&#26680;&#25552;&#20379;&#20102;&#19968;&#20010;&#19987;&#38376;&#30340;atomic_t&#31867;&#22411;(&#19968;&#20010;&#21407;&#23376;&#35775;&#38382;&#35745;&#26102;&#22120;)&#21644;&#19968;&#20123;&#23545;&#24212;&#30340;&#20989;&#25968;&#21644;&#23439;&#12290;&#36825;&#20010;&#20989;&#25968;&#21644;&#23439;&#20316;&#29992;&#20110;atomic_t&#31867;&#22411;&#30340;&#21464;&#37327;&#65292;&#24182;&#21487;&#20197;&#24403;&#20570;&#21407;&#23376;&#30340;&#27719;&#32534;&#35821;&#35328;&#25351;&#20196;&#26469;&#20351;&#29992;&#12290;
</p><pre class="programlisting">
arch/arm/include/asm/atomic.h
static inline void atomic_set(atomic_t *v, int i)
{
        unsigned long tmp;

        __asm__ __volatile__("@ atomic_set\n"
"1:     ldrex   %0, [%1]\n"
"       strex   %0, %2, [%1]\n"
"       teq     %0, #0\n"
"       bne     1b"
        : "=&amp;r" (tmp)
        : "r" (&amp;v-&gt;counter), "r" (i)
        : "cc");
}
</pre><p>
&#21487;&#20197;&#36890;&#36807;&#38145;&#24635;&#32447;&#25351;&#20196;&#22312;&#19968;&#20010;&#25351;&#20196;&#20013;&#23436;&#25104;&#65292;&#27604;&#22914;x86&#12290;&#23545;&#20110;ARM&#26469;&#35828;&#65292;&#20174;ARMv6&#25351;&#20196;&#38598;&#24320;&#22987;&#24341;&#20837;&#20102;&#20004;&#20010;&#38145;&#24635;&#32447;&#35775;&#38382;&#30340;&#25351;&#20196;ldrex&#21644;strex&#12290;&#23427;&#20204;&#24517;&#39035;&#25104;&#23545;&#20986;&#29616;&#65306;ldrex&#22312;&#35835;&#21462;&#25968;&#25454;&#20043;&#21069;&#20250;&#38145;&#23450;&#24635;&#32447;&#65292;&#36825;&#20010;&#25805;&#20316;&#34987;&#31216;&#20026;MarkExclusiveGlobal&#65292;&#32780;&#22312;strex&#20013;&#25165;&#20250;&#25191;&#34892;ClearExclusiveGlobal&#29992;&#26469;&#35299;&#38145;&#24635;&#32447;&#65292;&#36825;&#20854;&#20013;&#30340;&#25805;&#20316;&#37117;&#26159;&#21407;&#23376;&#30340;&#12290;&#20294;&#36825;&#26679;&#20570;&#23601;&#21487;&#20197;&#36991;&#20813;&#34987;&#20013;&#26029;&#25171;&#26029;&#21527;&#65311;&#19981;&#33021;&#65292;&#36825;&#21482;&#26159;&#20445;&#35777;&#20102;&#24635;&#32447;&#35775;&#38382;&#30340;&#38145;&#23450;&#65292;&#20294;&#26159;&#24182;&#27809;&#26377;&#31105;&#20013;&#26029;&#65292;&#20013;&#26029;&#24635;&#26159;&#22312;&#19968;&#20010;&#25351;&#20196;&#25191;&#34892;&#23436;&#27605;&#21518;&#34987;&#26816;&#26597;&#65292;&#25152;&#20197;&#22914;&#26524;&#22312;ldrex&#20013;&#21457;&#29983;&#20102;&#20013;&#26029;&#65292;&#24182;&#19988;&#20013;&#26029;ISR&#23581;&#35797;&#20102;&#23545;v&#30340;&#25805;&#20316;&#65292;&#37027;&#20040;&#36825;&#20010;&#24490;&#29615;&#23601;&#21487;&#33021;&#20250;&#25191;&#34892;&#22810;&#27425;&#65292;&#24182;&#19988;&#20013;&#26029;&#23545;v&#30340;&#25805;&#20316;&#23558;&#20002;&#22833;&#65292;&#25152;&#20197;&#20013;&#26029;&#22788;&#29702;&#20013;&#19981;&#24212;&#35813;&#35843;&#29992;&#29992;&#20110;&#21407;&#23376;&#25805;&#20316;&#30340;&#23439;&#20989;&#25968;&#12290;&#26368;&#26032;&#30340;ARM&#25351;&#20196;&#38598;&#25903;&#25345;monitor&#26631;&#35760;&#26426;&#21046;&#65292;&#23427;&#19981;&#20250;&#38145;&#24635;&#32447;&#65292;&#27492;&#26102;&#21407;&#23376;&#25805;&#20316;&#21253;&#21547;&#22914;&#19979;&#22235;&#20010;&#27493;&#39588;&#65306;
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">step 1.ldrex r0,[addr]    ; &#20174;addr&#20013;&#35835;&#21462;&#20540;,&#24182;&#20511;&#21161;monitor&#22312;&#23545;&#24212;&#30340;&#22320;&#22336;&#19978;&#20570;&#19968;&#20010;tag</li><li class="listitem">step 2. some operation   ;&#23545;&#35835;&#20986;&#30340;&#20540;&#20570;&#19968;&#20123;&#25805;&#20316;</li><li class="listitem">step 3. strex r1,r0,[addr]  ;&#23558;&#22788;&#29702;&#21518;&#30340;r0&#20889;&#22238;[addr],r1&#25351;&#31034;&#27492;&#27425;&#20889;&#25805;&#20316;&#26159;&#21542;&#25104;&#21151;&#65292;&#32780;&#27492;&#27425;&#20889;&#25805;&#20316;&#33021;&#22815;&#25104;&#21151;&#30340;&#19968;&#20010;&#26465;&#20214;&#26159;&#65292;&#22312;step 1&#30340;ldrex&#20013;&#26631;&#35760;&#30340;tag&#20173;&#28982;&#23384;&#22312;.</li><li class="listitem">step 4. teq r1,#0;bne 1b    ;&#22914;&#26524;step 3&#20889;&#22833;&#36133;&#65292;&#36820;&#22238;step 1.</li></ul></div><p>
&#22312;linux&#20013;&#65292;&#22312;&#25152;&#26377;&#20013;&#26029;&#30340;&#20837;&#21475;&#37117;&#20250;&#35843;&#29992;clrex&#26469;&#28165;&#38500;&#25481;monitor&#26631;&#35760;&#30340;&#36825;&#20010;tag&#65292;&#37027;&#20040;&#22914;&#26524;step 1&#21644;step 3&#20043;&#38388;&#26377;&#20013;&#26029;&#21457;&#29983;&#65292;&#22312;&#20013;&#26029;&#22788;&#29702;&#23436;&#25104;&#36820;&#22238;&#20043;&#21518;step 3&#20250;&#22833;&#36133;&#65288;&#22240;&#20026;step1&#20013;&#30340;tag&#24050;&#32463;&#34987;&#28165;&#38500;&#65289;&#65292;&#28982;&#21518;&#21448;&#20250;&#36827;&#20837;step 1&#37325;&#26032;&#35835;[addr]&#20013;&#30340;&#20540;&#12290;&#20063;&#23601;&#26159;&#26080;&#35770;&#22914;&#20309;&#37117;&#19981;&#20250;&#21457;&#29983;&#8220;&#20132;&#38169;&#35835;&#8221;&#36825;&#31181;&#29616;&#35937;&#12290;&#22240;&#20026;&#27599;&#27425;strex&#22833;&#36133;&#20043;&#21518;&#37117;&#20250;&#37325;&#26032;&#20877;&#35835;&#19968;&#27425;[addr]&#30340;&#20540;&#12290;&#31867;&#20284;&#20110;atomic_set&#65292;Linux&#23450;&#20041;&#20102;&#19968;&#20123;&#21015;&#30340;&#23439;&#21644;&#20989;&#25968;&#65306;
</p><div class="table"><a name="idp81677084"></a><p class="title"><b>&#34920; 31. Linux&#20013;&#30340;&#21407;&#23376;&#25805;&#20316;</b></p><div class="table-contents">
<table summary="Linux&#20013;&#30340;&#21407;&#23376;&#25805;&#20316;" border="1"><colgroup><col><col></colgroup><thead><tr><th>&#20989;&#25968;</th><th>&#35828;&#26126;</th></tr></thead><tbody><tr><td>atomic_read(v)</td><td>&#36820;&#22238;*v</td></tr><tr><td>atomic_set(v, i)</td><td>&#35774;&#32622;*v&#20026;i</td></tr><tr><td>atomic_add(i, v)</td><td>&#32473;*v&#21152;i</td></tr><tr><td>atomic_sub(i, v)</td><td>&#20174;*v&#20943;i</td></tr><tr><td>atomic_sub_and_test(i, v)</td><td> </td></tr><tr><td>atomic_inc(v)</td><td>*v&#21152;1</td></tr><tr><td>atomic_dec(v)</td><td>*v&#20943;1</td></tr><tr><td>atomic_dec_and_test(v)</td><td>*v&#20943;1&#65292;&#22914;&#26524;&#20026;0&#65292;&#36820;&#22238;1&#65292;&#21542;&#21017;&#36820;&#22238;0</td></tr><tr><td>atomic_inc_and_test(v)</td><td>*v&#21152;1&#65292;&#22914;&#26524;&#20026;0&#65292;&#36820;&#22238;1&#65292;&#21542;&#21017;&#36820;&#22238;0</td></tr><tr><td>atomic_add_negative(i, v)</td><td>*v&#21152;i&#65292;&#32467;&#26524;&#20026;&#36127;&#36131;&#36820;&#22238;1&#65292;&#21542;&#21017;&#36820;&#22238;0</td></tr><tr><td>atomic_inc/dec_return(v)</td><td>&#21152;/&#20943;1&#21518;&#36820;&#22238;&#26032;&#20540;</td></tr><tr><td>atomic_add/sub_return(i, v)</td><td>&#21152;/&#20943;i&#21518;&#36820;&#22238;&#26032;&#20540;</td></tr></tbody></table>
</div></div><p><br class="table-break">
&#20869;&#26680;&#36890;&#36807;&#27719;&#32534;&#28151;&#21512;&#32534;&#31243;&#23454;&#29616;&#20102;&#26680;&#24515;&#20989;&#25968;atomic_set&#65292;atomic_add_return&#31561;&#20989;&#25968;&#65292;&#28982;&#21518;&#23545;&#23427;&#20204;&#36827;&#34892;&#23439;&#25193;&#23637;&#65306;
</p><pre class="programlisting">
#define atomic_add(i, v)        (void) atomic_add_return(i, v)
#define atomic_inc(v)           (void) atomic_add_return(1, v)
#define atomic_sub(i, v)        (void) atomic_sub_return(i, v)
#define atomic_dec(v)           (void) atomic_sub_return(1, v)

#define atomic_inc_and_test(v)  (atomic_add_return(1, v) == 0)
#define atomic_dec_and_test(v)  (atomic_sub_return(1, v) == 0)
#define atomic_inc_return(v)    (atomic_add_return(1, v))
#define atomic_dec_return(v)    (atomic_sub_return(1, v))
#define atomic_sub_and_test(i, v) (atomic_sub_return(i, v) == 0)

#define atomic_add_negative(i,v) (atomic_add_return(i, v) &lt; 0)
</pre><p>
&#27880;&#24847;&#21040;&#36825;&#20123;&#21547;&#26377;test&#21518;&#32512;&#30340;&#23439;&#65292;&#27604;&#36739;&#36816;&#31639;&#24182;&#19981;&#22312;&#21407;&#23376;&#25805;&#20316;&#20013;&#36827;&#34892;&#65292;&#20063;&#21363;&#27604;&#36739;&#26102;&#65292;&#36825;&#20010;&#20540;&#21487;&#33021;&#24050;&#32463;&#34987;&#20854;&#20182;CPU&#26356;&#26032;&#12290;&#21478;&#19968;&#31867;&#21407;&#23376;&#20989;&#25968;&#29992;&#20316;&#20301;&#25513;&#30721;&#25805;&#20316;&#12290;
</p><div class="table"><a name="idp81685460"></a><p class="title"><b>&#34920; 32. Linux&#20013;&#30340;&#21407;&#23376;&#20301;&#22788;&#29702;&#20989;&#25968;</b></p><div class="table-contents">
<table summary="Linux&#20013;&#30340;&#21407;&#23376;&#20301;&#22788;&#29702;&#20989;&#25968;" border="1"><colgroup><col><col></colgroup><thead><tr><th>&#20989;&#25968;</th><th>&#35828;&#26126;</th></tr></thead><tbody><tr><td>test_bit(nr, addr)</td><td>&#36820;&#22238;*addr&#30340;&#31532;nr&#20301;&#30340;&#20540;</td></tr><tr><td>set_bit(nr, addr)</td><td>&#35774;&#32622;*addr&#30340;&#31532;nr&#20301;</td></tr><tr><td>clear_bit(nr, addr)</td><td>&#28165;*addr&#30340;&#31532;nr&#20301;</td></tr><tr><td>change_bit(nr, addr)</td><td>&#36716;&#25442;*addr&#30340;&#31532;nr&#20301;</td></tr><tr><td>test_and_set_bit(nr, addr)</td><td>&#35774;&#32622;*addr&#30340;&#31532;nr&#20301;&#65292;&#24182;&#36820;&#22238;&#21407;&#20540;</td></tr><tr><td>test_and_clear_bit(nr, addr)</td><td>&#28165;*addr&#30340;&#31532;nr&#20301;&#65292;&#24182;&#36820;&#22238;&#21407;&#20540;</td></tr><tr><td>test_and_change_bit(nr, addr)</td><td>&#36716;&#25442;*addr&#30340;&#31532;nr&#20301;&#65292;&#24182;&#36820;&#22238;&#21407;&#20540;</td></tr><tr><td>atomic_clear_mask(mask, addr)</td><td>&#28165;mask&#25351;&#23450;&#30340;*addr&#30340;&#25152;&#26377;&#20301;</td></tr><tr><td>atomic_set_mask(mask, addr)</td><td>&#35774;&#32622;mask&#25351;&#23450;&#30340;*addr&#30340;&#25152;&#26377;&#20301;</td></tr></tbody></table>
</div></div><p><br class="table-break">
x86&#20013;&#25552;&#20379;&#20102;&#23436;&#21892;&#38024;&#23545;&#20301;&#30340;&#21407;&#23376;&#25805;&#20316;&#25351;&#20196;&#65292;&#20294;&#26159;&#24403;&#21069;ARM&#30340;&#38750;SMP&#31995;&#32479;&#30340;bit&#23454;&#29616;&#38500;atomic_clear_mask/atomic_set_mask&#22806;&#21482;&#26159;&#32771;&#34385;&#20102;&#20013;&#26029;&#30340;&#24178;&#25200;&#22240;&#32032;&#65292;&#24182;&#27809;&#26377;&#20351;&#29992;strex&#21644;ldrex&#25351;&#20196;&#65292;&#25152;&#20197;&#22914;&#26524;&#38656;&#35201;&#25903;&#25345;SMP&#65292;&#38656;&#35201;&#20462;&#25913;&#36825;&#20123;&#20989;&#25968;&#30340;&#23454;&#29616;&#12290;
</p>
</div>
<div class="sect3" title="20.4.3. &#33258;&#26059;&#38145;"><div class="titlepage"><div><div><h4 class="title"><a name="idp81691540"></a>20.4.3. &#33258;&#26059;&#38145;</h4></div></div></div>
<p>
&#19968;&#31181;&#24191;&#27867;&#24212;&#29992;&#30340;&#21516;&#27493;&#25216;&#26415;&#26159;&#21152;&#38145;(locking)&#12290;&#24403;&#20869;&#26680;&#25511;&#21046;&#36335;&#24452;&#24517;&#39035;&#35775;&#38382;&#20849;&#20139;&#25968;&#25454;&#32467;&#26500;&#25110;&#36827;&#20837;&#20020;&#30028;&#21306;&#26102;&#65292;&#23601;&#38656;&#35201;&#20026;&#33258;&#24049;&#33719;&#21462;&#19968;&#25226;"&#38145;"&#12290;&#30001;&#38145;&#26426;&#21046;&#20445;&#25252;&#30340;&#36164;&#28304;&#38750;&#24120;&#31867;&#20284;&#20110;&#38480;&#21046;&#20110;&#25151;&#38388;&#20869;&#30340;&#36164;&#28304;&#65292;&#24403;&#26576;&#20154;&#36827;&#20837;&#25151;&#38388;&#26102;&#65292;&#23601;&#25226;&#38376;&#38145;&#19978;&#12290;&#22914;&#26524;&#20869;&#26680;&#25511;&#21046;&#36335;&#24452;&#24076;&#26395;&#35775;&#38382;&#36164;&#28304;&#65292;&#23601;&#35797;&#22270;&#33719;&#21462;&#35201;&#26159;"&#25171;&#24320;&#38376;"&#12290;&#24403;&#19988;&#20165;&#24403;&#36164;&#28304;&#31354;&#38386;&#26102;&#65292;&#23427;&#25165;&#33021;&#25104;&#21151;&#12290;&#28982;&#21518;&#65292;&#21482;&#35201;&#23427;&#36824;&#24819;&#20351;&#29992;&#36825;&#20010;&#36164;&#28304;&#20320;&#65292;&#38376;&#23601;&#20381;&#28982;&#38145;&#30528;&#12290;&#24403;&#20869;&#26680;&#25511;&#21046;&#36335;&#24452;&#37322;&#25918;&#20102;&#38145;&#26102;&#65292;&#38376;&#23601;&#25171;&#24320;&#65292;&#21478;&#19968;&#20010;&#20869;&#26680;&#25511;&#21046;&#36335;&#24452;&#23601;&#21487;&#20197;&#36827;&#20837;&#25151;&#38388;&#12290;
</p>
<p>
&#33258;&#26059;&#38145;(spin lock)&#26159;&#29992;&#26469;&#22312;&#22810;&#22788;&#29702;&#22120;&#29615;&#22659;&#20013;&#24037;&#20316;&#30340;&#19968;&#31181;&#29305;&#27530;&#30340;&#38145;&#12290;&#22914;&#26524;&#20869;&#26680;&#25511;&#21046;&#36335;&#24452;&#21457;&#29616;&#33258;&#26059;&#38145;"&#24320;&#30528;"&#65292;&#23601;&#33719;&#21462;&#38145;&#24182;&#32487;&#32493;&#33258;&#24049;&#30340;&#25191;&#34892;&#12290;&#30456;&#21453;&#65292;&#22914;&#26524;&#20869;&#26680;&#25511;&#21046;&#36335;&#24452;&#21457;&#29616;&#38145;&#36816;&#34892;&#22312;&#21478;&#19968;&#20010;CPU&#19978;&#30340;&#21870;&#21512;&#25511;&#21046;&#36335;&#24452;"&#38145;&#30528;"&#65292;&#23601;&#22312;&#21608;&#22260;"&#26059;&#36716;"&#65292;&#21453;&#22797;&#25191;&#34892;&#19968;&#26465;&#32039;&#20945;&#30340;&#24490;&#29615;&#25351;&#20196;&#65292;&#30452;&#21040;&#38145;&#34987;&#37322;&#25918;&#12290;
</p>
<p>
&#33258;&#26059;&#38145;&#30340;&#24490;&#29615;&#25351;&#20196;&#34920;&#31034;"&#24537;&#31561;"&#12290;&#21363;&#20351;&#31561;&#24453;&#30340;&#20869;&#26680;&#25511;&#21046;&#36335;&#24452;&#26080;&#20107;&#21487;&#20570;&#65292;&#23427;&#20063;&#22312;CPU&#19978;&#20445;&#25345;&#36816;&#34892;&#12290;&#19981;&#38169;&#65292;&#33258;&#26059;&#38145;&#36890;&#24120;&#38750;&#24120;&#26041;&#20415;&#65292;&#22240;&#20026;&#24456;&#22810;&#20869;&#26680;&#36164;&#28304;&#21482;&#38145;1&#27627;&#31186;&#30340;&#26102;&#38388;&#29255;&#27573;&#65307;&#25152;&#20197;&#35828;&#65292;spin_lock&#30340;&#24320;&#38144;&#36824;&#26159;&#27604;&#36827;&#31243;&#35843;&#24230;(context switch&#65289;&#23569;&#24471;&#22810;&#12290;
</p>
<p>
&#19968;&#33324;&#26469;&#35828;&#65292;&#30001;&#33258;&#26059;&#38145;&#25152;&#20445;&#25252;&#30340;&#27599;&#20010;&#20020;&#30028;&#21306;&#37117;&#26159;&#31105;&#27490;&#20869;&#26680;&#25250;&#21344;&#30340;&#12290;&#22312;&#21333;&#22788;&#29702;&#22120;&#31995;&#32479;&#19978;&#65292;&#36825;&#31181;&#38145;&#26412;&#36523;&#24182;&#19981;&#36215;&#38145;&#30340;&#20316;&#29992;&#65292;&#33258;&#26059;&#38145;&#20165;&#20165;&#31105;&#27490;&#25110;&#21551;&#29992;&#20869;&#26680;&#25250;&#21344;&#12290;&#35831;&#27880;&#24847;&#65292;&#22312;&#33258;&#26059;&#38145;&#24537;&#31561;&#26399;&#38388;&#65292;&#20869;&#26680;&#25250;&#21344;&#36824;&#26159;&#26377;&#25928;&#30340;&#65292;&#22240;&#27492;&#65292;&#31561;&#24453;&#33258;&#26059;&#38145;&#37322;&#25918;&#30340;&#25152;&#26377;&#36827;&#31243;&#26377;&#21487;&#33021;&#34987;&#26356;&#39640;&#20248;&#20808;&#32423;&#30340;&#36827;&#31243;&#26367;&#20195;&#12290;
</p>
<p>
&#23545;spinlock&#25805;&#20316;&#30340;&#23450;&#20041;&#19982;&#20307;&#31995;&#32467;&#26500;&#24687;&#24687;&#30456;&#20851;&#65292;&#23545;&#20110;SMP&#26469;&#35828;&#65292;&#24517;&#39035;&#35201;&#26131;&#20110;&#35813;&#20307;&#31995;&#30340;&#27719;&#32534;&#25351;&#20196;&#26469;&#23454;&#29616;&#24635;&#32447;&#38145;&#23450;&#65292;&#32780;&#23545;&#21333;CPU&#31995;&#32479;&#26469;&#35828;&#65292;&#23558;&#31616;&#21333;&#30340;&#22810;&#65292;&#23427;&#24314;&#31435;&#22312;&#20869;&#26680;&#25250;&#21344;&#20043;&#19978;&#65292;&#22914;&#26524;&#27809;&#26377;&#20351;&#33021;CONFIG_PREEMPT&#65292;&#37027;&#20040;&#33258;&#26059;&#38145;&#20160;&#20040;&#20063;&#19981;&#20570;&#12290;spinlock&#22836;&#25991;&#20214;&#30340;&#27880;&#37322;&#26377;&#35814;&#32454;&#35828;&#26126;&#12290;&#23545;&#20110;SMP&#31995;&#32479;&#26469;&#35828;&#30456;&#20851;&#30340;&#22836;&#25991;&#20214;&#22914;&#19979;&#65306;
</p><pre class="programlisting">
include/linux/spinlock.h

*  asm/spinlock_types.h: contains the raw_spinlock_t/raw_rwlock_t and the
*                        initializers*
*  asm/spinlock.h:       contains the __raw_spin_*()/etc. lowlevel
*                        implementations, mostly inline assembly code
*  linux/spinlock_api_smp.h:
*                        contains the prototypes for the _spin_*() APIs.

typedef struct {
        volatile unsigned int lock;
} raw_spinlock_t;
</pre><p>
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">asm/spinlock_types.h &#21253;&#21547;raw_spinlock_t/raw_rwlock_t&#30340;&#23450;&#20041;&#21644;&#21021;&#22987;&#21270;&#12290;</li><li class="listitem">asm/spinlock.h &#23450;&#20041;&#20102;&#27719;&#32534;&#20195;&#30721;&#23454;&#29616;&#30340;__raw_spin_*()&#31995;&#21015;&#20989;&#25968;&#12290;</li><li class="listitem">linux/spinlock_api_smp.h &#23553;&#35013;&#20102;SMP&#19978;&#30340;_spin_*()&#31995;&#21015;&#20989;&#25968;&#12290;</li></ul></div><p>
&#23545;&#20110;&#21333;CPU&#30340;&#22788;&#29702;&#30456;&#24403;&#31616;&#21333;&#65292;&#27492;&#26102;&#26681;&#26412;&#23601;&#19981;&#20250;&#32534;&#35793;kernel/spinlock.c&#25991;&#20214;&#65292;&#30456;&#20851;&#30340;&#22836;&#25991;&#20214;&#22914;&#19979;&#65306;
</p><pre class="programlisting">
 *  linux/spinlock_type_up.h: contains the generic, simplified UP spinlock type.
 *                           (which is an empty structure on non-debug builds)
 *  linux/spinlock_up.h:  contains the __raw_spin_*()/etc. version of UP
 *                        builds. (which are NOPs on non-debug, non-preempt
 *                        builds)
 *  linux/spinlock_api_up.h:  builds the _spin_*() APIs.
 
typedef struct { } raw_spinlock_t;
</pre><p>
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">linux/spinlock_type_up.h &#21253;&#21547;&#20102;&#36890;&#29992;&#65292;&#31616;&#21270;&#30340;&#21333;CPU&#31995;&#32479;&#19978;&#30340;spinlock_t&#31867;&#22411;&#65292;&#26174;&#28982;</li><li class="listitem">asm/spinlock_up.h &#23450;&#20041;&#20102;&#22522;&#20110;&#20869;&#26680;&#25250;&#21344;&#30340;__raw_spin_*()&#31995;&#21015;&#20989;&#25968;&#12290;</li><li class="listitem">linux/spinlock_api_up.h &#23553;&#35013;&#20102;&#21333;&#31995;&#32479;&#19978;&#30340;_spin_*()&#31995;&#21015;&#20989;&#25968;&#12290;</li></ul></div><p>
linux/spinlock_types.h&#26681;&#25454;&#21333;&#31995;&#32479;&#21644;SMP&#30340;&#22836;&#25991;&#20214;&#65292;&#23450;&#20041;&#20102;spinlock_t&#30340;&#36890;&#29992;&#31867;&#22411;&#65306;
</p><pre class="programlisting">
#if defined(CONFIG_SMP)
# include &lt;asm/spinlock_types.h&gt;
#else
# include &lt;linux/spinlock_types_up.h&gt;
#endif

typedef struct {
	raw_spinlock_t raw_lock;
#ifdef CONFIG_GENERIC_LOCKBREAK
	unsigned int break_lock;
#endif
} spinlock_t;
</pre><p>
&#22312;Linux&#30340;SMP&#31995;&#32479;&#20013;&#20013;&#65292;&#27599;&#20010;&#33258;&#26059;&#38145;&#37117;&#29992;spinlock_t&#32467;&#26500;&#34920;&#31034;&#65292;&#20854;&#20013;&#21253;&#21547;&#20004;&#20010;&#23383;&#27573;&#65306;
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">raw_lock &#35813;&#23383;&#27573;&#34920;&#31034;&#33258;&#26059;&#38145;&#30340;&#29366;&#24577;&#65306;&#20540;&#20026;1&#34920;&#31034;"&#26410;&#21152;&#38145;"&#12290;&#32780;&#20219;&#20309;&#36171;&#20540;&#21644;0&#37117;&#34920;&#31034;"&#21152;&#38145;"&#29366;&#24577;&#12290;</li><li class="listitem">break_lock &#34920;&#31034;&#36827;&#31243;&#27491;&#22312;&#24537;&#31561;&#33258;&#26059;&#38145;(&#21482;&#22312;&#20869;&#26680;&#25903;&#25345;SMP&#21644;&#20869;&#26680;&#25250;&#21344;&#30340;&#24773;&#20917;&#19979;&#20351;&#29992;&#35813;&#26631;&#24535;)&#12290;</li></ul></div><p>
linux/spinlock.h &#23553;&#35013;&#20102;&#26368;&#32456;&#23545;&#22806;&#20351;&#29992;&#30340;spin_*()&#24212;&#29992;&#20989;&#25968;&#65306;
</p><pre class="programlisting">
include/linux/spinlock.h
#define spin_lock(lock)			_spin_lock(lock)

include/linux/spinlock_api_up.h
#define __LOCK(lock) \
  do { preempt_disable(); __acquire(lock); (void)(lock); } while (0)
#define _spin_lock(lock)			__LOCK(lock)
</pre><p>
&#36825;&#37324;&#24456;&#28165;&#26970;&#30340;&#21487;&#20197;&#30475;&#21040;&#21482;&#26159;&#31105;&#29992;&#20869;&#26680;&#25250;&#21344;&#32780;&#24050;&#65292;&#32780;(void)(lock)&#21482;&#26159;&#38450;&#27490;&#32534;&#35793;&#22120;&#25552;&#31034;&#21464;&#37327;&#26410;&#20351;&#29992;&#65292;&#36825;&#37324;&#24182;&#27809;&#26377;&#20351;&#29992;&#20219;&#20309;&#30495;&#27491;&#30340;spinlock&#12290;&#32780;&#23545;&#20110;SMP&#31995;&#32479;&#26469;&#35828;&#65292;&#21017;&#30456;&#23545;&#22797;&#26434;&#65306;
</p><pre class="programlisting">
kernel/spinlock.c
void __lockfunc _spin_lock(spinlock_t *lock)
{
	preempt_disable();
	spin_acquire(&amp;lock-&gt;dep_map, 0, 0, _RET_IP_);
	LOCK_CONTENDED(lock, _raw_spin_trylock, _raw_spin_lock);
}
</pre><p>
&#27880;&#24847;&#36825;&#37324;&#21516;&#21333;&#31995;&#32479;&#19968;&#26679;&#39318;&#20808;&#31105;&#27490;&#20869;&#26680;&#25250;&#21344;&#65292;&#28982;&#21518;LOCK_CONTENDED&#23558;&#35843;&#29992;&#20307;&#31995;&#32467;&#26500;&#30456;&#20851;&#30340;&#20989;&#25968;_raw_spin_lock&#65292;&#23545;&#20110;ARM&#26469;&#35828;&#65292;&#23427;&#30340;&#23454;&#29616;&#22914;&#19979;&#65306;
</p><pre class="programlisting">
include/linux/spinlock.h
# define _raw_spin_lock(lock)		__raw_spin_lock(&amp;(lock)-&gt;raw_lock)

arch/arm/include/asm/spinlock.h
#define __raw_spin_lock_flags(lock, flags) __raw_spin_lock(lock)
static inline void __raw_spin_lock(raw_spinlock_t *lock)
{
        unsigned long tmp;

        __asm__ __volatile__(
"1:     ldrex   %0, [%1]\n"
"       teq     %0, #0\n"
#ifdef CONFIG_CPU_32v6K
"       wfene\n"
#endif
"       strexeq %0, %2, [%1]\n"
"       teqeq   %0, #0\n"
"       bne     1b"
        : "=&amp;r" (tmp)
        : "r" (&amp;lock-&gt;lock), "r" (1)
        : "cc");

        smp_mb();
}
</pre><p>
&#36825;&#37324;&#23601;&#22914;&#21407;&#23376;&#25805;&#20316;&#19968;&#26679;&#23581;&#35797;&#22312;&#38145;&#24635;&#32447;&#30340;&#24773;&#20917;&#19979;&#26469;&#36827;&#34892;&#24490;&#29615;&#31561;&#24453;&#65292;&#22312;strexeq&#65292;teqeq&#21644;bne&#21478;&#19968;&#20010;CPU&#23558;&#20250;&#37322;&#25918;&#38145;&#65292;&#20063;&#21363;&#23558;&#22686;&#21152;lock&#30340;&#20540;&#65292;&#36825;&#22312;&#19979;&#19968;&#27425;ldrex&#22788;&#29702;&#20013;&#23558;&#21407;&#23376;&#30340;&#33719;&#21462;&#35813;&#38145;&#12290;&#20294;&#26159;&#36825;&#24182;&#19981;&#33021;&#20445;&#35777;&#20013;&#26029;&#19981;&#20250;&#25171;&#26029;&#35813;spinlock&#65292;&#25152;&#20197;&#20381;&#28982;&#20250;&#36827;&#34892;&#20013;&#26029;&#22788;&#29702;&#65292;&#24182;&#19988;&#22312;&#20013;&#26029;&#22788;&#29702;&#32467;&#26463;&#26102;&#65292;&#30001;&#20110;&#31105;&#27490;&#20869;&#26680;&#25250;&#21344;&#32780;&#36339;&#36807;&#35843;&#24230;&#22788;&#29702;(&#21442;&#32771;irq_svc&#30340;&#22788;&#29702;)&#12290;
</p><div class="table"><a name="idp81703420"></a><p class="title"><b>&#34920; 33. &#33258;&#26059;&#38145;&#23439;</b></p><div class="table-contents">
<table summary="&#33258;&#26059;&#38145;&#23439;" border="1"><colgroup><col><col></colgroup><thead><tr><th>&#23439;</th><th>&#35828;&#26126;</th></tr></thead><tbody><tr><td>spin_lock_init()</td><td>&#25226;&#33258;&#26059;&#38145;&#32622;&#20026;1(&#26410;&#38145;)</td></tr><tr><td>spin_lock()</td><td> </td></tr><tr><td>spin_unlock()</td><td>&#25226;&#33258;&#26059;&#38145;&#32622;&#20026;1(&#26410;&#38145;)</td></tr><tr><td>spin_unlock_wait()</td><td>&#31561;&#24453;&#65292;&#30452;&#21040;&#33258;&#26059;&#38145;&#21464;&#20026;1(&#26410;&#38145;)</td></tr><tr><td>spin_is_locked()</td><td>&#22914;&#26524;&#33258;&#26059;&#38145;&#34987;&#32622;&#20026;1(&#26410;&#38145;)&#65292;&#36820;&#22238;0&#65307;&#21542;&#21017;&#65292;&#36820;&#22238;1&#12290;</td></tr><tr><td>spin_trylock()</td><td>&#25226;&#33258;&#26059;&#38145;&#32622;&#20026;0(&#38145;&#19978;)&#65292;&#22914;&#26524;&#21407;&#26469;&#38145;&#30340;&#20540;&#20026;1&#65292;&#21542;&#21017;&#65292;&#36820;&#22238;0&#12290;</td></tr><tr><td> </td><td> </td></tr></tbody></table>
</div></div><p><br class="table-break">
&#20197;&#19978;&#30340;&#25805;&#20316;&#22343;&#38024;&#23545;SMP&#31995;&#32479;&#65292;&#22914;&#26524;&#26159;&#21333;CPU&#31995;&#32479;&#65292;&#37027;&#20040;&#26681;&#26412;&#19981;&#20250;&#25805;&#20316;lock&#25104;&#21592;&#65292;&#32780;&#21482;&#26159;&#23545;&#20869;&#26680;&#25250;&#21344;&#30340;&#20351;&#33021;&#25110;&#32773;&#21462;&#28040;&#12290;&#22914;&#26524;&#21333;&#31995;&#32479;&#27809;&#26377;&#20351;&#33021;&#20869;&#26680;&#25250;&#21344;&#65292;&#37027;spinlock&#23601;&#20160;&#20040;&#20063;&#19981;&#20250;&#20570;&#20102;&#12290;
</p><pre class="programlisting">
kernel/spinlock.c
void __lockfunc _spin_unlock(spinlock_t *lock)
{
	spin_release(&amp;lock-&gt;dep_map, 1, _RET_IP_);
	_raw_spin_unlock(lock);
	preempt_enable();
}
</pre><p>
SMP&#19978;&#30340;&#35299;&#38145;&#36807;&#31243;&#65292;&#39318;&#20808;&#36890;&#36807;&#27719;&#32534;&#20195;&#30721;_raw_spin_unlock&#37322;&#25918;&#38145;&#65292;&#28982;&#21518;&#20351;&#33021;&#20869;&#26680;&#25250;&#21344;&#65292;&#27880;&#24847;&#23427;&#20204;&#30340;&#39034;&#24207;&#12290;
</p>
</div>
<div class="sect3" title="20.4.4. &#35835;&#20889;&#33258;&#26059;&#38145;"><div class="titlepage"><div><div><h4 class="title"><a name="idp81694420"></a>20.4.4. &#35835;&#20889;&#33258;&#26059;&#38145;</h4></div></div></div>
<p>
&#35835;&#20889;&#33258;&#26059;&#38145;&#30340;&#24341;&#20837;&#26159;&#20026;&#20102;&#22686;&#21152;&#20869;&#26680;&#30340;&#24182;&#21457;&#33021;&#21147;&#12290;&#21482;&#35201;&#27809;&#26377;&#20869;&#26680;&#25511;&#21046;&#36335;&#24452;&#23545;&#25968;&#25454;&#32467;&#26500;&#36827;&#34892;&#20462;&#25913;&#65292;&#35835;&#20889;&#33258;&#26059;&#38145;&#23601;&#20801;&#35768;&#22810;&#20010;&#20869;&#26680;&#25511;&#21046;&#36335;&#24452;&#21516;&#26102;&#35835;&#21516;&#19968;&#25968;&#25454;&#32467;&#26500;&#12290;&#22914;&#26524;&#19968;&#20010;&#20869;&#26680;&#25511;&#21046;&#36335;&#24452;&#30456;&#23545;&#36825;&#20010;&#32467;&#26500;&#36827;&#34892;&#20889;&#25805;&#20316;&#65292;&#37027;&#20040;&#23427;&#39318;&#20808;&#33719;&#21462;&#35835;&#20889;&#38145;&#30340;&#20889;&#38145;&#65292;&#20889;&#38145;&#25480;&#26435;&#29420;&#21344;&#35775;&#38382;&#36825;&#20010;&#36164;&#28304;&#12290;&#24403;&#28982;&#20320;&#65292;&#20801;&#35768;&#23545;&#25968;&#25454;&#32467;&#26500;&#24182;&#21457;&#35835;&#21487;&#20197;&#25552;&#39640;&#31995;&#32479;&#24615;&#33021;&#12290;
</p>
<p>
&#27599;&#20010;&#35835;&#20889;&#33258;&#26059;&#38145;&#37117;&#26159;&#19968;&#20010;rwlock_t&#32467;&#26500;&#65292;&#19982;spinlock&#31867;&#20284;&#65292;&#23427;&#22312;&#21333;&#31995;&#32479;&#21644;SMP&#19978;&#23450;&#20041;&#20063;&#19981;&#21516;&#65306;
</p><pre class="programlisting">
include/linux/spinlock_types_up.h
typedef struct {
	/* no debug version on UP */
} raw_rwlock_t;

arch/arm/include/asm/spinlock_types.h
typedef struct {
        volatile unsigned int lock;
} raw_rwlock_t;
</pre><p>
SMP&#31995;&#32479;&#19978;&#65292;lock&#23383;&#27573;&#26159;&#19968;&#20010;32&#20301;&#30340;&#23383;&#27573;&#65292;&#20998;&#20026;&#20004;&#20010;&#19981;&#21516;&#30340;&#37096;&#20998;&#65306;
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">24&#20026;&#35745;&#25968;&#22120;&#65292;&#34920;&#31034;&#23545;&#21463;&#20445;&#25252;&#30340;&#25968;&#25454;&#32467;&#26500;&#24182;&#21457;&#22320;&#36827;&#34892;&#35835;&#25805;&#20316;&#30340;&#20869;&#26680;&#25511;&#21046;&#36335;&#24452;&#30340;&#25968;&#30446;&#12290;&#36825;&#20010;&#35745;&#25968;&#22120;&#30340;&#20108;&#36827;&#21046;&#34917;&#30721;&#23384;&#25918;&#22312;b[23:0]&#20301;&#12290;</li><li class="listitem">"&#26410;&#38145;"&#26631;&#24535;&#23383;&#27573;&#65292;&#24403;&#27809;&#26377;&#20869;&#26680;&#25511;&#21046;&#36335;&#24452;&#22312;&#35835;&#25110;&#20889;&#26102;&#35774;&#32622;&#35813;&#20301;&#65292;&#21542;&#21017;&#28165;0&#12290;&#36825;&#20010;"&#26410;&#38145;"&#26631;&#24535;&#23384;&#25918;&#22312;lock&#23383;&#27573;&#30340;b[24]&#12290;</li></ul></div><p>
&#27880;&#24847;&#65292;&#22914;&#26524;&#33258;&#26059;&#38145;&#20026;&#31354;(&#35774;&#32622;&#20102;"&#26410;&#38145;"&#26631;&#24535;&#19988;&#26080;&#35835;&#32773;)&#65292;&#37027;&#20040;lock&#23383;&#27573;&#30340;&#20540;&#20026;0x01000000&#65307;&#22914;&#26524;&#20889;&#32773;&#24050;&#32463;&#33719;&#24471;&#33258;&#26059;&#38145;("&#26410;&#38145;"&#26631;&#24535;&#28165;0&#19988;&#26080;&#35835;&#32773;)&#65292;&#37027;&#20040;lock&#23383;&#27573;&#30340;&#20540;&#20026;0&#65307;&#22914;&#26524;&#19968;&#20010;&#12289;&#20004;&#20010;&#25110;&#22810;&#20010;&#36827;&#31243;&#22240;&#20026;&#35835;&#33719;&#21462;&#20102;&#33258;&#26059;&#38145;&#65292;&#37027;&#20040;lock&#23383;&#27573;&#30340;&#20540;&#20026;0x00ffffff&#65292;0x00fffffe&#31561;("&#26410;&#38145;"&#26631;&#24535;&#28165;0&#65292;&#35835;&#32773;&#20010;&#25968;&#30340;&#20108;&#36827;&#21046;&#34917;&#30721;&#22312;0~23&#20301;&#19978;)&#12290;
</p>
<p>
</p>
<p>
</p>
</div>
</div>
<pre class="programlisting">

</pre>
</div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ar01s19.html">&#19978;&#19968;&#39029;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="ar01s21.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">19. &#20869;&#26680;&#36890;&#30693;&#38142; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top"> 21. Linux&#35774;&#22791;&#27169;&#22411;</td></tr></table></div></body></html>
