<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>15. IO&#35774;&#22791;&#31649;&#29702;</title><link rel="stylesheet" href="styles.css" type="text/css"><meta name="generator" content="DocBook XSL-NS Stylesheets V1.75.2"><link rel="home" href="index.html" title="Linux&#20869;&#26680;&#23398;&#20064;&#21644;&#30740;&#31350;&#21450;&#23884;&#20837;&#24335;(ARM)&#23398;&#20064;&#21644;&#30740;&#31350;&#30340;&#24320;&#25918;&#25991;&#26723;"><link rel="up" href="index.html" title="Linux&#20869;&#26680;&#23398;&#20064;&#21644;&#30740;&#31350;&#21450;&#23884;&#20837;&#24335;(ARM)&#23398;&#20064;&#21644;&#30740;&#31350;&#30340;&#24320;&#25918;&#25991;&#26723;"><link rel="prev" href="ar01s14.html" title="14. &#20249;&#20276;&#31995;&#32479;"><link rel="next" href="ar01s16.html" title="16. &#20013;&#26029;&#22788;&#29702;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">15. IO&#35774;&#22791;&#31649;&#29702;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ar01s14.html">&#19978;&#19968;&#39029;</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="ar01s16.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="sect1" title="15. IO&#35774;&#22791;&#31649;&#29702;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="idp81158836"></a>15. IO&#35774;&#22791;&#31649;&#29702;</h2></div></div></div>
<div class="sect2" title="15.1. &#24635;&#32447;"><div class="titlepage"><div><div><h3 class="title"><a name="idp81159196"></a>15.1. &#24635;&#32447;</h3></div></div></div>
	<p>
&#20026;&#20102;&#30830;&#20445;&#35745;&#31639;&#26426;&#33021;&#22815;&#24037;&#20316;&#65292;&#24517;&#39035;&#25552;&#20379;&#25968;&#25454;&#36890;&#20449;&#32447;&#36335;&#65292;&#35753;&#20449;&#24687;&#22312;&#36830;&#25509;CPU&#65292;RAM&#21644;I/O&#35774;&#22791;&#20043;&#38388;&#27969;&#21160;&#12290;&#36825;&#20123;&#25968;&#25454;&#36890;&#36335;&#24635;&#31216;&#20026;&#24635;&#32447;&#12290;&#22312;x86&#19978;&#19968;&#31181;&#20856;&#22411;&#30340;&#31995;&#32479;&#24635;&#32447;&#26159;PCI(Peripheral Component Interconnect)&#24635;&#32447;&#12290;&#20854;&#20182;&#31867;&#22411;&#30340;&#24635;&#32447;&#26377;ISA&#65292;MCA&#65292;SCSI&#21644;USB&#31561;&#12290;
</p>	
<p>
&#19968;&#21488;&#35745;&#31639;&#26426;&#36890;&#24120;&#21253;&#21547;&#20960;&#31181;&#19981;&#21516;&#31867;&#22411;&#30340;&#24635;&#32447;&#65292;&#23427;&#20204;&#36890;&#24120;&#34987;&#31216;&#20316;"&#26725;"&#30340;&#30828;&#20214;&#35774;&#22791;&#36830;&#25509;&#22312;&#19968;&#36215;&#12290;&#20004;&#26465;&#39640;&#36895;&#24635;&#32447;&#29992;&#20110;&#22312;&#20869;&#23384;&#33455;&#29255;&#19978;&#26469;&#22238;&#20256;&#36865;&#25968;&#25454;&#65306;&#21069;&#31471;&#24635;&#32447;&#23558;CPU&#36830;&#25509;&#21040;RAM&#25511;&#21046;&#22120;&#19978;&#65292;&#32780;&#21518;&#31471;&#24635;&#32447;&#23558;CPU&#30452;&#25509;&#36830;&#25509;&#21040;&#22806;&#37096;&#30828;&#20214;&#30340;&#39640;&#36895;&#32531;&#23384;&#19978;&#12290;&#20027;&#26426;&#19978;&#30340;&#26725;&#23558;&#31995;&#32479;&#24635;&#32447;&#21644;&#21069;&#31471;&#24635;&#32447;&#36830;&#25509;&#22312;&#19968;&#36215;&#12290;
</p>	
<p>
&#20219;&#20309;I/O&#35774;&#22791;&#26377;&#19988;&#20165;&#33021;&#36830;&#25509;&#19968;&#26465;&#24635;&#32447;&#12290;CPU&#21644;I/O&#35774;&#22791;&#20043;&#38388;&#30340;&#25968;&#25454;&#36890;&#36335;&#36890;&#24120;&#31216;&#20026;I/O&#24635;&#32447;&#12290;&#27599;&#20010;&#36830;&#25509;&#21040;I/O&#24635;&#32447;&#19978;&#30340;&#35774;&#22791;&#37117;&#26377;&#33258;&#24049;&#30340;I/O&#22320;&#22336;&#38598;&#65292;&#36890;&#24120;&#31216;&#20026;I/O&#31471;&#21475;(I/O Port)&#12290;&#20110;&#27492;&#23545;&#24212;&#65292;&#36830;&#25509;&#22320;&#22336;&#30340;&#25968;&#25454;&#36890;&#36335;&#34987;&#31216;&#20026;&#22320;&#22336;&#24635;&#32447;&#65292;&#21478;&#22806;&#36824;&#26377;&#32447;&#36335;&#36739;&#23569;&#30340;&#25511;&#21046;&#24635;&#32447;&#12290;
</p>
<p>
&#38543;&#30528;&#36229;&#22823;&#35268;&#27169;&#38598;&#25104;&#30005;&#36335;&#30340;&#36805;&#36895;&#21457;&#23637;&#65292;&#22120;&#20214;&#29305;&#24449;&#23610;&#23544;&#36234;&#26469;&#36234;&#23567;&#65292;&#33455;&#29255;&#35268;&#27169;&#36234;&#26469;&#36234;&#22823;&#65292;&#21487;&#20197;&#22312;&#21333;&#33455;&#29255;&#19978;&#38598;&#25104;&#19978;&#30334;&#19975;&#21040;&#25968;&#20159;&#21482;&#26230;&#20307;&#31649;&#12290;&#22914;&#27492;&#23494;&#38598;&#30340;&#38598;&#25104;&#24230;&#20351;&#29616;&#22312;&#33021;&#22815;&#22312;&#19968;&#23567;&#22359;&#33455;&#29255;&#19978;&#25226;&#20197;&#21069;&#30001;CPU&#21644;&#33509;&#24178;I/O&#25509;&#21475;&#31561;&#25968;&#22359;&#33455;&#29255;&#23454;&#29616;&#30340;&#21151;&#33021;&#38598;&#25104;&#36215;&#26469;&#65292;&#30001;&#21333;&#29255;&#38598;&#25104;&#30005;&#36335;&#26500;&#25104;&#21151;&#33021;&#24378;&#22823;&#30340;&#12289;&#23436;&#25972;&#30340;&#31995;&#32479;&#65292;&#36825;&#23601;&#26159;&#36890;&#24120;&#25152;&#35828;&#30340;&#29255;&#19978;&#31995;&#32479;SoC(System on Chip)&#12290;&#30001;&#20110;&#21151;&#33021;&#23436;&#25972;&#65292;SoC&#36880;&#28176;&#25104;&#20026;&#23884;&#20837;&#24335;&#31995;&#32479;&#21457;&#23637;&#30340;&#20027;&#27969;&#12290; 
</p><p>
SoC&#30340;&#35774;&#35745;&#36807;&#31243;&#20013;&#65292;&#26368;&#20855;&#29305;&#33394;&#30340;&#26159;IP&#22797;&#29992;&#25216;&#26415;&#12290;&#21363;&#36873;&#25321;&#25152;&#38656;&#21151;&#33021;&#30340;IP&#26680;&#65292;&#38598;&#25104;&#21040;&#19968;&#20010;&#33455;&#29255;&#20013;&#12290;&#30001;&#20110;IP&#26680;&#30340;&#35774;&#35745;&#21315;&#24046;&#19975;&#21035;&#65292;IP&#26680;&#30340;&#36830;&#25509;&#23601;&#25104;&#20026;&#26500;&#36896;SoC&#30340;&#20851;&#38190;&#12290;&#29255;&#19978;&#24635;&#32447;0CB(On-Chip Bus)&#26159;&#23454;&#29616;SoC&#20013;IP&#26680;&#36830;&#25509;&#26368;&#24120;&#35265;&#30340;&#25216;&#26415;&#25163;&#27573;&#65292;&#23427;&#20197;&#24635;&#32447;&#26041;&#24335;&#23454;&#29616;IP&#26680;&#20043;&#38388;&#25968;&#25454;&#36890;&#20449;&#12290;	
</p>
<p>
&#19994;&#30028;&#26377;&#24456;&#22810;&#29255;&#19978;&#24635;&#32447;&#26631;&#20934;&#65292;&#20854;&#20013;&#30001;ARM&#20844;&#21496;&#25512;&#20986;&#30340;AMBA(Advanced Microcontroller Bus Architecture)&#29255;&#19978;&#24635;&#32447;&#21463;&#21040;&#20102;&#24191;&#22823;IP&#24320;&#21457;&#21830;&#21644;SoC&#31995;&#32479;&#38598;&#25104;&#32773;&#30340;&#38738;&#30544;&#65292;&#24050;&#25104;&#20026;&#19968;&#31181;&#27969;&#34892;&#30340;&#24037;&#19994;&#26631;&#20934;&#29255;&#19978;&#32467;&#26500;&#12290;AMBA&#35268;&#33539;&#20027;&#35201;&#21253;&#25324;&#20102;AHB(Advanced High performance Bus)&#31995;&#32479;&#24635;&#32447;(ASB&#31995;&#32479;&#24635;&#32447;&#19982;AHB&#31867;&#20284;&#65292;&#24615;&#33021;&#19981;&#22914;AHB)&#21644;APB(Advanced Peripheral Bus)&#22806;&#22260;&#24635;&#32447;&#12290;
</p><div class="figure"><a name="idp81162596"></a><p class="title"><b>&#22270; 77. ARM&#24635;&#32447;&#24067;&#23616;</b></p><div class="figure-contents"><div><img src="images/res_bus.gif" alt="ARM&#24635;&#32447;&#24067;&#23616;"></div></div></div><p><br class="figure-break"></p>
AMBA&#30340;&#21457;&#23637;&#21382;&#21490;&#22914;&#19979;&#34920;&#25152;&#31034;&#65306;
<div class="table"><a name="idp81163660"></a><p class="title"><b>&#34920; 24. AMBA&#21457;&#23637;&#21490;</b></p><div class="table-contents">
<table summary="AMBA&#21457;&#23637;&#21490;" border="1"><colgroup><col><col></colgroup><thead><tr><th>&#29256;&#26412;</th><th>&#25551;&#36848;</th></tr></thead><tbody><tr><td>AMBA 1.0</td><td>ASB &#21644; APB</td></tr><tr><td>AMBA 2.0</td><td>AHB, ASB &#21644; APB</td></tr><tr><td>AMBA 3.0</td><td>Advanced eXtensible Interface(AXI)</td></tr></tbody></table>
</div></div><br class="table-break">
AMBA 3.0 AXI&#24635;&#32447;&#19982;2003&#24180;&#21457;&#24067;&#65292;&#20860;&#23481;&#31526;&#21512;AMBA 2.0&#26631;&#20934;&#24635;&#32447;&#30340;&#35774;&#22791;&#12290;
<div class="sect3" title="15.1.1. AMBA AHB"><div class="titlepage"><div><div><h4 class="title"><a name="idp81166708"></a>15.1.1. AMBA AHB</h4></div></div></div>
AHB(Advanced High-performance Bus)&#20027;&#35201;&#29992;&#20110;&#39640;&#24615;&#33021;&#27169;&#22359;(&#22914;CPU&#12289;DMA&#21644;DSP&#31561;)&#20043;&#38388;&#30340;&#36830;&#25509;&#65292;&#20316;&#20026;SoC&#30340;&#29255;&#19978;&#31995;&#32479;&#24635;&#32447;&#65292;&#23427;&#21253;&#25324;&#20197;&#19979;&#19968;&#20123;&#29305;&#24615;&#65306;
<div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">&#19978;&#21319;&#27839;&#35302;&#21457;&#25805;&#20316;&#65307;</li><li class="listitem">&#38750;&#19977;&#24577;&#30340;&#23454;&#29616;&#26041;&#25903;&#25345;&#31361;&#21457;&#20256;&#36755;&#65307;</li><li class="listitem">&#27969;&#27700;&#32447;&#25805;&#20316;&#65307;</li><li class="listitem">&#21487;&#25903;&#25345;&#22810;&#20010;&#24635;&#32447;&#20027;&#35774;&#22791;&#65288;&#26368;&#22810;16&#20010;&#65289;&#65307;</li><li class="listitem">&#25903;&#25345;burst&#31361;&#21457;&#22810;&#25968;&#25454;&#20256;&#36755;&#65307;</li><li class="listitem">&#21487;&#37197;&#32622;&#24635;&#32447;&#24102;&#23485;&#65306;8&#12289;16&#12289;32&#12289;64&#12289;128bits&#65307;</li></ul></div>
&#20856;&#22411;&#30340;AMBA AHB&#31995;&#32479;&#35774;&#35745;&#21253;&#21547;&#20197;&#19979;&#30340;&#25104;&#20998;&#65306;
<div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">AHB &#20027;&#26426; &#24635;&#32447;&#20027;&#26426;&#33021;&#22815;&#36890;&#36807;&#25552;&#20379;&#22320;&#22336;&#21644;&#25511;&#21046;&#20449;&#24687;&#21457;&#36215;&#35835;&#20889;&#25805;&#20316;&#12290;&#20219;&#20309;&#26102;&#20505;&#21482;&#20801;&#35768;&#19968;&#20010;&#24635;&#32447;&#20027;&#26426;&#22788;&#20110;&#26377;&#25928;&#29366;&#24577;&#24182;&#33021;&#20351;&#29992;&#24635;&#32447;&#12290;</li><li class="listitem">AHB &#20174;&#26426; &#24635;&#32447;&#20174;&#26426;&#22312;&#32473;&#23450;&#30340;&#22320;&#22336;&#31354;&#38388;&#33539;&#22260;&#20869;&#21709;&#24212;&#35835;&#20889;&#25805;&#20316;&#12290;&#24635;&#32447;&#20174;&#26426;&#23558;&#25104;&#21151;&#12289;&#22833;&#36133;&#25110;&#32773;&#31561;&#24453;&#25968;&#25454;&#20256;&#36755;&#30340;&#20449;&#21495;&#36820;&#22238;&#32473;&#26377;&#25928;&#30340;&#20027;&#26426;&#12290;</li><li class="listitem">AHB &#20210;&#35009;&#22120; &#24635;&#32447;&#20210;&#35009;&#22120;&#30830;&#20445;&#27599;&#27425;&#21482;&#26377;&#19968;&#20010;&#24635;&#32447;&#20027;&#26426;&#34987;&#20801;&#35768;&#21457;&#36215;&#25968;&#25454;&#20256;&#36755;&#12290;&#21363;&#20351;&#20210;&#35009;&#21327;&#35758;&#24050;&#32463;&#22266;&#23450;&#65292;&#20219;&#20309;&#19968;&#31181;&#20210;&#35009;&#31639;&#27861;&#65292;&#27604;&#22914;&#26368;&#39640;&#20248;&#20808;&#32423;&#25110;&#32773;&#20844;&#24179;&#35775;&#38382;&#37117;&#33021;&#22815;&#26681;&#25454;&#24212;&#29992;&#35201;&#27714;&#32780;&#24471;&#21040;&#25191;&#34892;&#12290;AHB&#24517;&#39035;&#21482;&#21253;&#21547;&#19968;&#20010;&#20210;&#35009;&#22120;&#65292;&#23613;&#31649;&#22312;&#21333;&#24635;&#32447;&#20027;&#26426;&#31995;&#32479;&#20013;&#36825;&#26174;&#24471;&#24182;&#19981;&#37325;&#35201;&#12290;</li><li class="listitem">AHB &#35793;&#30721;&#22120; AHB &#35793;&#30721;&#22120;&#29992;&#26469;&#23545;&#27599;&#27425;&#20256;&#36755;&#36827;&#34892;&#22320;&#22336;&#35793;&#30721;&#24182;&#19988;&#22312;&#20256;&#36755;&#20013;&#21253;&#21547;&#19968;&#20010;&#20174;&#26426;&#36873;&#25321;&#20449;&#21495;&#12290;</li></ul></div>
AMBA AHB &#24635;&#32447;&#21327;&#35758;&#35774;&#35745;&#20351;&#29992;&#19968;&#20010;&#20013;&#22830;&#22810;&#36335;&#36873;&#25321;&#22120;&#20114;&#32852;&#26041;&#26696;&#12290;&#20351;&#29992;&#35813;&#26041;&#26696;&#25152;&#26377;&#24635;&#32447;&#20027;&#26426;&#35774;&#22791;&#36755;&#20986;&#22320;&#22336;&#21644;&#25511;&#21046;&#20449;&#21495;&#26469;&#25351;&#31034;&#23427;&#20204;&#24819;&#25191;&#34892;&#30340;&#20256;&#36755;&#21516;&#26102;&#20210;&#35009;&#22120;&#20915;&#23450;&#21738;&#19968;&#20010;&#20027;&#26426;&#33021;&#22815;&#23558;&#23427;&#30340;&#22320;&#22336;&#21644;&#25511;&#21046;&#20449;&#21495;&#36830;&#36890;&#21040;&#25152;&#26377;&#30340;&#20174;&#26426;&#12290;&#24403;&#28982;&#20063;&#38656;&#35201;&#19968;&#20010;&#35793;&#30721;&#22120;&#26469;&#25511;&#21046;&#35835;&#25968;&#25454;&#21644;&#21709;&#24212;&#22810;&#36335;&#20449;&#21495;&#36873;&#25321;&#22120;&#65292;&#22810;&#36335;&#20449;&#21495;&#36873;&#25321;&#22120;&#36873;&#20013;&#26469;&#33258;&#20256;&#36755;&#20013;&#25152;&#21253;&#21547;&#20174;&#26426;&#30340;&#36866;&#24403;&#20449;&#21495;&#12290;
<div class="figure"><a name="idp81171164"></a><p class="title"><b>&#22270; 78. &#22810;&#36335;&#36873;&#25321;&#22120;&#20114;&#32852;</b></p><div class="figure-contents"><div><img src="images/res_ahb.gif" alt="&#22810;&#36335;&#36873;&#25321;&#22120;&#20114;&#32852;"></div></div></div><br class="figure-break">
&#24403;&#20027;&#35774;&#22791;&#24819;&#35201;&#35835;&#21462;&#25110;&#32773;&#20889;&#20986;&#25968;&#25454;&#26102;&#65292;&#19968;&#20010;&#31934;&#31616;&#36807;&#30340;&#36807;&#31243;&#25551;&#36848;&#22914;&#19979;&#25152;&#31034;&#65306;
<div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">&#20027;&#26426;&#36890;&#36807;&#21457;&#20986;&#19968;&#20010;&#35831;&#27714;&#20449;&#21495;&#32473;&#20210;&#35009;&#22120;&#12290;</li><li class="listitem">&#20210;&#35009;&#22120;&#20210;&#35009;&#20027;&#26426;&#33021;&#22815;&#34987;&#25480;&#20104;&#20351;&#29992;&#24635;&#32447;&#26102;&#65292;&#25351;&#31034;&#20027;&#26426;&#33719;&#21462;&#24635;&#32447;&#24182;&#23558;&#22810;&#36335;&#36873;&#25321;&#22120;&#36873;&#36890;&#24403;&#21069;&#20027;&#26426;&#24635;&#32447;&#12290;</li><li class="listitem">&#34987;&#25480;&#26435;&#30340;&#24635;&#32447;&#20027;&#26426;&#36890;&#36807;&#39537;&#21160;&#22320;&#22336;&#21644;&#25511;&#21046;&#20449;&#21495;&#26469;&#21457;&#36215;&#19968;&#27425;AMBA AHB&#20256;&#36755;&#12290;</li><li class="listitem">&#35793;&#30721;&#22120;&#22320;&#22336;&#24635;&#32447;&#19978;&#30340;&#22320;&#22336;&#20135;&#29983;&#20174;&#26426;&#36873;&#25321;&#20449;&#21495;&#12290;&#27492;&#26102;&#24314;&#31435;&#20102;&#19968;&#20010;&#20027;&#26426;&#21040;&#19968;&#20010;&#20174;&#26426;&#20043;&#38388;&#30340;&#25569;&#25163;&#12290;</li><li class="listitem">&#35835;&#25110;&#32773;&#20889;&#25968;&#25454;&#12290;</li><li class="listitem">&#20027;&#20174;&#35774;&#22791;&#37322;&#25918;&#24635;&#32447;&#12290;</li></ul></div>
</div>
<div class="sect3" title="15.1.2. AMBA APB"><div class="titlepage"><div><div><h4 class="title"><a name="idp81173844"></a>15.1.2. AMBA APB</h4></div></div></div>
<p>
APB(Advanced Peripheral Bus)&#20027;&#35201;&#29992;&#20110;&#20302;&#24102;&#23485;&#30340;&#21608;&#36793;&#22806;&#35774;&#20043;&#38388;&#30340;&#36830;&#25509;&#65292;&#20363;&#22914;UART&#12289;1284&#31561;&#65292;&#23427;&#30340;&#24635;&#32447;&#26550;&#26500;&#19981;&#20687;AHB&#25903;&#25345;&#22810;&#20010;&#20027;&#27169;&#22359;&#65292;&#22312;APB&#37324;&#38754;&#21807;&#19968;&#30340;&#20027;&#27169;&#22359;&#23601;&#26159;APB &#26725;&#12290;&#20854;&#29305;&#24615;&#21253;&#25324;&#65306;&#20004;&#20010;&#26102;&#38047;&#21608;&#26399;&#20256;&#36755;&#65307;&#26080;&#38656;&#31561;&#24453;&#21608;&#26399;&#21644;&#22238;&#24212;&#20449;&#21495;&#65307;&#25511;&#21046;&#36923;&#36753;&#31616;&#21333;&#65292;&#21482;&#26377;&#22235;&#20010;&#25511;&#21046;&#20449;&#21495;&#12290;</p>
<p>APB &#34920;&#29616;&#20026;&#19968;&#20010;&#23616;&#37096;&#20108;&#32423;&#24635;&#32447;&#65292;&#23553;&#35013;&#20026;AHB &#25110;&#32773;ASB &#30340;&#19968;&#20010;&#22806;&#35774;&#65306;APB&#26725;&#12290;APB &#22312;AHB &#21644;ASB&#20449;&#21495;&#30340;&#22522;&#30784;&#19978;&#30452;&#25509;&#20026;&#31995;&#32479;&#24635;&#32447;&#25552;&#20379;&#20102;&#20302;&#21151;&#32791;&#30340;&#24310;&#20280;&#12290;
APB &#35268;&#23450;&#25152;&#26377;&#20449;&#21495;&#30340;&#20256;&#36755;&#21482;&#21644;&#26102;&#38047;&#30340;&#19978;&#21319;&#27839;&#30456;&#20851;&#12290;&#20855;&#26377;&#20197;&#19979;&#29305;&#28857;&#65306;
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">APB &#26725;&#23558;AHB &#25110;&#32773;ASB &#20256;&#36755;&#36716;&#21464;&#25104;&#36866;&#21512;&#20110;APB &#20174;&#35774;&#22791;&#30340;&#24418;&#24335;&#12290;</li><li class="listitem">APB &#26725;&#25552;&#20379;&#25152;&#26377;&#22320;&#22336;&#12289;&#25968;&#25454;&#21644;&#25511;&#21046;&#20449;&#21495;&#30340;&#38145;&#23384;</li><li class="listitem">&#21516;&#26102;&#25552;&#20379;&#19968;&#20010;&#20108;&#32423;&#35793;&#30721;&#20197;&#20135;&#29983;APB &#22806;&#35774;&#30340;&#20174;&#26426;&#36873;&#25321;&#20449;&#21495;&#12290;</li><li class="listitem">APB&#24635;&#32447;&#19978;&#30340;&#25152;&#26377;&#20854;&#20182;&#27169;&#22359;&#37117;&#26159;APB&#20174;&#35774;&#22791;</li></ul></div><p>
</p>
<div class="figure"><a name="idp81176588"></a><p class="title"><b>&#22270; 79. APB&#26725;&#25509;&#21475;&#22270;</b></p><div class="figure-contents"><div><img src="images/res_apb.gif" alt="APB&#26725;&#25509;&#21475;&#22270;"></div></div></div><br class="figure-break">
</div>
<div class="sect3" title="15.1.3. AMBA AXI"><div class="titlepage"><div><div><h4 class="title"><a name="idp81177244"></a>15.1.3. AMBA AXI</h4></div></div></div>
<p>&#38543;&#30528;&#36229;&#22823;&#35268;&#27169;Soc&#30340;&#20852;&#36215;&#65292;&#23884;&#20837;&#24335;&#31995;&#32479;&#30340;&#24615;&#33021;&#38656;&#27714;&#36234;&#26469;&#36234;&#39640;&#65292;&#23548;&#33268;&#23545;&#29255;&#19978;&#24635;&#32447;&#30340;&#24102;&#23485;&#35201;&#27714;&#20063;&#36234;&#26469;&#36234;&#33499;&#21051;&#12290;&#34429;&#28982;AHB&#24635;&#32447;&#21327;&#35758;&#22312;&#29702;&#35770;&#19978;&#21487;&#20197;&#35753;&#29992;&#25143;&#19981;&#26029;&#22320;&#22686;&#21152;&#24635;&#32447;&#20301;&#23485;&#20197;&#36798;&#21040;&#26356;&#39640;&#24102;&#23485;&#65292;&#20294;&#22312;&#33410;&#30465;&#21151;&#32791;&#30340;&#21069;&#25552;&#19979;&#65292;&#29992;&#25143;&#24076;&#26395;&#36890;&#36807;&#26497;&#31364;&#30340;&#24635;&#32447;&#23485;&#24230;&#12289;&#26497;&#20302;&#30340;&#24635;&#32447;&#39057;&#29575;&#26469;&#23454;&#29616;&#24456;&#39640;&#30340;&#25968;&#25454;&#21534;&#21520;&#37327;&#65292;&#20063;&#23601;&#26159;&#23545;&#21327;&#35758;&#20256;&#36755;&#25928;&#29575;&#30340;&#35201;&#27714;&#36798;&#21040;&#26497;&#33268;&#12290;AMBA 3.0 AXI(Advanced eXtensible Interface)&#21327;&#35758;&#27491;&#26159;&#22312;&#36825;&#31181;&#32972;&#26223;&#19979;&#24212;&#36816;&#32780;&#29983;&#12290;</p>
AXI &#21327;&#35758;&#30340;&#20027;&#35201;&#29305;&#28857;&#21253;&#25324;:
<div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">&#36890;&#36947;&#20307;&#31995;&#32467;&#26500;:5&#20010;&#29420;&#31435;&#30340;&#36890;&#36947;&#65292;&#20998;&#21035;&#26159;&#35835;&#22320;&#22336;&#12289;&#20889;&#22320;&#22336;&#12289;&#35835;&#25968;&#25454;&#12289;&#20889;&#25968;&#25454;&#36890;&#36947;&#21644;&#20889;&#21709;&#24212;&#36890;&#36947;&#12290;&#22320;&#22336;&#21644;
&#25968;&#25454; &#36890;&#36947;&#20998;&#24320;&#65292;&#33021;&#23545;&#27599;&#19968;&#20010;&#36890;&#36947;&#36827;&#34892;&#21333;&#29420;&#20248;&#21270;&#65292;&#21487;&#20197;&#26681;&#25454;&#38656;&#35201;&#25511;&#21046;&#26102;&#24207;&#36890;&#36947;&#65292;&#23558;&#26102;&#38047;&#39057;&#29575;&#25552;&#21319;&#21040;&#26368;&#39640;&#65292;
&#24182;&#23558; &#24310;&#26102;&#38477;&#21040;&#26368;&#20302;&#12290;&#20449;&#24687;&#27969;&#21482;&#20197;&#21333;&#26041;&#21521;&#20256;&#36755;&#65292;&#22240;&#32780;&#31616;&#21270;&#20102;&#26102;&#38047;&#22495;&#38388;&#30340;&#26725;&#25509;;</li><li class="listitem">&#25903;&#25345;&#22810;&#39033;&#25968;&#25454;&#20132;&#25442;:&#36890;&#36807;&#24182;&#34892;&#25191;&#34892;&#31361;&#21457;&#25805;&#20316;&#65292;&#26497;&#22823;&#22320;&#25552;&#39640;&#20102;&#25968;&#25454;&#21534;&#21520;&#33021;&#21147;&#65292;&#22240;&#32780;&#21487;&#20197;&#22312;
&#26356;&#30701; &#26102;&#38388;&#20869;&#23436;&#25104;&#25152;&#38656;&#20219;&#21153;&#65292;&#19981;&#20294;&#21487;&#21480;&#36275;&#25152;&#38656;&#30340;&#39640;&#24615;&#33021;&#35201;&#27714;&#65292;&#36824;&#33021;&#20943;&#23569;&#21151;&#32791;;</li><li class="listitem">VALID&#21644;READY&#30340;&#21452;&#21521;&#25569;&#25163;&#26426;&#21046;:&#27599;&#20010;&#36890;&#36947;&#37117;&#26377;&#19968;&#22871;&#36825;&#31181;&#25569;&#25163;&#26426;&#21046;&#12290;&#22312;&#28304;&#31471;&#65292;&#24403;&#25968;&#25454;&#12289;&#25511;&#21046;&#20449;&#24687;&#22312;&#36890;&#36947;
&#19978;&#26377; &#25928;&#26102;&#65292;&#32622;VALID&#20449;&#21495;&#26377;&#25928;;&#22312;&#32456;&#31471;&#65292;&#24403;&#25509;&#25910;&#21040;&#25968;&#25454;&#26102;&#65292;&#32622;READY&#20449;&#21495;&#26377;&#25928;&#12290;&#35835;&#12289;&#20889;&#25968;&#25454;&#36890;&#36947;&#22343;&#26377;LAST
&#20449; &#21495;&#65292;&#24403;&#20256;&#36755;&#26368;&#21518;&#19968;&#20010;&#25968;&#25454;&#26102;&#32622;&#27492;&#20449;&#21495;&#26377;&#25928;;</li><li class="listitem">&#22686;&#24378;&#30340;&#28789;&#27963;&#24615;:AXI&#25216;&#26415;&#25317;&#26377;&#23545;&#31216;&#30340;&#20027;&#20174;&#25509;&#21475;&#65292;&#26080;&#35770;&#22312;&#28857;&#23545;&#28857;&#25110;&#22312;&#22810;&#23618;&#31995;&#32479;&#20013;&#65292;&#37117;&#33021;&#21313;&#20998;&#26041;&#20415;&#22320;&#20351;&#29992;
AX I&#25216;&#26415;;</li><li class="listitem">&#20302;&#21151;&#32791;&#33410;&#30005;&#27169;&#24335;:AXI&#21327;&#35758;&#23450;&#20041;&#20102;&#22312;&#36827;&#20986;&#20302;&#21151;&#32791;&#33410;&#30005;&#27169;&#24335;&#21069;&#21518;&#30340;&#25569;&#25163;&#21327;&#35758;&#12290;&#35268;&#23450;&#22914;&#20309;&#36890;&#30693;&#36827;&#20837;&#20302;&#21151;&#32791;&#27169;
&#24335;&#65292; &#20309;&#26102;&#20851;&#26029;&#26102;&#38047;&#65292;&#20309;&#26102;&#24320;&#21551;&#26102;&#38047;&#65292;&#22914;&#20309;&#36864;&#20986;&#20302;&#21151;&#32791;&#27169;&#24335;&#12290;&#36825;&#20351;&#24471;&#25152;&#26377;IP&#22312;&#36827;&#34892;&#21151;&#32791;&#25511;&#21046;&#30340;&#35774;&#35745;&#26102;&#65292;
&#26377; &#25454;&#21487;&#20381;&#65292;&#23481;&#26131;&#38598;&#25104;&#22312;&#32479;&#19968;&#30340;&#31995;&#32479;&#20013;&#12290;</li></ul></div>
AXI&#21327;&#35758;&#26159;&#19968;&#31181;&#22810;&#36890;&#36947;&#20256;&#36755;&#24635;&#32447;&#65292;&#20854;&#26368;&#22823;&#29305;&#33394;&#26159;&#23558;&#35835;/&#20889;&#22320;&#22336;&#12289;&#35835;&#25968;&#25454;&#12289;&#20889;&#25968;&#25454;&#12289;
&#20889;&#21709;&#24212;&#20449;&#21495;&#22312;&#19981;&#21516;&#30340;&#36890;&#36947;&#20013;&#21457;&#36865;&#65292;&#25903;&#25345;&#20081;&#24207;&#20256;&#36755;&#25968;&#25454;&#65292;&#29992;&#21151;&#26469;&#26631;&#35782;&#21508;&#20010;&#35775;&#38382;&#30340;&#24402;&#23646;&#12290;&#20027;&#35774;&#22791;&#22312;&#27809;&#26377;&#24471;&#21040;
&#36820;&#22238;&#25968;&#25454;&#30340;&#24773;&#20917;&#19979;&#21487;&#21457;&#20986;&#22810;&#20010;&#35835;&#20889;&#25805;&#20316;&#12290;&#30456;&#36739;&#20110;AHB&#24635;&#32447;&#26377;&#22914;&#19979;&#21306;&#21035;&#65306;
<div class="table"><a name="idp81181268"></a><p class="title"><b>&#34920; 25. AHB&#21644;AXI&#27604;&#36739;</b></p><div class="table-contents">
<table summary="AHB&#21644;AXI&#27604;&#36739;" border="1"><colgroup><col><col></colgroup><thead><tr><th>AMBA 2.0 AHB&#21327;&#35758;</th><th>AMBA 3.0 AXI&#21327;&#35758;</th></tr></thead><tbody><tr><td>&#22266;&#23450;&#30340;&#22320;&#22336;&#25968;&#25454;&#20256;&#36755;&#36890;&#36947;</td><td>5&#20010;&#29420;&#31435;&#30340;&#35835;/&#20889;&#22320;&#22336;&#12289;&#25968;&#25454;&#12289;&#21709;&#24212;&#36890;&#36947;</td></tr><tr><td>&#21452;&#21521;&#36830;&#25509;&#26102;&#24207;&#20851;&#31995;&#22797;&#26434;</td><td>&#38500;&#25569;&#25163;&#20449;&#21495;&#21453;&#21521;&#22806;&#27599;&#19968;&#36890;&#36947;&#22343;&#21333;&#21521;</td></tr><tr><td>&#26102;&#24207;&#38548;&#31163;&#22256;&#38590;&#24207;</td><td>&#23492;&#23384;&#22120;&#38548;&#31163;&#26102;</td></tr><tr><td>&#24037;&#20316;&#39057;&#29575;&#21463;&#38480;</td><td>&#27969;&#27700;&#32447;&#26102;&#38047;</td></tr><tr><td>&#20302;&#25928;&#29575;&#30340;&#24322;&#27493;&#26725;&#25509;</td><td>&#39640;&#24615;&#33021;&#24322;&#27493;&#26725;&#25509;</td></tr><tr><td>&#27599;&#20010;&#25968;&#25454;&#23545;&#24212;&#21333;&#29420;&#22320;&#22336;</td><td>&#19968;&#27425;&#31361;&#21457;&#21482;&#38656;&#35201;&#39318;&#22320;&#22336;</td></tr><tr><td>&#27599;&#19968;&#26102;&#21051;&#25903;&#25345;&#21333;&#19968;&#20256;&#36755;</td><td>&#21516;&#26102;&#25903;&#25345;&#22810;&#37325;&#20256;&#36755;&#65292;&#35835;/&#20889;&#24182;&#21457;&#20256;&#36755;</td></tr><tr><td>&#65279;&#22320;&#22336;&#25968;&#25454;&#19968;&#19968;&#23545;&#24212;</td><td>&#20081;&#24207;&#25968;&#25454;&#20256;&#36755;</td></tr><tr><td>&#19981;&#33021;&#22825;&#28982;&#25903;&#25345;ARM v6&#20307;&#31995;</td><td>&#25903;&#25345;&#29420;&#21344;(exclusive)&#35775;A&#26041;&#24335;</td></tr><tr><td>&#26080;&#23433;&#20840;&#24615;&#25903;&#25345;</td><td>&#23545;&#38750;&#27861;&#20256;&#36755;&#30340;&#23433;&#20840;&#24615;&#25903;&#25345;</td></tr></tbody></table>
</div></div><br class="table-break">
&#24403;&#21069;&#22810;&#25968;IP&#24191;&#27867;&#37319;&#29992;&#30340;&#29255;&#19978;&#24635;&#32447;&#26159;AMBA2.0 &#21327;&#35758;&#12290;&#22914;&#20309;&#21033;&#29992;IP&#22797;&#29992;&#25216;&#26415;&#65292;&#20351;&#29992;&#36825;&#20123;&#29616;&#23384;IP&#26500;&#24314;&#22522;&#20110;AXI&#21327;&#35758;&#30340;Soc&#31995;&#32479;&#21602;?AMBA3 .0A XI &#21327;&#35758;&#20854;&#20013;&#30340;&#19968;&#20010;&#20248;&#28857;&#26159;&#21521;&#21518;&#20860;&#23481;AMBA2.0&#65292;&#25903;&#25345;&#29616;&#26377;&#20351;&#29992;AMBA2.0 &#21327;&#35758;&#30340;&#23376;&#31995;&#32479;&#12290;&#36825;&#19968;&#29305;&#28857;&#35753;IP&#22797;&#29992;&#25104;&#20026;&#21487;&#33021;&#12290;
</div>
<div class="sect3" title="15.1.4. S3C6410&#24635;&#32447;"><div class="titlepage"><div><div><h4 class="title"><a name="idp81187988"></a>15.1.4. S3C6410&#24635;&#32447;</h4></div></div></div>
<p>S3C6410 &#26159;&#19968;&#20010;16/32 &#20301;RISC &#24494;&#22788;&#29702;&#22120;&#65292;&#37319;&#29992;&#20102;64/32 &#20301;&#20869;&#37096;&#24635;&#32447;&#26550;&#26500;&#12290;&#35813;64/32 &#20301;&#20869;&#37096;&#24635;&#32447;&#32467;&#26500;&#30001;AXI&#12289;AHB &#21644;APB &#24635;&#32447;&#32452;&#25104;&#12290;&#23427;&#36824;&#21253;&#25324;&#35768;&#22810;&#24378;&#22823;&#30340;&#30828;&#20214;&#21152;&#36895;&#22120;&#65292;&#20687;&#35270;&#39057;&#22788;&#29702;&#65292;&#38899;&#39057;&#22788;&#29702;&#65292;&#20108;&#32500;&#22270;&#24418;&#65292;&#26174;&#31034;&#25805;&#20316;&#21644;&#32553;&#25918;&#12290;&#19968;&#20010;&#38598;&#25104;&#30340;&#22810;&#26684;&#24335;&#32534;&#35299;&#30721;&#22120;&#65288; MFC &#65289;&#25903;
&#25345;MPEG4/H.263/H.264 &#32534;&#30721;&#12289;&#35793;&#30721;&#20197;&#21450;VC1 &#30340;&#35299;&#30721;&#12290;&#36825;&#20010;H/W &#32534;&#30721;&#22120;/&#35299;&#30721;&#22120;&#25903;&#25345;&#23454;&#26102;&#35270;&#39057;&#20250;&#35758;&#21644;NTSC&#12289;PAL &#27169;&#24335;&#30340;TV &#36755;&#20986;&#12290;</p>
<p>S3C6410 &#26377;&#19968;&#20010;&#20248;&#21270;&#30340;&#25509;&#21475;&#36830;&#32447;&#21040;&#22806;&#37096;&#23384;&#20648;&#22120;&#12290;&#23384;&#20648;&#22120;&#31995;&#32479;&#20855;&#26377;&#21452;&#37325;&#22806;&#37096;&#23384;&#20648;&#22120;&#31471;&#21475;&#12289; DRAM &#21644;FLASH/ROM/ DRAM &#31471;&#21475;&#12290; DRAM &#30340;&#31471;&#21475;&#21487;&#20197;&#37197;&#32622;&#20026;&#25903;&#25345;&#31227;&#21160;DDR&#65292;DDR&#65292;&#31227;&#21160;SDRAM &#21644;SDRAM &#12290;FLASH/ROM/DRAM&#31471;&#21475;&#25903;&#25345;NOR-FLASH&#65292;NAND-FLASH&#65292;ONENAND&#65292;CF&#65292;ROM &#31867;&#22411;&#22806;&#37096;&#23384;&#20648;&#22120;&#21644;&#31227;&#21160;DDR&#65292;DDR&#65292;&#31227;&#21160;SDRAM &#21644;SDRAM &#12290;</p>
<p>&#20026;&#20943;&#23569;&#31995;&#32479;&#24635;&#25104;&#26412;&#21644;&#25552;&#39640;&#25972;&#20307;&#21151;&#33021;&#65292;S3C6410 &#21253;&#25324;&#35768;&#22810;&#30828;&#20214;&#22806;&#35774;&#65292;&#22914;&#19968;&#20010;&#30456;&#26426;&#25509;&#21475;&#65292;TFT 24 &#20301;&#30495;&#24425;&#33394;&#28082;&#26230;&#26174;&#31034;&#25511;&#21046;&#22120;&#65292;&#31995;&#32479;&#31649;&#29702;&#22120;&#65288;&#30005;&#28304;&#31649;&#29702;&#31561;&#65289;&#65292;4 &#36890;&#36947;UART&#65292;32 &#36890;&#36947;DMA&#65292;4 &#36890;&#36947;&#23450;&#26102;&#22120;&#65292;&#36890;&#29992;&#30340;I/O &#31471;&#21475;&#65292;
IIS &#24635;&#32447;&#25509;&#21475;&#65292;IIC &#24635;&#32447;&#25509;&#21475;&#65292;USB &#20027;&#35774;&#22791;&#65292;&#22312;&#39640;&#36895;&#65288;480 MB/S&#65289;&#26102;USB OTG &#25805;&#20316;&#65292;SD &#20027;&#35774;&#22791;&#21644;&#39640;&#36895;&#22810;&#23186;&#20307;&#21345;&#25509;&#21475;&#12289;&#29992;&#20110;&#20135;&#29983;&#26102;&#38047;&#30340;PLL&#12290;</p>
<div class="figure"><a name="idp81190100"></a><p class="title"><b>&#22270; 80. S3C6410&#21151;&#33021;&#26694;&#22270;</b></p><div class="figure-contents"><div><img src="images/res_block.gif" alt="S3C6410&#21151;&#33021;&#26694;&#22270;"></div></div></div><br class="figure-break">
ARM1176 &#22788;&#29702;&#22120;&#26159;&#36890;&#36807;64 &#20301;AXI &#24635;&#32447;&#36830;&#25509;&#21040;&#20960;&#20010;&#20869;&#23384;&#25511;&#21046;&#22120;&#19978;&#30340;&#12290;&#36825;&#26679;&#20570;&#26159;&#20026;&#20102;&#28385;&#36275;&#24102;&#23485;&#38656;&#27714;&#12290;&#32780;&#22806;&#35774;&#25346;&#36733;&#21040;AXI/APB&#26725;&#65292;&#24182;&#36890;&#36807;AXI32&#20301;&#25509;&#21475;&#36830;&#20837;CPU&#12290;&#32780;DMA&#25511;&#21046;&#22120;&#21516;&#26102;&#25509;&#20837;&#20102;AXI64&#21644;AXI32&#24635;&#32447;&#65292;&#26174;&#28982;&#23427;&#21487;&#20197;&#22312;CPU&#22788;&#29702;&#20854;&#20182;&#24037;&#20316;&#26102;&#65292;&#33719;&#21462;&#24635;&#32447;&#65292;&#24182;&#22312;&#39640;&#36895;&#35774;&#22791;&#21644;&#20302;&#36895;&#35774;&#22791;&#20043;&#38388;&#23436;&#25104;&#25968;&#25454;&#30340;&#25644;&#31227;&#12290;
</div>
<div class="sect3" title="15.1.5. IP&#38388;&#36890;&#20449;"><div class="titlepage"><div><div><h4 class="title"><a name="idp81191124"></a>15.1.5. IP&#38388;&#36890;&#20449;</h4></div></div></div>
&#36890;&#20449;&#20027;&#35201;&#28041;&#21450;&#21040;CPU&#21644;IP&#65292;IP&#21644;IP&#20043;&#38388;&#30340;&#36890;&#20449;&#12290;ARM&#20013;&#20026;&#20102;&#25903;&#25345;&#36825;&#31867;&#36890;&#20449;&#65292;&#36890;&#36807;&#23545;&#20174;&#35774;&#22791;&#32479;&#19968;&#32534;&#22336;&#65292;&#25152;&#26377;&#20174;&#35774;&#22791;&#37117;&#34987;&#32534;&#25490;&#21040;0-4G&#22320;&#22336;&#31354;&#38388;&#20869;&#65306;&#35774;&#22791;&#35775;&#38382;&#21306;&#12290;
<div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">&#27599;&#19968;&#20010;&#20174;&#35774;&#22791;&#37117;&#21344;&#29992;&#31995;&#32479;&#20013;&#30340;&#19968;&#27573;&#22320;&#22336;&#31354;&#38388;&#12290;</li><li class="listitem">&#30001;&#20110;&#27599;&#20010;&#35774;&#22791;&#30340;&#22320;&#22336;&#31354;&#38388;&#37117;&#19981;&#21516;&#65292;&#25152;&#20197;&#20174;&#35774;&#22791;&#37117;&#26159;&#21487;&#23547;&#22336;&#30340;&#12290;</li><li class="listitem">&#23492;&#23384;&#22120;/&#23384;&#20648;&#22120;&#37117;&#26159;&#20869;&#23384;&#26144;&#23556;&#26041;&#24335;&#35775;&#38382;&#12290;&#22914;&#26524;&#22312;MMU&#21551;&#29992;&#30340;&#24773;&#20917;&#19979;&#65292;&#38656;&#35201;&#36827;&#34892;&#29289;&#29702;&#22320;&#22336;&#21040;&#34394;&#25311;&#22320;&#22336;&#30340;&#26144;&#23556;&#12290;</li><li class="listitem">CPU/IP&#35835;&#20889;&#20854;&#20182;IP&#30340;&#25968;&#25454;&#31867;&#20284;&#20110;&#35835;&#20889;&#23384;&#20648;&#22120;&#12290;</li></ul></div>
<p>
&#20027;&#35774;&#22791;&#34987;&#20210;&#35009;&#25480;&#26435;(Arbiter Grant)&#21518;&#65292;&#21487;&#20197;&#35775;&#38382;&#24635;&#32447;&#19978;&#30340;&#25152;&#26377;&#20174;&#35774;&#22791;&#12290;&#20856;&#22411;&#30340;IP&#20043;&#38388;&#30340;&#36890;&#20449;&#22914;DMA&#20256;&#36755;&#12290;CPU&#24635;&#26159;&#20316;&#20026;&#20027;&#35774;&#22791;&#23384;&#22312;&#65292;&#32780;&#20854;&#20182;IP&#30456;&#23545;&#20110;CPU&#26469;&#35828;&#24635;&#26159;&#20316;&#20026;&#20174;&#35774;&#22791;&#23384;&#22312;&#12290;IP&#21487;&#20197;&#21457;&#20986;&#19968;&#20010;&#20013;&#26029;&#35831;&#27714;&#65292;CPU&#36827;&#20837;&#20013;&#26029;&#27169;&#24335;&#65292;&#30001;ISR&#26469;&#22788;&#29702;&#20013;&#26029;&#65306;&#36890;&#24120;&#26159;&#23545;&#35774;&#22791;&#22320;&#22336;&#30340;&#35835;&#20889;&#12290;&#21482;&#26377;&#22312;CPU&#19981;&#21344;&#29992;&#24635;&#32447;&#26102;&#65292;&#20854;&#20182;IP&#25165;&#26377;&#21487;&#33021;&#25104;&#20026;&#20027;&#35774;&#22791;&#12290;
</p><div class="figure"><a name="idp81193588"></a><p class="title"><b>&#22270; 81. CPU&#21644;IP&#36890;&#20449;</b></p><div class="figure-contents"><div><img src="images/cpu_ip.gif" alt="CPU&#21644;IP&#36890;&#20449;"></div></div></div><p><br class="figure-break">
&#19968;&#20010;&#23436;&#25972;&#30340;DMA&#20256;&#36755;&#65292;&#21516;&#26102;&#38656;&#35201;CPU&#21644;IP&#65292;IP&#21644;IP&#20043;&#38388;&#30340;&#36890;&#20449;&#65306;
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">CPU&#36890;&#36807;DMA&#30340;&#29366;&#24577;&#23492;&#23384;&#22120;&#65292;&#26816;&#26597;DMA&#26159;&#21542;&#21487;&#29992;&#12290;</li><li class="listitem">CPU&#36890;&#36807;DMA&#30340;&#25511;&#21046;&#23492;&#23384;&#22120;&#35774;&#32622;&#25968;&#25454;&#28304;&#22320;&#22336;&#65288;source address&#65289;&#12289;&#30446;&#30340;&#22320;&#22336;&#65288;destination address&#65289;&#21644;&#25968;&#25454;&#38271;&#24230;&#65288;size&#65289;&#12290;</li><li class="listitem">&#36890;&#36807;&#25511;&#21046;&#23492;&#23384;&#22120;&#21551;&#21160;DMA&#12290;</li><li class="listitem">DMA&#25226;&#25968;&#25454;&#20174;&#25968;&#25454;&#28304;&#22320;&#22336;&#25152;&#23646;&#30340;&#35774;&#22791;&#25644;&#31227;&#21040;&#25968;&#25454;&#30446;&#30340;&#22320;&#22336;&#25152;&#23646;&#30340;&#35774;&#22791;&#12290;</li><li class="listitem">DMA&#20256;&#36755;&#23436;&#27605;&#25110;&#32773;&#20986;&#38169;&#26102;&#35774;&#32622;&#29366;&#24577;&#23492;&#23384;&#22120;&#65292;&#24182;&#21521;CPU&#21457;&#20986;&#20013;&#26029;&#35831;&#27714;&#12290;</li><li class="listitem">CPU&#26816;&#26597;DMA&#30340;&#29366;&#24577;&#23492;&#23384;&#22120;&#65292;&#30830;&#23450;&#25968;&#25454;&#26159;&#21542;&#20256;&#36755;&#23436;&#27605;&#12290;</li></ul></div><p>
</p>
<p>
&#20854;&#23454;CPU&#23545;&#22806;&#35774;&#29289;&#29702;&#22320;&#22336;&#30340;&#35775;&#38382;&#26377;&#20004;&#31181;&#26041;&#24335;&#65306;
</p>
<p><span class="emphasis"><em>&#20869;&#23384;&#26144;&#23556;:</em></span>
&#26377;&#20123;&#20307;&#31995;&#32467;&#26500;&#30340;CPU&#65288;&#22914;ARM&#65292;PowerPC&#31561;&#65289;&#36890;&#24120;&#21482;&#23454;&#29616;&#19968;&#20010;&#29289;&#29702;&#22320;&#22336;&#31354;&#38388;&#65288;RAM&#65289;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#22806;&#35774;I/O&#31471;&#21475;&#30340;&#29289;&#29702;&#22320;&#22336;&#23601;&#34987;&#26144;&#23556;&#21040;CPU&#30340;&#21333;&#19968;&#29289;&#29702;&#22320;&#22336;&#31354;&#38388;&#20013;&#65292;&#32780;&#25104;&#20026;&#23384;&#20648;&#31354;&#38388;&#30340;&#19968;&#37096;&#20998;&#12290;&#27492;&#26102;&#65292;CPU&#21487;&#20197;&#35937;&#35775;&#38382;&#19968;&#20010;&#20869;&#23384;&#21333;&#20803;&#37027;&#26679;&#35775;&#38382;&#22806;&#35774;I/O&#31471;&#21475;&#65292;&#32780;&#19981;&#38656;&#35201;&#35774;&#31435;&#19987;&#38376;&#30340;&#22806;&#35774;I/O&#25351;&#20196;&#12290;&#36825;&#23601;&#26159;&#25152;&#35859;&#30340;&#8220;&#23384;&#20648;&#31354;&#38388;&#26144;&#23556;&#26041;&#24335;&#8221;&#65288;Memory Mapped&#65289;&#12290;&#31616;&#32780;&#35328;&#20043;&#65292;&#23601;&#26159;&#20869;&#23384;&#65288;&#19968;&#33324;&#26159;SDRAM&#65289;&#19982;&#22806;&#35774;&#23492;&#23384;&#22120;&#32479;&#19968;&#32534;&#22336;&#12290;
</p>
<p><span class="emphasis"><em>&#31471;&#21475;&#26144;&#23556;:</em></span>
&#19968;&#20123;&#20307;&#31995;&#32467;&#26500;&#30340;CPU&#65288;&#20856;&#22411;&#22320;&#22914;x86&#65289;&#21017;&#20026;&#22806;&#35774;&#19987;&#38376;&#23454;&#29616;&#20102;&#19968;&#20010;&#21333;&#29420;&#22320;&#22320;&#22336;&#31354;&#38388;&#65292;&#31216;&#20026;&#8220;I/O&#22320;&#22336;&#31354;&#38388;&#8221;&#25110;&#32773;&#8220;I/O&#31471;&#21475;&#31354;&#38388;&#8221;&#12290;&#36825;&#26159;&#19968;&#20010;&#19982;CPU&#22320;RAM&#29289;&#29702;&#22320;&#22336;&#31354;&#38388;&#19981;&#21516;&#30340;&#22320;&#22336;&#31354;&#38388;&#65292;&#25152;&#26377;&#22806;&#35774;&#30340;I/O&#31471;&#21475;&#22343;&#22312;&#36825;&#19968;&#31354;&#38388;&#20013;&#36827;&#34892;&#32534;&#22336;&#12290;CPU&#36890;&#36807;&#35774;&#31435;&#19987;&#38376;&#30340;I/O&#25351;&#20196;&#65288;&#22914;X86&#30340;IN&#21644;OUT&#25351;&#20196;&#65289;&#26469;&#35775;&#38382;&#36825;&#19968;&#31354;&#38388;&#20013;&#30340;&#22320;&#22336;&#21333;&#20803;&#65288;&#20063;&#21363;I/O&#31471;&#21475;&#65289;&#12290;&#36825;&#23601;&#26159;&#25152;&#35859;&#30340;&#8220;I/O&#26144;&#23556;&#26041;&#24335;&#8221;&#65288;I/O Mapped&#65289;&#12290;&#19982;RAM&#29289;&#29702;&#22320;&#22336;&#31354;&#38388;&#30456;&#27604;&#65292;I/O&#22320;&#22336;&#31354;&#38388;&#36890;&#24120;&#37117;&#27604;&#36739;&#23567;&#65292;&#22914;x86 CPU&#30340;I/O&#31354;&#38388;&#23601;&#21482;&#26377;64KB&#65288;0-0xffff&#65289;&#12290;&#36825;&#26159;&#8220;I/O&#26144;&#23556;&#26041;&#24335;&#8221;&#30340;&#19968;&#20010;&#20027;&#35201;&#32570;&#28857;&#12290;&#32780;&#19988;&#24517;&#39035;&#35201;&#19987;&#38376;&#30340;&#27719;&#32534;&#25351;&#20196;&#25165;&#33021;&#22788;&#29702;&#12290;
</p>
<p>
&#35775;&#38382;I/O&#31471;&#21475;&#26159;&#38750;&#24120;&#31616;&#21333;&#30340;&#65292;&#20294;&#26159;&#22914;&#20309;&#26816;&#27979;&#21738;&#20123;I/O&#31471;&#21475;&#20998;&#37197;&#32473;&#21738;&#20123;&#35774;&#22791;&#20351;&#29992;&#23601;&#19981;&#37027;&#20040;&#31616;&#21333;&#20102;&#12290;&#36890;&#24120;&#20869;&#26680;&#35774;&#22791;&#39537;&#21160;&#31243;&#24207;&#20026;&#20102;&#25506;&#27979;&#30828;&#20214;&#35774;&#22791;&#65292;&#38656;&#35201;&#30450;&#30446;&#22320;&#21521;&#26576;&#19968;I/O&#31471;&#21475;&#20889;&#20837;&#25968;&#25454;&#65292;&#20294;&#26159;&#22914;&#26524;&#20854;&#20182;&#30828;&#20214;&#35774;&#22791;&#24050;&#32463;&#20351;&#29992;&#20102;&#36825;&#20010;&#21306;&#22495;&#65292;&#37027;&#20040;&#31995;&#32479;&#23601;&#20250;&#23849;&#28291;&#12290;&#20026;&#20102;&#38450;&#27490;&#36825;&#31181;&#24773;&#20917;&#30340;&#21457;&#29983;&#65292;&#20869;&#26680;&#24517;&#39035;&#20351;&#29992;"&#36164;&#28304;"&#26469;&#35760;&#24405;&#20998;&#37197;&#32473;&#27599;&#20010;&#30828;&#20214;&#35774;&#22791;&#30340;I/O&#31471;&#21475;&#12290;
</p>
</div>
</div>
<div class="sect2" title="15.2. &#36164;&#28304;resource"><div class="titlepage"><div><div><h3 class="title"><a name="idp81159324"></a>15.2. &#36164;&#28304;resource</h3></div></div></div>
&#36164;&#28304;(resource)&#34920;&#31034;&#26576;&#20010;&#23454;&#20307;&#30340;&#19968;&#37096;&#20998;&#65292;&#36825;&#37096;&#20998;&#34987;&#20114;&#26021;&#22320;&#38750;&#37197;&#32473;&#35774;&#22791;&#39537;&#21160;&#31243;&#24207;&#12290;Linux&#20013;&#19968;&#20010;&#36164;&#28304;&#34920;&#31034;&#19968;&#23450;&#33539;&#22260;&#30340;I/O&#31471;&#21475;&#22320;&#22336;&#12290;&#27599;&#20010;&#36164;&#28304;&#23545;&#24212;&#30340;&#20449;&#24687;&#20445;&#23384;&#22312;resource&#25968;&#25454;&#32467;&#26500;&#20013;&#12290;&#25152;&#26377;&#30340;&#21516;&#31181;&#36164;&#28304;&#37117;&#25554;&#20837;&#21040;&#19968;&#20010;&#26641;&#24418;&#32467;&#26500;&#20013;&#12290;
<pre class="programlisting">
include/linux/ioport.h

/* Resources are tree-like, allowing nesting etc.. */
struct resource {
        resource_size_t start;
        resource_size_t end;
        const char *name;
        unsigned long flags;
        struct resource *parent, *sibling, *child;
};
</pre>
<div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">name&#36164;&#28304;&#25317;&#26377;&#32773;&#30340;&#25551;&#36848;&#65292;&#23427;&#34987;&#23450;&#20041;&#20026;const&#31867;&#22411;&#65292;&#25152;&#20197;&#26159;&#19968;&#24120;&#37327;&#23383;&#31526;&#20018;&#12290;</li><li class="listitem">start&#21644;end&#21017;&#20195;&#34920;&#20102;&#36164;&#28304;&#33539;&#22260;&#30340;&#36215;&#27490;&#31471;&#21475;&#30340;&#29289;&#29702;&#22320;&#22336;&#12290;</li><li class="listitem">flags&#20013;&#30340;&#19968;&#20123;&#20301;&#25551;&#36848;&#36164;&#28304;&#30340;&#31867;&#22411;&#65292;&#19968;&#20123;&#20301;&#25551;&#36848;&#36164;&#28304;&#30340;&#24403;&#21069;&#29366;&#24577;&#12290;</li><li class="listitem">parent&#65292;sibling&#21644;child&#20998;&#21035;&#25351;&#21521;&#36164;&#28304;&#26641;&#20013;&#24403;&#21069;&#36164;&#28304;&#30340;&#29238;&#65292;&#20804;&#24351;&#21644;&#31532;&#19968;&#20010;&#23401;&#23376;&#33410;&#28857;&#12290;</li></ul></div>
&#24403;&#21069;Linux&#31995;&#32479;&#23450;&#20041;&#20102;&#20004;&#31181;&#36164;&#28304;ioport_resource&#21644;iomem_resource&#65292;&#23427;&#20204;&#23545;&#24212;&#20004;&#31181;I/O&#31471;&#21475;&#35775;&#38382;&#26041;&#24335;&#12290;&#22312;ARM&#19978;&#36890;&#24120;&#21482;&#29992;&#21040;iomem_resource&#12290;
<pre class="programlisting">
kernel/resource.c

struct resource ioport_resource = {
        .name   = "PCI IO",
        .start  = 0,
        .end    = IO_SPACE_LIMIT,
        .flags  = IORESOURCE_IO,
};
EXPORT_SYMBOL(ioport_resource);

struct resource iomem_resource = {
        .name   = "PCI mem",
        .start  = 0,
        .end    = -1,
        .flags  = IORESOURCE_MEM,
};
</pre>
&#33410;&#28857;&#30340;&#34532;&#20180;&#34987;&#25910;&#30410;&#22312;&#19968;&#20010;&#38142;&#34920;&#20013;&#65292;&#20854;&#31532;&#19968;&#20010;&#20803;&#32032;&#30001;child&#25351;&#21521;&#12290;sibling&#23383;&#27573;&#25351;&#21521;&#38142;&#34920;&#20013;&#30340;&#19979;&#19968;&#20010;&#33410;&#28857;&#12290;&#20026;&#20309;&#35201;&#20351;&#29992;&#36825;&#31181;&#26641;&#24418;&#32467;&#26500;&#21602;&#65311;&#19968;&#20010;&#35774;&#22791;&#25511;&#21046;&#22120;&#21487;&#33021;&#25511;&#21046;&#21516;&#19968;&#31867;&#22411;&#30340;&#22810;&#20010;&#35774;&#22791;&#65292;&#37027;&#20040;&#35813;&#25511;&#21046;&#22120;&#23601;&#21487;&#20197;&#20316;&#20026;&#19968;&#20010;&#29238;&#35774;&#22791;&#23384;&#22312;&#65292;&#23427;&#25152;&#21344;&#29992;&#30340;I/O&#31471;&#21475;&#23601;&#38750;&#21035;&#20998;&#37197;&#32473;&#36825;&#20123;&#35774;&#22791;&#20351;&#29992;&#65292;&#37027;&#20040;&#36825;&#20123;&#35774;&#22791;&#23601;&#20381;&#25454;&#23427;&#20204;&#21344;&#25454;I/O&#31471;&#21475;&#22320;&#22336;&#30340;&#39640;&#20302;&#38142;&#25509;&#21040;&#19968;&#20010;&#38142;&#34920;&#20013;&#65292;&#23427;&#20204;&#20043;&#38388;&#24314;&#31435;&#20804;&#24351;&#20851;&#31995;&#65292;&#26368;&#21518;&#31532;&#19968;&#20010;&#35774;&#22791;&#23601;&#21644;&#35813;&#35774;&#22791;&#25511;&#21046;&#22120;&#24314;&#31435;&#29238;&#23376;&#20851;&#31995;&#65292;&#22914;&#19979;&#22270;&#25152;&#31034;&#65306;
<div class="figure"><a name="idp81203244"></a><p class="title"><b>&#22270; 82. I/O&#35774;&#22791;&#20869;&#23384;&#26144;&#23556;&#26641;</b></p><div class="figure-contents"><div><img src="images/res_tree.gif" alt="I/O&#35774;&#22791;&#20869;&#23384;&#26144;&#23556;&#26641;"></div></div></div><br class="figure-break">
&#20869;&#26680;procfs&#25991;&#20214;&#31995;&#32479;&#25552;&#20379;&#20102;&#26597;&#30475;&#24403;&#21069;I/O&#35774;&#22791;&#31471;&#21475;&#25110;&#32773;&#22320;&#22336;&#20351;&#29992;&#24773;&#20917;&#30340;&#25509;&#21475;&#65306;
<pre class="programlisting">
#cat /proc/iomem
# cat /proc/iomem 
50000000-5fffffff : System RAM
  5002a000-504b7fff : Kernel text
  504b8000-5053bc8d : Kernel data
......

#cat /proc/ioports	// &#23545;&#20110;&#20351;&#29992;&#31471;&#21475;&#26144;&#23556;&#26041;&#24335;&#30340;&#31995;&#32479;(ex. x86)
0000-0cf7 : PCI Bus 0000:00
  0000-001f : dma1
  0020-0021 : pic1
  0040-0043 : timer0
......
</pre>
</div>
<div class="sect2" title="15.3. &#31995;&#32479;&#23454;&#29616;"><div class="titlepage"><div><div><h3 class="title"><a name="idp81204316"></a>15.3. &#31995;&#32479;&#23454;&#29616;</h3></div></div></div>
request_resource();
&#25226;&#19968;&#20010;&#32473;&#23450;&#33539;&#22260;&#20998;&#37197;&#32473;&#19968;&#20010;I/O&#35774;&#22791;&#12290;
allocate_resource();
&#22312;&#36164;&#28304;&#26641;&#20013;&#23547;&#25214;&#19968;&#20010;&#32473;&#23450;&#22823;&#23567;&#21644;&#25490;&#21015;&#26041;&#24335;&#30340;&#21487;&#29992;&#33539;&#22260;&#65307;&#33509;&#23384;&#22312;&#65292;&#23601;&#23558;&#36825;&#20010;&#33539;&#22260;&#20998;&#37197;&#32473;&#19968;&#20010;I/O&#35774;&#22791;&#12290;
release_resource();
&#37322;&#25918;&#20197;&#21069;&#20998;&#37197;&#32473;I/O&#35774;&#22791;&#30340;&#32473;&#23450;&#33539;&#22260;&#12290;
&#20869;&#26680;&#20063;&#20026;&#20197;&#19978;&#24212;&#29992;&#20110;I/O&#31471;&#21475;&#30340;&#20989;&#25968;&#23450;&#20041;&#20102;&#19968;&#20123;&#24555;&#25463;&#20989;&#25968;:request_region()&#20174;ioport_resource&#20013;&#33258;&#21160;&#20998;&#37197;&#19968;&#22359;&#28385;&#36275;&#35831;&#27714;&#22823;&#23567;&#30340;&#36164;&#28304;;check_mem_region&#21017;&#26159;&#20174;iomem_resource&#20013;&#20998;&#37197;&#12290;&#19982;&#27492;&#21516;&#26102;release_region&#21644;release_mem_region&#26159;&#23545;&#24212;&#30340;&#36164;&#28304;&#37322;&#25918;&#20989;&#25968;&#12290;
<p>
Linux resource&#26426;&#21046;&#23384;&#22312;&#30340;&#21407;&#22240;&#24635;&#32467;&#22914;&#19979;&#65306;
</p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">&#29992;&#26469;&#35760;&#24405;&#24403;&#21069;&#31995;&#32479;&#20013;I/O&#35774;&#22791;&#23545;&#22320;&#22336;&#25110;&#32773;&#31471;&#21475;&#36164;&#28304;&#30340;&#20351;&#29992;&#24773;&#20917;&#65292;&#26041;&#20415;&#26597;&#35810;&#12290;</li><li class="listitem">&#22312;&#36164;&#28304;&#20998;&#37197;&#35760;&#24405;&#30340;&#22522;&#30784;&#19978;&#23454;&#29616;&#36164;&#28304;&#30340;&#20998;&#37197;&#65292;&#26816;&#26597;&#20197;&#21450;&#22238;&#25910;&#12290;</li><li class="listitem">&#23558;&#35774;&#22791;I/O&#36164;&#28304;&#32479;&#19968;&#31649;&#29702;&#65292;&#23553;&#35013;&#20989;&#25968;&#65292;&#26041;&#20415;&#20351;&#29992;&#12290;resource&#26426;&#21046;&#24182;&#19981;&#20570;&#31471;&#21475;&#21644;&#22320;&#22336;&#21521;&#34394;&#25311;&#22320;&#22336;&#26144;&#23556;&#30340;&#24037;&#20316;&#65292;&#36825;&#20123;&#24037;&#20316;&#22312;&#39029;&#38754;&#21021;&#22987;&#21270;&#20013;&#25110;&#32773;&#36890;&#36807;&#21160;&#24577;&#26144;&#23556;(ioremap)&#20989;&#25968;&#26469;&#23436;&#25104;&#65292;&#21482;&#26377;&#20570;&#36807;&#22320;&#22336;&#26144;&#23556;&#65292;&#25165;&#33021;&#36890;&#36807;&#34394;&#25311;&#22320;&#22336;&#35775;&#38382;&#22806;&#35774;&#12290;</li></ul></div><p>
</p>
</div>
</div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ar01s14.html">&#19978;&#19968;&#39029;</a> </td><td width="20%" align="center"> </td><td width="40%" align="right"> <a accesskey="n" href="ar01s16.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">14. &#20249;&#20276;&#31995;&#32479; </td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top"> 16. &#20013;&#26029;&#22788;&#29702;</td></tr></table></div></body></html>
